garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f26q24.h
// Register: I2C2ERR
#define I2C2ERR I2C2ERR
extern volatile unsigned char           I2C2ERR             __at(0x2AD);
#ifndef _LIB_BUILD
asm("I2C2ERR equ 02ADh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NACKIE                 :1;
        unsigned BCLIE                  :1;
        unsigned BTOIE                  :1;
        unsigned                        :1;
        unsigned NACKIF                 :1;
        unsigned BCLIF                  :1;
        unsigned BTOIF                  :1;
    };
    struct {
        unsigned NACK2IE                :1;
        unsigned BCL2IE                 :1;
        unsigned BTO2IE                 :1;
        unsigned                        :1;
        unsigned NACK2IF                :1;
        unsigned BCL2IF                 :1;
        unsigned BTO2IF                 :1;
    };
} I2C2ERRbits_t;
extern volatile I2C2ERRbits_t I2C2ERRbits __at(0x2AD);
// bitfield macros
#define _I2C2ERR_NACKIE_POSN                                0x0
#define _I2C2ERR_NACKIE_POSITION                            0x0
#define _I2C2ERR_NACKIE_SIZE                                0x1
#define _I2C2ERR_NACKIE_LENGTH                              0x1
#define _I2C2ERR_NACKIE_MASK                                0x1
#define _I2C2ERR_BCLIE_POSN                                 0x1
#define _I2C2ERR_BCLIE_POSITION                             0x1
#define _I2C2ERR_BCLIE_SIZE                                 0x1
#define _I2C2ERR_BCLIE_LENGTH                               0x1
#define _I2C2ERR_BCLIE_MASK                                 0x2
#define _I2C2ERR_BTOIE_POSN                                 0x2
#define _I2C2ERR_BTOIE_POSITION                             0x2
#define _I2C2ERR_BTOIE_SIZE                                 0x1
#define _I2C2ERR_BTOIE_LENGTH                               0x1
#define _I2C2ERR_BTOIE_MASK                                 0x4
#define _I2C2ERR_NACKIF_POSN                                0x4
#define _I2C2ERR_NACKIF_POSITION                            0x4
#define _I2C2ERR_NACKIF_SIZE                                0x1
#define _I2C2ERR_NACKIF_LENGTH                              0x1
#define _I2C2ERR_NACKIF_MASK                                0x10
#define _I2C2ERR_BCLIF_POSN                                 0x5
#define _I2C2ERR_BCLIF_POSITION                             0x5
#define _I2C2ERR_BCLIF_SIZE                                 0x1
#define _I2C2ERR_BCLIF_LENGTH                               0x1
#define _I2C2ERR_BCLIF_MASK                                 0x20
#define _I2C2ERR_BTOIF_POSN                                 0x6
#define _I2C2ERR_BTOIF_POSITION                             0x6
#define _I2C2ERR_BTOIF_SIZE                                 0x1
#define _I2C2ERR_BTOIF_LENGTH                               0x1
#define _I2C2ERR_BTOIF_MASK                                 0x40
#define _I2C2ERR_NACK2IE_POSN                               0x0
#define _I2C2ERR_NACK2IE_POSITION                           0x0
#define _I2C2ERR_NACK2IE_SIZE                               0x1
#define _I2C2ERR_NACK2IE_LENGTH                             0x1
#define _I2C2ERR_NACK2IE_MASK                               0x1
#define _I2C2ERR_BCL2IE_POSN                                0x1
#define _I2C2ERR_BCL2IE_POSITION                            0x1
#define _I2C2ERR_BCL2IE_SIZE                                0x1
#define _I2C2ERR_BCL2IE_LENGTH                              0x1
#define _I2C2ERR_BCL2IE_MASK                                0x2
#define _I2C2ERR_BTO2IE_POSN                                0x2
#define _I2C2ERR_BTO2IE_POSITION                            0x2
#define _I2C2ERR_BTO2IE_SIZE                                0x1
#define _I2C2ERR_BTO2IE_LENGTH                              0x1
#define _I2C2ERR_BTO2IE_MASK                                0x4
#define _I2C2ERR_NACK2IF_POSN                               0x4
#define _I2C2ERR_NACK2IF_POSITION                           0x4
#define _I2C2ERR_NACK2IF_SIZE                               0x1
#define _I2C2ERR_NACK2IF_LENGTH                             0x1
#define _I2C2ERR_NACK2IF_MASK                               0x10
#define _I2C2ERR_BCL2IF_POSN                                0x5
#define _I2C2ERR_BCL2IF_POSITION                            0x5
#define _I2C2ERR_BCL2IF_SIZE                                0x1
#define _I2C2ERR_BCL2IF_LENGTH                              0x1
#define _I2C2ERR_BCL2IF_MASK                                0x20
#define _I2C2ERR_BTO2IF_POSN                                0x6
#define _I2C2ERR_BTO2IF_POSITION                            0x6
#define _I2C2ERR_BTO2IF_SIZE                                0x1
#define _I2C2ERR_BTO2IF_LENGTH                              0x1
#define _I2C2ERR_BTO2IF_MASK                                0x40

// Register: I2C2STAT0
#define I2C2STAT0 I2C2STAT0
extern volatile unsigned char           I2C2STAT0           __at(0x2AE);
#ifndef _LIB_BUILD
asm("I2C2STAT0 equ 02AEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned D                      :1;
        unsigned R                      :1;
        unsigned MMA                    :1;
        unsigned SMA                    :1;
        unsigned BFRE                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned DATA                   :1;
        unsigned READ                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned NOT_ADDRESS            :1;
        unsigned NOT_WRITE              :1;
    };
    struct {
        unsigned                        :3;
        unsigned NOT_A                  :1;
        unsigned NOT_W                  :1;
    };
} I2C2STAT0bits_t;
extern volatile I2C2STAT0bits_t I2C2STAT0bits __at(0x2AE);
// bitfield macros
#define _I2C2STAT0_D_POSN                                   0x3
#define _I2C2STAT0_D_POSITION                               0x3
#define _I2C2STAT0_D_SIZE                                   0x1
#define _I2C2STAT0_D_LENGTH                                 0x1
#define _I2C2STAT0_D_MASK                                   0x8
#define _I2C2STAT0_R_POSN                                   0x4
#define _I2C2STAT0_R_POSITION                               0x4
#define _I2C2STAT0_R_SIZE                                   0x1
#define _I2C2STAT0_R_LENGTH                                 0x1
#define _I2C2STAT0_R_MASK                                   0x10
#define _I2C2STAT0_MMA_POSN                                 0x5
#define _I2C2STAT0_MMA_POSITION                             0x5
#define _I2C2STAT0_MMA_SIZE                                 0x1
#define _I2C2STAT0_MMA_LENGTH                               0x1
#define _I2C2STAT0_MMA_MASK                                 0x20
#define _I2C2STAT0_SMA_POSN                                 0x6
#define _I2C2STAT0_SMA_POSITION                             0x6
#define _I2C2STAT0_SMA_SIZE                                 0x1
#define _I2C2STAT0_SMA_LENGTH                               0x1
#define _I2C2STAT0_SMA_MASK                                 0x40
#define _I2C2STAT0_BFRE_POSN                                0x7
#define _I2C2STAT0_BFRE_POSITION                            0x7
#define _I2C2STAT0_BFRE_SIZE                                0x1
#define _I2C2STAT0_BFRE_LENGTH                              0x1
#define _I2C2STAT0_BFRE_MASK                                0x80
#define _I2C2STAT0_DATA_POSN                                0x3
#define _I2C2STAT0_DATA_POSITION                            0x3
#define _I2C2STAT0_DATA_SIZE                                0x1
#define _I2C2STAT0_DATA_LENGTH                              0x1
#define _I2C2STAT0_DATA_MASK                                0x8
#define _I2C2STAT0_READ_POSN                                0x4
#define _I2C2STAT0_READ_POSITION                            0x4
#define _I2C2STAT0_READ_SIZE                                0x1
#define _I2C2STAT0_READ_LENGTH                              0x1
#define _I2C2STAT0_READ_MASK                                0x10
#define _I2C2STAT0_NOT_ADDRESS_POSN                         0x3
#define _I2C2STAT0_NOT_ADDRESS_POSITION                     0x3
#define _I2C2STAT0_NOT_ADDRESS_SIZE                         0x1
#define _I2C2STAT0_NOT_ADDRESS_LENGTH                       0x1
#define _I2C2STAT0_NOT_ADDRESS_MASK                         0x8
#define _I2C2STAT0_NOT_WRITE_POSN                           0x4
#define _I2C2STAT0_NOT_WRITE_POSITION                       0x4
#define _I2C2STAT0_NOT_WRITE_SIZE                           0x1
#define _I2C2STAT0_NOT_WRITE_LENGTH                         0x1
#define _I2C2STAT0_NOT_WRITE_MASK                           0x10
#define _I2C2STAT0_NOT_A_POSN                               0x3
#define _I2C2STAT0_NOT_A_POSITION                           0x3
#define _I2C2STAT0_NOT_A_SIZE                               0x1
#define _I2C2STAT0_NOT_A_LENGTH                             0x1
#define _I2C2STAT0_NOT_A_MASK                               0x8
#define _I2C2STAT0_NOT_W_POSN                               0x4
#define _I2C2STAT0_NOT_W_POSITION                           0x4
#define _I2C2STAT0_NOT_W_SIZE                               0x1
#define _I2C2STAT0_NOT_W_LENGTH                             0x1
#define _I2C2STAT0_NOT_W_MASK                               0x10

// Register: I2C2STAT1
#define I2C2STAT1 I2C2STAT1
extern volatile unsigned char           I2C2STAT1           __at(0x2AF);
#ifndef _LIB_BUILD
asm("I2C2STAT1 equ 02AFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXBF                   :1;
        unsigned                        :1;
        unsigned CLRBF                  :1;
        unsigned RXRE                   :1;
        unsigned                        :1;
        unsigned TXBE                   :1;
        unsigned                        :1;
        unsigned TXWE                   :1;
    };
} I2C2STAT1bits_t;
extern volatile I2C2STAT1bits_t I2C2STAT1bits __at(0x2AF);
// bitfield macros
#define _I2C2STAT1_RXBF_POSN                                0x0
#define _I2C2STAT1_RXBF_POSITION                            0x0
#define _I2C2STAT1_RXBF_SIZE                                0x1
#define _I2C2STAT1_RXBF_LENGTH                              0x1
#define _I2C2STAT1_RXBF_MASK                                0x1
#define _I2C2STAT1_CLRBF_POSN                               0x2
#define _I2C2STAT1_CLRBF_POSITION                           0x2
#define _I2C2STAT1_CLRBF_SIZE                               0x1
#define _I2C2STAT1_CLRBF_LENGTH                             0x1
#define _I2C2STAT1_CLRBF_MASK                               0x4
#define _I2C2STAT1_RXRE_POSN                                0x3
#define _I2C2STAT1_RXRE_POSITION                            0x3
#define _I2C2STAT1_RXRE_SIZE                                0x1
#define _I2C2STAT1_RXRE_LENGTH                              0x1
#define _I2C2STAT1_RXRE_MASK                                0x8
#define _I2C2STAT1_TXBE_POSN                                0x5
#define _I2C2STAT1_TXBE_POSITION                            0x5
#define _I2C2STAT1_TXBE_SIZE                                0x1
#define _I2C2STAT1_TXBE_LENGTH                              0x1
#define _I2C2STAT1_TXBE_MASK                                0x20
#define _I2C2STAT1_TXWE_POSN                                0x7
#define _I2C2STAT1_TXWE_POSITION                            0x7
#define _I2C2STAT1_TXWE_SIZE                                0x1
#define _I2C2STAT1_TXWE_LENGTH                              0x1
#define _I2C2STAT1_TXWE_MASK                                0x80

// Register: I2C2PIR
#define I2C2PIR I2C2PIR
extern volatile unsigned char           I2C2PIR             __at(0x2B0);
#ifndef _LIB_BUILD
asm("I2C2PIR equ 02B0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SCIF                   :1;
        unsigned RSCIF                  :1;
        unsigned PCIF                   :1;
        unsigned ADRIF                  :1;
        unsigned WRIF                   :1;
        unsigned                        :1;
        unsigned ACKTIF                 :1;
        unsigned CNTIF                  :1;
    };
    struct {
        unsigned SC2IF                  :1;
        unsigned RSC2IF                 :1;
        unsigned PC2IF                  :1;
        unsigned ADR2IF                 :1;
        unsigned WR2IF                  :1;
        unsigned                        :1;
        unsigned ACKT2IF                :1;
        unsigned CNT2IF                 :1;
    };
} I2C2PIRbits_t;
extern volatile I2C2PIRbits_t I2C2PIRbits __at(0x2B0);
// bitfield macros
#define _I2C2PIR_SCIF_POSN                                  0x0
#define _I2C2PIR_SCIF_POSITION                              0x0
#define _I2C2PIR_SCIF_SIZE                                  0x1
#define _I2C2PIR_SCIF_LENGTH                                0x1
#define _I2C2PIR_SCIF_MASK                                  0x1
#define _I2C2PIR_RSCIF_POSN                                 0x1
#define _I2C2PIR_RSCIF_POSITION                             0x1
#define _I2C2PIR_RSCIF_SIZE                                 0x1
#define _I2C2PIR_RSCIF_LENGTH                               0x1
#define _I2C2PIR_RSCIF_MASK                                 0x2
#define _I2C2PIR_PCIF_POSN                                  0x2
#define _I2C2PIR_PCIF_POSITION                              0x2
#define _I2C2PIR_PCIF_SIZE                                  0x1
#define _I2C2PIR_PCIF_LENGTH                                0x1
#define _I2C2PIR_PCIF_MASK                                  0x4
#define _I2C2PIR_ADRIF_POSN                                 0x3
#define _I2C2PIR_ADRIF_POSITION                             0x3
#define _I2C2PIR_ADRIF_SIZE                                 0x1
#define _I2C2PIR_ADRIF_LENGTH                               0x1
#define _I2C2PIR_ADRIF_MASK                                 0x8
#define _I2C2PIR_WRIF_POSN                                  0x4
#define _I2C2PIR_WRIF_POSITION                              0x4
#define _I2C2PIR_WRIF_SIZE                                  0x1
#define _I2C2PIR_WRIF_LENGTH                                0x1
#define _I2C2PIR_WRIF_MASK                                  0x10
#define _I2C2PIR_ACKTIF_POSN                                0x6
#define _I2C2PIR_ACKTIF_POSITION                            0x6
#define _I2C2PIR_ACKTIF_SIZE                                0x1
#define _I2C2PIR_ACKTIF_LENGTH                              0x1
#define _I2C2PIR_ACKTIF_MASK                                0x40
#define _I2C2PIR_CNTIF_POSN                                 0x7
#define _I2C2PIR_CNTIF_POSITION                             0x7
#define _I2C2PIR_CNTIF_SIZE                                 0x1
#define _I2C2PIR_CNTIF_LENGTH                               0x1
#define _I2C2PIR_CNTIF_MASK                                 0x80
#define _I2C2PIR_SC2IF_POSN                                 0x0
#define _I2C2PIR_SC2IF_POSITION                             0x0
#define _I2C2PIR_SC2IF_SIZE                                 0x1
#define _I2C2PIR_SC2IF_LENGTH                               0x1
#define _I2C2PIR_SC2IF_MASK                                 0x1
#define _I2C2PIR_RSC2IF_POSN                                0x1
#define _I2C2PIR_RSC2IF_POSITION                            0x1
#define _I2C2PIR_RSC2IF_SIZE                                0x1
#define _I2C2PIR_RSC2IF_LENGTH                              0x1
#define _I2C2PIR_RSC2IF_MASK                                0x2
#define _I2C2PIR_PC2IF_POSN                                 0x2
#define _I2C2PIR_PC2IF_POSITION                             0x2
#define _I2C2PIR_PC2IF_SIZE                                 0x1
#define _I2C2PIR_PC2IF_LENGTH                               0x1
#define _I2C2PIR_PC2IF_MASK                                 0x4
#define _I2C2PIR_ADR2IF_POSN                                0x3
#define _I2C2PIR_ADR2IF_POSITION                            0x3
#define _I2C2PIR_ADR2IF_SIZE                                0x1
#define _I2C2PIR_ADR2IF_LENGTH                              0x1
#define _I2C2PIR_ADR2IF_MASK                                0x8
#define _I2C2PIR_WR2IF_POSN                                 0x4
#define _I2C2PIR_WR2IF_POSITION                             0x4
#define _I2C2PIR_WR2IF_SIZE                                 0x1
#define _I2C2PIR_WR2IF_LENGTH                               0x1
#define _I2C2PIR_WR2IF_MASK                                 0x10
#define _I2C2PIR_ACKT2IF_POSN                               0x6
#define _I2C2PIR_ACKT2IF_POSITION                           0x6
#define _I2C2PIR_ACKT2IF_SIZE                               0x1
#define _I2C2PIR_ACKT2IF_LENGTH                             0x1
#define _I2C2PIR_ACKT2IF_MASK                               0x40
#define _I2C2PIR_CNT2IF_POSN                                0x7
#define _I2C2PIR_CNT2IF_POSITION                            0x7
#define _I2C2PIR_CNT2IF_SIZE                                0x1
#define _I2C2PIR_CNT2IF_LENGTH                              0x1
#define _I2C2PIR_CNT2IF_MASK                                0x80

// Register: I2C2PIE
#define I2C2PIE I2C2PIE
extern volatile unsigned char           I2C2PIE             __at(0x2B1);
#ifndef _LIB_BUILD
asm("I2C2PIE equ 02B1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SCIE                   :1;
        unsigned RSCIE                  :1;
        unsigned PCIE                   :1;
        unsigned ADRIE                  :1;
        unsigned WRIE                   :1;
        unsigned                        :1;
        unsigned ACKTIE                 :1;
        unsigned CNTIE                  :1;
    };
    struct {
        unsigned SC2IE                  :1;
        unsigned RSC2IE                 :1;
        unsigned PC2IE                  :1;
        unsigned ADR2IE                 :1;
        unsigned WR2IE                  :1;
        unsigned                        :1;
        unsigned ACKT2IE                :1;
        unsigned CNT2IE                 :1;
    };
} I2C2PIEbits_t;
extern volatile I2C2PIEbits_t I2C2PIEbits __at(0x2B1);
// bitfield macros
#define _I2C2PIE_SCIE_POSN                                  0x0
#define _I2C2PIE_SCIE_POSITION                              0x0
#define _I2C2PIE_SCIE_SIZE                                  0x1
#define _I2C2PIE_SCIE_LENGTH                                0x1
#define _I2C2PIE_SCIE_MASK                                  0x1
#define _I2C2PIE_RSCIE_POSN                                 0x1
#define _I2C2PIE_RSCIE_POSITION                             0x1
#define _I2C2PIE_RSCIE_SIZE                                 0x1
#define _I2C2PIE_RSCIE_LENGTH                               0x1
#define _I2C2PIE_RSCIE_MASK                                 0x2
#define _I2C2PIE_PCIE_POSN                                  0x2
#define _I2C2PIE_PCIE_POSITION                              0x2
#define _I2C2PIE_PCIE_SIZE                                  0x1
#define _I2C2PIE_PCIE_LENGTH                                0x1
#define _I2C2PIE_PCIE_MASK                                  0x4
#define _I2C2PIE_ADRIE_POSN                                 0x3
#define _I2C2PIE_ADRIE_POSITION                             0x3
#define _I2C2PIE_ADRIE_SIZE                                 0x1
#define _I2C2PIE_ADRIE_LENGTH                               0x1
#define _I2C2PIE_ADRIE_MASK                                 0x8
#define _I2C2PIE_WRIE_POSN                                  0x4
#define _I2C2PIE_WRIE_POSITION                              0x4
#define _I2C2PIE_WRIE_SIZE                                  0x1
#define _I2C2PIE_WRIE_LENGTH                                0x1
#define _I2C2PIE_WRIE_MASK                                  0x10
#define _I2C2PIE_ACKTIE_POSN                                0x6
#define _I2C2PIE_ACKTIE_POSITION                            0x6
#define _I2C2PIE_ACKTIE_SIZE                                0x1
#define _I2C2PIE_ACKTIE_LENGTH                              0x1
#define _I2C2PIE_ACKTIE_MASK                                0x40
#define _I2C2PIE_CNTIE_POSN                                 0x7
#define _I2C2PIE_CNTIE_POSITION                             0x7
#define _I2C2PIE_CNTIE_SIZE                                 0x1
#define _I2C2PIE_CNTIE_LENGTH                               0x1
#define _I2C2PIE_CNTIE_MASK                                 0x80
#define _I2C2PIE_SC2IE_POSN                                 0x0
#define _I2C2PIE_SC2IE_POSITION                             0x0
#define _I2C2PIE_SC2IE_SIZE                                 0x1
#define _I2C2PIE_SC2IE_LENGTH                               0x1
#define _I2C2PIE_SC2IE_MASK                                 0x1
#define _I2C2PIE_RSC2IE_POSN                                0x1
#define _I2C2PIE_RSC2IE_POSITION                            0x1
#define _I2C2PIE_RSC2IE_SIZE                                0x1
#define _I2C2PIE_RSC2IE_LENGTH                              0x1
#define _I2C2PIE_RSC2IE_MASK                                0x2
#define _I2C2PIE_PC2IE_POSN                                 0x2
#define _I2C2PIE_PC2IE_POSITION                             0x2
#define _I2C2PIE_PC2IE_SIZE                                 0x1
#define _I2C2PIE_PC2IE_LENGTH                               0x1
#define _I2C2PIE_PC2IE_MASK                                 0x4
#define _I2C2PIE_ADR2IE_POSN                                0x3
#define _I2C2PIE_ADR2IE_POSITION                            0x3
#define _I2C2PIE_ADR2IE_SIZE                                0x1
#define _I2C2PIE_ADR2IE_LENGTH                              0x1
#define _I2C2PIE_ADR2IE_MASK                                0x8
#define _I2C2PIE_WR2IE_POSN                                 0x4
#define _I2C2PIE_WR2IE_POSITION                             0x4
#define _I2C2PIE_WR2IE_SIZE                                 0x1
#define _I2C2PIE_WR2IE_LENGTH                               0x1
#define _I2C2PIE_WR2IE_MASK                                 0x10
#define _I2C2PIE_ACKT2IE_POSN                               0x6
#define _I2C2PIE_ACKT2IE_POSITION                           0x6
#define _I2C2PIE_ACKT2IE_SIZE                               0x1
#define _I2C2PIE_ACKT2IE_LENGTH                             0x1
#define _I2C2PIE_ACKT2IE_MASK                               0x40
#define _I2C2PIE_CNT2IE_POSN                                0x7
#define _I2C2PIE_CNT2IE_POSITION                            0x7
#define _I2C2PIE_CNT2IE_SIZE                                0x1
#define _I2C2PIE_CNT2IE_LENGTH                              0x1
#define _I2C2PIE_CNT2IE_MASK                                0x80

// Register: I2C2BTO
#define I2C2BTO I2C2BTO
extern volatile unsigned char           I2C2BTO             __at(0x2B2);
#ifndef _LIB_BUILD
asm("I2C2BTO equ 02B2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TOTIME                 :6;
        unsigned TOBY32                 :1;
        unsigned TOREC                  :1;
    };
    struct {
        unsigned TOTIME0                :1;
        unsigned TOTIME1                :1;
        unsigned TOTIME2                :1;
        unsigned TOTIME3                :1;
        unsigned TOTIME4                :1;
        unsigned TOTIME5                :1;
    };
} I2C2BTObits_t;
