garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f26q24.h
// Register: IVTBASEH
#define IVTBASEH IVTBASEH
extern volatile unsigned char           IVTBASEH            __at(0x45E);
#ifndef _LIB_BUILD
asm("IVTBASEH equ 045Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BASE8                  :1;
        unsigned BASE9                  :1;
        unsigned BASE10                 :1;
        unsigned BASE11                 :1;
        unsigned BASE12                 :1;
        unsigned BASE13                 :1;
        unsigned BASE14                 :1;
        unsigned BASE15                 :1;
    };
} IVTBASEHbits_t;
extern volatile IVTBASEHbits_t IVTBASEHbits __at(0x45E);
// bitfield macros
#define _IVTBASEH_BASE8_POSN                                0x0
#define _IVTBASEH_BASE8_POSITION                            0x0
#define _IVTBASEH_BASE8_SIZE                                0x1
#define _IVTBASEH_BASE8_LENGTH                              0x1
#define _IVTBASEH_BASE8_MASK                                0x1
#define _IVTBASEH_BASE9_POSN                                0x1
#define _IVTBASEH_BASE9_POSITION                            0x1
#define _IVTBASEH_BASE9_SIZE                                0x1
#define _IVTBASEH_BASE9_LENGTH                              0x1
#define _IVTBASEH_BASE9_MASK                                0x2
#define _IVTBASEH_BASE10_POSN                               0x2
#define _IVTBASEH_BASE10_POSITION                           0x2
#define _IVTBASEH_BASE10_SIZE                               0x1
#define _IVTBASEH_BASE10_LENGTH                             0x1
#define _IVTBASEH_BASE10_MASK                               0x4
#define _IVTBASEH_BASE11_POSN                               0x3
#define _IVTBASEH_BASE11_POSITION                           0x3
#define _IVTBASEH_BASE11_SIZE                               0x1
#define _IVTBASEH_BASE11_LENGTH                             0x1
#define _IVTBASEH_BASE11_MASK                               0x8
#define _IVTBASEH_BASE12_POSN                               0x4
#define _IVTBASEH_BASE12_POSITION                           0x4
#define _IVTBASEH_BASE12_SIZE                               0x1
#define _IVTBASEH_BASE12_LENGTH                             0x1
#define _IVTBASEH_BASE12_MASK                               0x10
#define _IVTBASEH_BASE13_POSN                               0x5
#define _IVTBASEH_BASE13_POSITION                           0x5
#define _IVTBASEH_BASE13_SIZE                               0x1
#define _IVTBASEH_BASE13_LENGTH                             0x1
#define _IVTBASEH_BASE13_MASK                               0x20
#define _IVTBASEH_BASE14_POSN                               0x6
#define _IVTBASEH_BASE14_POSITION                           0x6
#define _IVTBASEH_BASE14_SIZE                               0x1
#define _IVTBASEH_BASE14_LENGTH                             0x1
#define _IVTBASEH_BASE14_MASK                               0x40
#define _IVTBASEH_BASE15_POSN                               0x7
#define _IVTBASEH_BASE15_POSITION                           0x7
#define _IVTBASEH_BASE15_SIZE                               0x1
#define _IVTBASEH_BASE15_LENGTH                             0x1
#define _IVTBASEH_BASE15_MASK                               0x80

// Register: IVTBASEU
#define IVTBASEU IVTBASEU
extern volatile unsigned char           IVTBASEU            __at(0x45F);
#ifndef _LIB_BUILD
asm("IVTBASEU equ 045Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BASE16                 :1;
        unsigned BASE17                 :1;
        unsigned BASE18                 :1;
        unsigned BASE19                 :1;
        unsigned BASE20                 :1;
    };
} IVTBASEUbits_t;
extern volatile IVTBASEUbits_t IVTBASEUbits __at(0x45F);
// bitfield macros
#define _IVTBASEU_BASE16_POSN                               0x0
#define _IVTBASEU_BASE16_POSITION                           0x0
#define _IVTBASEU_BASE16_SIZE                               0x1
#define _IVTBASEU_BASE16_LENGTH                             0x1
#define _IVTBASEU_BASE16_MASK                               0x1
#define _IVTBASEU_BASE17_POSN                               0x1
#define _IVTBASEU_BASE17_POSITION                           0x1
#define _IVTBASEU_BASE17_SIZE                               0x1
#define _IVTBASEU_BASE17_LENGTH                             0x1
#define _IVTBASEU_BASE17_MASK                               0x2
#define _IVTBASEU_BASE18_POSN                               0x2
#define _IVTBASEU_BASE18_POSITION                           0x2
#define _IVTBASEU_BASE18_SIZE                               0x1
#define _IVTBASEU_BASE18_LENGTH                             0x1
#define _IVTBASEU_BASE18_MASK                               0x4
#define _IVTBASEU_BASE19_POSN                               0x3
#define _IVTBASEU_BASE19_POSITION                           0x3
#define _IVTBASEU_BASE19_SIZE                               0x1
#define _IVTBASEU_BASE19_LENGTH                             0x1
#define _IVTBASEU_BASE19_MASK                               0x8
#define _IVTBASEU_BASE20_POSN                               0x4
#define _IVTBASEU_BASE20_POSITION                           0x4
#define _IVTBASEU_BASE20_SIZE                               0x1
#define _IVTBASEU_BASE20_LENGTH                             0x1
#define _IVTBASEU_BASE20_MASK                               0x10

// Register: PWM1ERS
#define PWM1ERS PWM1ERS
extern volatile unsigned char           PWM1ERS             __at(0x460);
#ifndef _LIB_BUILD
asm("PWM1ERS equ 0460h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ERS                    :8;
    };
    struct {
        unsigned ERS0                   :1;
        unsigned ERS1                   :1;
        unsigned ERS2                   :1;
        unsigned ERS3                   :1;
    };
} PWM1ERSbits_t;
extern volatile PWM1ERSbits_t PWM1ERSbits __at(0x460);
// bitfield macros
#define _PWM1ERS_ERS_POSN                                   0x0
#define _PWM1ERS_ERS_POSITION                               0x0
#define _PWM1ERS_ERS_SIZE                                   0x8
#define _PWM1ERS_ERS_LENGTH                                 0x8
#define _PWM1ERS_ERS_MASK                                   0xFF
#define _PWM1ERS_ERS0_POSN                                  0x0
#define _PWM1ERS_ERS0_POSITION                              0x0
#define _PWM1ERS_ERS0_SIZE                                  0x1
#define _PWM1ERS_ERS0_LENGTH                                0x1
#define _PWM1ERS_ERS0_MASK                                  0x1
#define _PWM1ERS_ERS1_POSN                                  0x1
#define _PWM1ERS_ERS1_POSITION                              0x1
#define _PWM1ERS_ERS1_SIZE                                  0x1
#define _PWM1ERS_ERS1_LENGTH                                0x1
#define _PWM1ERS_ERS1_MASK                                  0x2
#define _PWM1ERS_ERS2_POSN                                  0x2
#define _PWM1ERS_ERS2_POSITION                              0x2
#define _PWM1ERS_ERS2_SIZE                                  0x1
#define _PWM1ERS_ERS2_LENGTH                                0x1
#define _PWM1ERS_ERS2_MASK                                  0x4
#define _PWM1ERS_ERS3_POSN                                  0x3
#define _PWM1ERS_ERS3_POSITION                              0x3
#define _PWM1ERS_ERS3_SIZE                                  0x1
#define _PWM1ERS_ERS3_LENGTH                                0x1
#define _PWM1ERS_ERS3_MASK                                  0x8

// Register: PWM1CLK
#define PWM1CLK PWM1CLK
extern volatile unsigned char           PWM1CLK             __at(0x461);
#ifndef _LIB_BUILD
asm("PWM1CLK equ 0461h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLK                    :8;
    };
    struct {
        unsigned CLK0                   :1;
        unsigned CLK1                   :1;
        unsigned CLK2                   :1;
        unsigned CLK3                   :1;
        unsigned CLK4                   :1;
    };
} PWM1CLKbits_t;
extern volatile PWM1CLKbits_t PWM1CLKbits __at(0x461);
// bitfield macros
#define _PWM1CLK_CLK_POSN                                   0x0
#define _PWM1CLK_CLK_POSITION                               0x0
#define _PWM1CLK_CLK_SIZE                                   0x8
#define _PWM1CLK_CLK_LENGTH                                 0x8
#define _PWM1CLK_CLK_MASK                                   0xFF
#define _PWM1CLK_CLK0_POSN                                  0x0
#define _PWM1CLK_CLK0_POSITION                              0x0
#define _PWM1CLK_CLK0_SIZE                                  0x1
#define _PWM1CLK_CLK0_LENGTH                                0x1
#define _PWM1CLK_CLK0_MASK                                  0x1
#define _PWM1CLK_CLK1_POSN                                  0x1
#define _PWM1CLK_CLK1_POSITION                              0x1
#define _PWM1CLK_CLK1_SIZE                                  0x1
#define _PWM1CLK_CLK1_LENGTH                                0x1
#define _PWM1CLK_CLK1_MASK                                  0x2
#define _PWM1CLK_CLK2_POSN                                  0x2
#define _PWM1CLK_CLK2_POSITION                              0x2
#define _PWM1CLK_CLK2_SIZE                                  0x1
#define _PWM1CLK_CLK2_LENGTH                                0x1
#define _PWM1CLK_CLK2_MASK                                  0x4
#define _PWM1CLK_CLK3_POSN                                  0x3
#define _PWM1CLK_CLK3_POSITION                              0x3
#define _PWM1CLK_CLK3_SIZE                                  0x1
#define _PWM1CLK_CLK3_LENGTH                                0x1
#define _PWM1CLK_CLK3_MASK                                  0x8
#define _PWM1CLK_CLK4_POSN                                  0x4
#define _PWM1CLK_CLK4_POSITION                              0x4
#define _PWM1CLK_CLK4_SIZE                                  0x1
#define _PWM1CLK_CLK4_LENGTH                                0x1
#define _PWM1CLK_CLK4_MASK                                  0x10

// Register: PWM1LDS
#define PWM1LDS PWM1LDS
extern volatile unsigned char           PWM1LDS             __at(0x462);
#ifndef _LIB_BUILD
asm("PWM1LDS equ 0462h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LDS                    :8;
    };
    struct {
        unsigned LDS0                   :1;
        unsigned LDS1                   :1;
        unsigned LDS2                   :1;
        unsigned LDS3                   :1;
    };
} PWM1LDSbits_t;
extern volatile PWM1LDSbits_t PWM1LDSbits __at(0x462);
// bitfield macros
#define _PWM1LDS_LDS_POSN                                   0x0
#define _PWM1LDS_LDS_POSITION                               0x0
#define _PWM1LDS_LDS_SIZE                                   0x8
#define _PWM1LDS_LDS_LENGTH                                 0x8
#define _PWM1LDS_LDS_MASK                                   0xFF
#define _PWM1LDS_LDS0_POSN                                  0x0
#define _PWM1LDS_LDS0_POSITION                              0x0
#define _PWM1LDS_LDS0_SIZE                                  0x1
#define _PWM1LDS_LDS0_LENGTH                                0x1
#define _PWM1LDS_LDS0_MASK                                  0x1
#define _PWM1LDS_LDS1_POSN                                  0x1
#define _PWM1LDS_LDS1_POSITION                              0x1
#define _PWM1LDS_LDS1_SIZE                                  0x1
#define _PWM1LDS_LDS1_LENGTH                                0x1
#define _PWM1LDS_LDS1_MASK                                  0x2
#define _PWM1LDS_LDS2_POSN                                  0x2
#define _PWM1LDS_LDS2_POSITION                              0x2
#define _PWM1LDS_LDS2_SIZE                                  0x1
#define _PWM1LDS_LDS2_LENGTH                                0x1
#define _PWM1LDS_LDS2_MASK                                  0x4
#define _PWM1LDS_LDS3_POSN                                  0x3
#define _PWM1LDS_LDS3_POSITION                              0x3
#define _PWM1LDS_LDS3_SIZE                                  0x1
#define _PWM1LDS_LDS3_LENGTH                                0x1
#define _PWM1LDS_LDS3_MASK                                  0x8

// Register: PWM1PR
#define PWM1PR PWM1PR
extern volatile unsigned short          PWM1PR              __at(0x463);
#ifndef _LIB_BUILD
asm("PWM1PR equ 0463h");
#endif

// Register: PWM1PRL
#define PWM1PRL PWM1PRL
extern volatile unsigned char           PWM1PRL             __at(0x463);
#ifndef _LIB_BUILD
asm("PWM1PRL equ 0463h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRL                    :8;
    };
} PWM1PRLbits_t;
extern volatile PWM1PRLbits_t PWM1PRLbits __at(0x463);
// bitfield macros
#define _PWM1PRL_PRL_POSN                                   0x0
#define _PWM1PRL_PRL_POSITION                               0x0
#define _PWM1PRL_PRL_SIZE                                   0x8
#define _PWM1PRL_PRL_LENGTH                                 0x8
#define _PWM1PRL_PRL_MASK                                   0xFF

// Register: PWM1PRH
#define PWM1PRH PWM1PRH
extern volatile unsigned char           PWM1PRH             __at(0x464);
#ifndef _LIB_BUILD
asm("PWM1PRH equ 0464h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRH                    :8;
    };
} PWM1PRHbits_t;
