garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f26q24.h
extern volatile PIR4bits_t PIR4bits __at(0x4BA);
// bitfield macros
#define _PIR4_U1RXIF_POSN                                   0x0
#define _PIR4_U1RXIF_POSITION                               0x0
#define _PIR4_U1RXIF_SIZE                                   0x1
#define _PIR4_U1RXIF_LENGTH                                 0x1
#define _PIR4_U1RXIF_MASK                                   0x1
#define _PIR4_U1TXIF_POSN                                   0x1
#define _PIR4_U1TXIF_POSITION                               0x1
#define _PIR4_U1TXIF_SIZE                                   0x1
#define _PIR4_U1TXIF_LENGTH                                 0x1
#define _PIR4_U1TXIF_MASK                                   0x2
#define _PIR4_U1EIF_POSN                                    0x2
#define _PIR4_U1EIF_POSITION                                0x2
#define _PIR4_U1EIF_SIZE                                    0x1
#define _PIR4_U1EIF_LENGTH                                  0x1
#define _PIR4_U1EIF_MASK                                    0x4
#define _PIR4_U1IF_POSN                                     0x3
#define _PIR4_U1IF_POSITION                                 0x3
#define _PIR4_U1IF_SIZE                                     0x1
#define _PIR4_U1IF_LENGTH                                   0x1
#define _PIR4_U1IF_MASK                                     0x8
#define _PIR4_TMR3IF_POSN                                   0x4
#define _PIR4_TMR3IF_POSITION                               0x4
#define _PIR4_TMR3IF_SIZE                                   0x1
#define _PIR4_TMR3IF_LENGTH                                 0x1
#define _PIR4_TMR3IF_MASK                                   0x10
#define _PIR4_TMR3GIF_POSN                                  0x5
#define _PIR4_TMR3GIF_POSITION                              0x5
#define _PIR4_TMR3GIF_SIZE                                  0x1
#define _PIR4_TMR3GIF_LENGTH                                0x1
#define _PIR4_TMR3GIF_MASK                                  0x20
#define _PIR4_PWM1PIF_POSN                                  0x6
#define _PIR4_PWM1PIF_POSITION                              0x6
#define _PIR4_PWM1PIF_SIZE                                  0x1
#define _PIR4_PWM1PIF_LENGTH                                0x1
#define _PIR4_PWM1PIF_MASK                                  0x40
#define _PIR4_PWM1IF_POSN                                   0x7
#define _PIR4_PWM1IF_POSITION                               0x7
#define _PIR4_PWM1IF_SIZE                                   0x1
#define _PIR4_PWM1IF_LENGTH                                 0x1
#define _PIR4_PWM1IF_MASK                                   0x80

// Register: PIR5
#define PIR5 PIR5
extern volatile unsigned char           PIR5                __at(0x4BB);
#ifndef _LIB_BUILD
asm("PIR5 equ 04BBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned CLC6IF                 :1;
        unsigned TU16AIF                :1;
        unsigned TMR6IF                 :1;
        unsigned C2IF                   :1;
        unsigned CLC2IF                 :1;
        unsigned PWM2PIF                :1;
        unsigned PWM2IF                 :1;
    };
} PIR5bits_t;
extern volatile PIR5bits_t PIR5bits __at(0x4BB);
// bitfield macros
#define _PIR5_CLC6IF_POSN                                   0x1
#define _PIR5_CLC6IF_POSITION                               0x1
#define _PIR5_CLC6IF_SIZE                                   0x1
#define _PIR5_CLC6IF_LENGTH                                 0x1
#define _PIR5_CLC6IF_MASK                                   0x2
#define _PIR5_TU16AIF_POSN                                  0x2
#define _PIR5_TU16AIF_POSITION                              0x2
#define _PIR5_TU16AIF_SIZE                                  0x1
#define _PIR5_TU16AIF_LENGTH                                0x1
#define _PIR5_TU16AIF_MASK                                  0x4
#define _PIR5_TMR6IF_POSN                                   0x3
#define _PIR5_TMR6IF_POSITION                               0x3
#define _PIR5_TMR6IF_SIZE                                   0x1
#define _PIR5_TMR6IF_LENGTH                                 0x1
#define _PIR5_TMR6IF_MASK                                   0x8
#define _PIR5_C2IF_POSN                                     0x4
#define _PIR5_C2IF_POSITION                                 0x4
#define _PIR5_C2IF_SIZE                                     0x1
#define _PIR5_C2IF_LENGTH                                   0x1
#define _PIR5_C2IF_MASK                                     0x10
#define _PIR5_CLC2IF_POSN                                   0x5
#define _PIR5_CLC2IF_POSITION                               0x5
#define _PIR5_CLC2IF_SIZE                                   0x1
#define _PIR5_CLC2IF_LENGTH                                 0x1
#define _PIR5_CLC2IF_MASK                                   0x20
#define _PIR5_PWM2PIF_POSN                                  0x6
#define _PIR5_PWM2PIF_POSITION                              0x6
#define _PIR5_PWM2PIF_SIZE                                  0x1
#define _PIR5_PWM2PIF_LENGTH                                0x1
#define _PIR5_PWM2PIF_MASK                                  0x40
#define _PIR5_PWM2IF_POSN                                   0x7
#define _PIR5_PWM2IF_POSITION                               0x7
#define _PIR5_PWM2IF_SIZE                                   0x1
#define _PIR5_PWM2IF_LENGTH                                 0x1
#define _PIR5_PWM2IF_MASK                                   0x80

// Register: PIR6
#define PIR6 PIR6
extern volatile unsigned char           PIR6                __at(0x4BC);
#ifndef _LIB_BUILD
asm("PIR6 equ 04BCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT1IF                 :1;
        unsigned CLC7IF                 :1;
        unsigned CWG1IF                 :1;
        unsigned NCO1IF                 :1;
        unsigned DMA2SCNTIF             :1;
        unsigned DMA2DCNTIF             :1;
        unsigned DMA2ORIF               :1;
        unsigned DMA2AIF                :1;
    };
} PIR6bits_t;
extern volatile PIR6bits_t PIR6bits __at(0x4BC);
// bitfield macros
#define _PIR6_INT1IF_POSN                                   0x0
#define _PIR6_INT1IF_POSITION                               0x0
#define _PIR6_INT1IF_SIZE                                   0x1
#define _PIR6_INT1IF_LENGTH                                 0x1
#define _PIR6_INT1IF_MASK                                   0x1
#define _PIR6_CLC7IF_POSN                                   0x1
#define _PIR6_CLC7IF_POSITION                               0x1
#define _PIR6_CLC7IF_SIZE                                   0x1
#define _PIR6_CLC7IF_LENGTH                                 0x1
#define _PIR6_CLC7IF_MASK                                   0x2
#define _PIR6_CWG1IF_POSN                                   0x2
#define _PIR6_CWG1IF_POSITION                               0x2
#define _PIR6_CWG1IF_SIZE                                   0x1
#define _PIR6_CWG1IF_LENGTH                                 0x1
#define _PIR6_CWG1IF_MASK                                   0x4
#define _PIR6_NCO1IF_POSN                                   0x3
#define _PIR6_NCO1IF_POSITION                               0x3
#define _PIR6_NCO1IF_SIZE                                   0x1
#define _PIR6_NCO1IF_LENGTH                                 0x1
#define _PIR6_NCO1IF_MASK                                   0x8
#define _PIR6_DMA2SCNTIF_POSN                               0x4
#define _PIR6_DMA2SCNTIF_POSITION                           0x4
#define _PIR6_DMA2SCNTIF_SIZE                               0x1
#define _PIR6_DMA2SCNTIF_LENGTH                             0x1
#define _PIR6_DMA2SCNTIF_MASK                               0x10
#define _PIR6_DMA2DCNTIF_POSN                               0x5
#define _PIR6_DMA2DCNTIF_POSITION                           0x5
#define _PIR6_DMA2DCNTIF_SIZE                               0x1
#define _PIR6_DMA2DCNTIF_LENGTH                             0x1
#define _PIR6_DMA2DCNTIF_MASK                               0x20
#define _PIR6_DMA2ORIF_POSN                                 0x6
#define _PIR6_DMA2ORIF_POSITION                             0x6
#define _PIR6_DMA2ORIF_SIZE                                 0x1
#define _PIR6_DMA2ORIF_LENGTH                               0x1
#define _PIR6_DMA2ORIF_MASK                                 0x40
#define _PIR6_DMA2AIF_POSN                                  0x7
#define _PIR6_DMA2AIF_POSITION                              0x7
#define _PIR6_DMA2AIF_SIZE                                  0x1
#define _PIR6_DMA2AIF_LENGTH                                0x1
#define _PIR6_DMA2AIF_MASK                                  0x80

