garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f26q24.h
extern volatile __bit                   INT1PPS0            __at(0x11F8);	// @ (0x23F * 8 + 0)
#define                                 INT1PPS0_bit        _BIT_ACCESS(INT1PPS,0)
// INT1PPS<INT1PPS1>
extern volatile __bit                   INT1PPS1            __at(0x11F9);	// @ (0x23F * 8 + 1)
#define                                 INT1PPS1_bit        _BIT_ACCESS(INT1PPS,1)
// INT1PPS<INT1PPS2>
extern volatile __bit                   INT1PPS2            __at(0x11FA);	// @ (0x23F * 8 + 2)
#define                                 INT1PPS2_bit        _BIT_ACCESS(INT1PPS,2)
// INT1PPS<INT1PPS3>
extern volatile __bit                   INT1PPS3            __at(0x11FB);	// @ (0x23F * 8 + 3)
#define                                 INT1PPS3_bit        _BIT_ACCESS(INT1PPS,3)
// INT1PPS<INT1PPS4>
extern volatile __bit                   INT1PPS4            __at(0x11FC);	// @ (0x23F * 8 + 4)
#define                                 INT1PPS4_bit        _BIT_ACCESS(INT1PPS,4)
// INT1PPS<INT1PPS5>
extern volatile __bit                   INT1PPS5            __at(0x11FD);	// @ (0x23F * 8 + 5)
#define                                 INT1PPS5_bit        _BIT_ACCESS(INT1PPS,5)
// INTCON0<INT2EDG>
extern volatile __bit                   INT2EDG             __at(0x26B2);	// @ (0x4D6 * 8 + 2)
#define                                 INT2EDG_bit         _BIT_ACCESS(INTCON0,2)
// PIE10<INT2IE>
extern volatile __bit                   INT2IE              __at(0x25A0);	// @ (0x4B4 * 8 + 0)
#define                                 INT2IE_bit          _BIT_ACCESS(PIE10,0)
// PIR10<INT2IF>
extern volatile __bit                   INT2IF              __at(0x2600);	// @ (0x4C0 * 8 + 0)
#define                                 INT2IF_bit          _BIT_ACCESS(PIR10,0)
// IPR10<INT2IP>
extern volatile __bit                   INT2IP              __at(0x2540);	// @ (0x4A8 * 8 + 0)
#define                                 INT2IP_bit          _BIT_ACCESS(IPR10,0)
// INT2PPS<INT2PPS0>
extern volatile __bit                   INT2PPS0            __at(0x1200);	// @ (0x240 * 8 + 0)
#define                                 INT2PPS0_bit        _BIT_ACCESS(INT2PPS,0)
// INT2PPS<INT2PPS1>
extern volatile __bit                   INT2PPS1            __at(0x1201);	// @ (0x240 * 8 + 1)
#define                                 INT2PPS1_bit        _BIT_ACCESS(INT2PPS,1)
// INT2PPS<INT2PPS2>
extern volatile __bit                   INT2PPS2            __at(0x1202);	// @ (0x240 * 8 + 2)
#define                                 INT2PPS2_bit        _BIT_ACCESS(INT2PPS,2)
// INT2PPS<INT2PPS3>
extern volatile __bit                   INT2PPS3            __at(0x1203);	// @ (0x240 * 8 + 3)
#define                                 INT2PPS3_bit        _BIT_ACCESS(INT2PPS,3)
// INT2PPS<INT2PPS4>
extern volatile __bit                   INT2PPS4            __at(0x1204);	// @ (0x240 * 8 + 4)
#define                                 INT2PPS4_bit        _BIT_ACCESS(INT2PPS,4)
// INT2PPS<INT2PPS5>
extern volatile __bit                   INT2PPS5            __at(0x1205);	// @ (0x240 * 8 + 5)
#define                                 INT2PPS5_bit        _BIT_ACCESS(INT2PPS,5)
// HLVDCON0<INTH>
extern volatile __bit                   INTH                __at(0x251);	// @ (0x4A * 8 + 1)
#define                                 INTH_bit            _BIT_ACCESS(HLVDCON0,1)
// HLVDCON0<INTL>
extern volatile __bit                   INTL                __at(0x250);	// @ (0x4A * 8 + 0)
#define                                 INTL_bit            _BIT_ACCESS(HLVDCON0,0)
// IOCAF<IOCAF0>
extern volatile __bit                   IOCAF0              __at(0x2038);	// @ (0x407 * 8 + 0)
#define                                 IOCAF0_bit          _BIT_ACCESS(IOCAF,0)
// IOCAF<IOCAF1>
extern volatile __bit                   IOCAF1              __at(0x2039);	// @ (0x407 * 8 + 1)
#define                                 IOCAF1_bit          _BIT_ACCESS(IOCAF,1)
// IOCAF<IOCAF2>
extern volatile __bit                   IOCAF2              __at(0x203A);	// @ (0x407 * 8 + 2)
#define                                 IOCAF2_bit          _BIT_ACCESS(IOCAF,2)
// IOCAF<IOCAF3>
extern volatile __bit                   IOCAF3              __at(0x203B);	// @ (0x407 * 8 + 3)
#define                                 IOCAF3_bit          _BIT_ACCESS(IOCAF,3)
// IOCAF<IOCAF4>
extern volatile __bit                   IOCAF4              __at(0x203C);	// @ (0x407 * 8 + 4)
#define                                 IOCAF4_bit          _BIT_ACCESS(IOCAF,4)
// IOCAF<IOCAF5>
extern volatile __bit                   IOCAF5              __at(0x203D);	// @ (0x407 * 8 + 5)
#define                                 IOCAF5_bit          _BIT_ACCESS(IOCAF,5)
// IOCAF<IOCAF6>
extern volatile __bit                   IOCAF6              __at(0x203E);	// @ (0x407 * 8 + 6)
#define                                 IOCAF6_bit          _BIT_ACCESS(IOCAF,6)
// IOCAF<IOCAF7>
extern volatile __bit                   IOCAF7              __at(0x203F);	// @ (0x407 * 8 + 7)
#define                                 IOCAF7_bit          _BIT_ACCESS(IOCAF,7)
// IOCAN<IOCAN0>
extern volatile __bit                   IOCAN0              __at(0x2030);	// @ (0x406 * 8 + 0)
#define                                 IOCAN0_bit          _BIT_ACCESS(IOCAN,0)
// IOCAN<IOCAN1>
extern volatile __bit                   IOCAN1              __at(0x2031);	// @ (0x406 * 8 + 1)
#define                                 IOCAN1_bit          _BIT_ACCESS(IOCAN,1)
// IOCAN<IOCAN2>
extern volatile __bit                   IOCAN2              __at(0x2032);	// @ (0x406 * 8 + 2)
#define                                 IOCAN2_bit          _BIT_ACCESS(IOCAN,2)
// IOCAN<IOCAN3>
extern volatile __bit                   IOCAN3              __at(0x2033);	// @ (0x406 * 8 + 3)
#define                                 IOCAN3_bit          _BIT_ACCESS(IOCAN,3)
// IOCAN<IOCAN4>
extern volatile __bit                   IOCAN4              __at(0x2034);	// @ (0x406 * 8 + 4)
#define                                 IOCAN4_bit          _BIT_ACCESS(IOCAN,4)
// IOCAN<IOCAN5>
extern volatile __bit                   IOCAN5              __at(0x2035);	// @ (0x406 * 8 + 5)
#define                                 IOCAN5_bit          _BIT_ACCESS(IOCAN,5)
// IOCAN<IOCAN6>
extern volatile __bit                   IOCAN6              __at(0x2036);	// @ (0x406 * 8 + 6)
#define                                 IOCAN6_bit          _BIT_ACCESS(IOCAN,6)
// IOCAN<IOCAN7>
extern volatile __bit                   IOCAN7              __at(0x2037);	// @ (0x406 * 8 + 7)
#define                                 IOCAN7_bit          _BIT_ACCESS(IOCAN,7)
// IOCAP<IOCAP0>
extern volatile __bit                   IOCAP0              __at(0x2028);	// @ (0x405 * 8 + 0)
#define                                 IOCAP0_bit          _BIT_ACCESS(IOCAP,0)
// IOCAP<IOCAP1>
extern volatile __bit                   IOCAP1              __at(0x2029);	// @ (0x405 * 8 + 1)
#define                                 IOCAP1_bit          _BIT_ACCESS(IOCAP,1)
// IOCAP<IOCAP2>
extern volatile __bit                   IOCAP2              __at(0x202A);	// @ (0x405 * 8 + 2)
#define                                 IOCAP2_bit          _BIT_ACCESS(IOCAP,2)
// IOCAP<IOCAP3>
extern volatile __bit                   IOCAP3              __at(0x202B);	// @ (0x405 * 8 + 3)
#define                                 IOCAP3_bit          _BIT_ACCESS(IOCAP,3)
// IOCAP<IOCAP4>
extern volatile __bit                   IOCAP4              __at(0x202C);	// @ (0x405 * 8 + 4)
#define                                 IOCAP4_bit          _BIT_ACCESS(IOCAP,4)
// IOCAP<IOCAP5>
extern volatile __bit                   IOCAP5              __at(0x202D);	// @ (0x405 * 8 + 5)
#define                                 IOCAP5_bit          _BIT_ACCESS(IOCAP,5)
// IOCAP<IOCAP6>
extern volatile __bit                   IOCAP6              __at(0x202E);	// @ (0x405 * 8 + 6)
#define                                 IOCAP6_bit          _BIT_ACCESS(IOCAP,6)
// IOCAP<IOCAP7>
extern volatile __bit                   IOCAP7              __at(0x202F);	// @ (0x405 * 8 + 7)
#define                                 IOCAP7_bit          _BIT_ACCESS(IOCAP,7)
// IOCBF<IOCBF0>
extern volatile __bit                   IOCBF0              __at(0x2078);	// @ (0x40F * 8 + 0)
#define                                 IOCBF0_bit          _BIT_ACCESS(IOCBF,0)
// IOCBF<IOCBF1>
extern volatile __bit                   IOCBF1              __at(0x2079);	// @ (0x40F * 8 + 1)
#define                                 IOCBF1_bit          _BIT_ACCESS(IOCBF,1)
// IOCBF<IOCBF2>
extern volatile __bit                   IOCBF2              __at(0x207A);	// @ (0x40F * 8 + 2)
#define                                 IOCBF2_bit          _BIT_ACCESS(IOCBF,2)
// IOCBF<IOCBF3>
extern volatile __bit                   IOCBF3              __at(0x207B);	// @ (0x40F * 8 + 3)
#define                                 IOCBF3_bit          _BIT_ACCESS(IOCBF,3)
// IOCBF<IOCBF4>
extern volatile __bit                   IOCBF4              __at(0x207C);	// @ (0x40F * 8 + 4)
#define                                 IOCBF4_bit          _BIT_ACCESS(IOCBF,4)
// IOCBF<IOCBF5>
extern volatile __bit                   IOCBF5              __at(0x207D);	// @ (0x40F * 8 + 5)
#define                                 IOCBF5_bit          _BIT_ACCESS(IOCBF,5)
// IOCBF<IOCBF6>
extern volatile __bit                   IOCBF6              __at(0x207E);	// @ (0x40F * 8 + 6)
#define                                 IOCBF6_bit          _BIT_ACCESS(IOCBF,6)
// IOCBF<IOCBF7>
extern volatile __bit                   IOCBF7              __at(0x207F);	// @ (0x40F * 8 + 7)
#define                                 IOCBF7_bit          _BIT_ACCESS(IOCBF,7)
// IOCBN<IOCBN0>
extern volatile __bit                   IOCBN0              __at(0x2070);	// @ (0x40E * 8 + 0)
#define                                 IOCBN0_bit          _BIT_ACCESS(IOCBN,0)
// IOCBN<IOCBN1>
extern volatile __bit                   IOCBN1              __at(0x2071);	// @ (0x40E * 8 + 1)
#define                                 IOCBN1_bit          _BIT_ACCESS(IOCBN,1)
// IOCBN<IOCBN2>
extern volatile __bit                   IOCBN2              __at(0x2072);	// @ (0x40E * 8 + 2)
#define                                 IOCBN2_bit          _BIT_ACCESS(IOCBN,2)
// IOCBN<IOCBN3>
extern volatile __bit                   IOCBN3              __at(0x2073);	// @ (0x40E * 8 + 3)
#define                                 IOCBN3_bit          _BIT_ACCESS(IOCBN,3)
// IOCBN<IOCBN4>
extern volatile __bit                   IOCBN4              __at(0x2074);	// @ (0x40E * 8 + 4)
#define                                 IOCBN4_bit          _BIT_ACCESS(IOCBN,4)
// IOCBN<IOCBN5>
extern volatile __bit                   IOCBN5              __at(0x2075);	// @ (0x40E * 8 + 5)
#define                                 IOCBN5_bit          _BIT_ACCESS(IOCBN,5)
// IOCBN<IOCBN6>
extern volatile __bit                   IOCBN6              __at(0x2076);	// @ (0x40E * 8 + 6)
#define                                 IOCBN6_bit          _BIT_ACCESS(IOCBN,6)
// IOCBN<IOCBN7>
extern volatile __bit                   IOCBN7              __at(0x2077);	// @ (0x40E * 8 + 7)
#define                                 IOCBN7_bit          _BIT_ACCESS(IOCBN,7)
// IOCBP<IOCBP0>
extern volatile __bit                   IOCBP0              __at(0x2068);	// @ (0x40D * 8 + 0)
#define                                 IOCBP0_bit          _BIT_ACCESS(IOCBP,0)
// IOCBP<IOCBP1>
extern volatile __bit                   IOCBP1              __at(0x2069);	// @ (0x40D * 8 + 1)
#define                                 IOCBP1_bit          _BIT_ACCESS(IOCBP,1)
// IOCBP<IOCBP2>
extern volatile __bit                   IOCBP2              __at(0x206A);	// @ (0x40D * 8 + 2)
#define                                 IOCBP2_bit          _BIT_ACCESS(IOCBP,2)
// IOCBP<IOCBP3>
extern volatile __bit                   IOCBP3              __at(0x206B);	// @ (0x40D * 8 + 3)
#define                                 IOCBP3_bit          _BIT_ACCESS(IOCBP,3)
// IOCBP<IOCBP4>
extern volatile __bit                   IOCBP4              __at(0x206C);	// @ (0x40D * 8 + 4)
#define                                 IOCBP4_bit          _BIT_ACCESS(IOCBP,4)
// IOCBP<IOCBP5>
extern volatile __bit                   IOCBP5              __at(0x206D);	// @ (0x40D * 8 + 5)
#define                                 IOCBP5_bit          _BIT_ACCESS(IOCBP,5)
// IOCBP<IOCBP6>
extern volatile __bit                   IOCBP6              __at(0x206E);	// @ (0x40D * 8 + 6)
#define                                 IOCBP6_bit          _BIT_ACCESS(IOCBP,6)
// IOCBP<IOCBP7>
extern volatile __bit                   IOCBP7              __at(0x206F);	// @ (0x40D * 8 + 7)
#define                                 IOCBP7_bit          _BIT_ACCESS(IOCBP,7)
// IOCCF<IOCCF0>
extern volatile __bit                   IOCCF0              __at(0x20B8);	// @ (0x417 * 8 + 0)
#define                                 IOCCF0_bit          _BIT_ACCESS(IOCCF,0)
// IOCCF<IOCCF1>
extern volatile __bit                   IOCCF1              __at(0x20B9);	// @ (0x417 * 8 + 1)
#define                                 IOCCF1_bit          _BIT_ACCESS(IOCCF,1)
// IOCCF<IOCCF2>
extern volatile __bit                   IOCCF2              __at(0x20BA);	// @ (0x417 * 8 + 2)
#define                                 IOCCF2_bit          _BIT_ACCESS(IOCCF,2)
// IOCCF<IOCCF3>
extern volatile __bit                   IOCCF3              __at(0x20BB);	// @ (0x417 * 8 + 3)
#define                                 IOCCF3_bit          _BIT_ACCESS(IOCCF,3)
// IOCCF<IOCCF4>
extern volatile __bit                   IOCCF4              __at(0x20BC);	// @ (0x417 * 8 + 4)
#define                                 IOCCF4_bit          _BIT_ACCESS(IOCCF,4)
// IOCCF<IOCCF5>
extern volatile __bit                   IOCCF5              __at(0x20BD);	// @ (0x417 * 8 + 5)
#define                                 IOCCF5_bit          _BIT_ACCESS(IOCCF,5)
// IOCCF<IOCCF6>
extern volatile __bit                   IOCCF6              __at(0x20BE);	// @ (0x417 * 8 + 6)
#define                                 IOCCF6_bit          _BIT_ACCESS(IOCCF,6)
// IOCCN<IOCCN0>
extern volatile __bit                   IOCCN0              __at(0x20B0);	// @ (0x416 * 8 + 0)
#define                                 IOCCN0_bit          _BIT_ACCESS(IOCCN,0)
// IOCCN<IOCCN1>
extern volatile __bit                   IOCCN1              __at(0x20B1);	// @ (0x416 * 8 + 1)
#define                                 IOCCN1_bit          _BIT_ACCESS(IOCCN,1)
// IOCCN<IOCCN2>
extern volatile __bit                   IOCCN2              __at(0x20B2);	// @ (0x416 * 8 + 2)
#define                                 IOCCN2_bit          _BIT_ACCESS(IOCCN,2)
// IOCCN<IOCCN3>
extern volatile __bit                   IOCCN3              __at(0x20B3);	// @ (0x416 * 8 + 3)
#define                                 IOCCN3_bit          _BIT_ACCESS(IOCCN,3)
// IOCCN<IOCCN4>
extern volatile __bit                   IOCCN4              __at(0x20B4);	// @ (0x416 * 8 + 4)
#define                                 IOCCN4_bit          _BIT_ACCESS(IOCCN,4)
// IOCCN<IOCCN5>
extern volatile __bit                   IOCCN5              __at(0x20B5);	// @ (0x416 * 8 + 5)
#define                                 IOCCN5_bit          _BIT_ACCESS(IOCCN,5)
// IOCCN<IOCCN6>
extern volatile __bit                   IOCCN6              __at(0x20B6);	// @ (0x416 * 8 + 6)
#define                                 IOCCN6_bit          _BIT_ACCESS(IOCCN,6)
// IOCCP<IOCCP0>
extern volatile __bit                   IOCCP0              __at(0x20A8);	// @ (0x415 * 8 + 0)
#define                                 IOCCP0_bit          _BIT_ACCESS(IOCCP,0)
// IOCCP<IOCCP1>
extern volatile __bit                   IOCCP1              __at(0x20A9);	// @ (0x415 * 8 + 1)
#define                                 IOCCP1_bit          _BIT_ACCESS(IOCCP,1)
// IOCCP<IOCCP2>
extern volatile __bit                   IOCCP2              __at(0x20AA);	// @ (0x415 * 8 + 2)
#define                                 IOCCP2_bit          _BIT_ACCESS(IOCCP,2)
// IOCCP<IOCCP3>
extern volatile __bit                   IOCCP3              __at(0x20AB);	// @ (0x415 * 8 + 3)
#define                                 IOCCP3_bit          _BIT_ACCESS(IOCCP,3)
// IOCCP<IOCCP4>
extern volatile __bit                   IOCCP4              __at(0x20AC);	// @ (0x415 * 8 + 4)
#define                                 IOCCP4_bit          _BIT_ACCESS(IOCCP,4)
// IOCCP<IOCCP5>
extern volatile __bit                   IOCCP5              __at(0x20AD);	// @ (0x415 * 8 + 5)
#define                                 IOCCP5_bit          _BIT_ACCESS(IOCCP,5)
// IOCCP<IOCCP6>
extern volatile __bit                   IOCCP6              __at(0x20AE);	// @ (0x415 * 8 + 6)
#define                                 IOCCP6_bit          _BIT_ACCESS(IOCCP,6)
// PIE0<IOCIE>
extern volatile __bit                   IOCIE               __at(0x2557);	// @ (0x4AA * 8 + 7)
#define                                 IOCIE_bit           _BIT_ACCESS(PIE0,7)
// PIR0<IOCIF>
extern volatile __bit                   IOCIF               __at(0x25B7);	// @ (0x4B6 * 8 + 7)
#define                                 IOCIF_bit           _BIT_ACCESS(PIR0,7)
// IPR0<IOCIP>
extern volatile __bit                   IOCIP               __at(0x24F7);	// @ (0x49E * 8 + 7)
#define                                 IOCIP_bit           _BIT_ACCESS(IPR0,7)
// PMD0<IOCMD>
extern volatile __bit                   IOCMD               __at(0x310);	// @ (0x62 * 8 + 0)
#define                                 IOCMD_bit           _BIT_ACCESS(PMD0,0)
// PIE2<IOCSRIE>
extern volatile __bit                   IOCSRIE             __at(0x2562);	// @ (0x4AC * 8 + 2)
#define                                 IOCSRIE_bit         _BIT_ACCESS(PIE2,2)
// PIR2<IOCSRIF>
extern volatile __bit                   IOCSRIF             __at(0x25C2);	// @ (0x4B8 * 8 + 2)
#define                                 IOCSRIF_bit         _BIT_ACCESS(PIR2,2)
// IPR2<IOCSRIP>
extern volatile __bit                   IOCSRIP             __at(0x2502);	// @ (0x4A0 * 8 + 2)
#define                                 IOCSRIP_bit         _BIT_ACCESS(IPR2,2)
// IOCWF<IOCWF0>
extern volatile __bit                   IOCWF0              __at(0x21F8);	// @ (0x43F * 8 + 0)
#define                                 IOCWF0_bit          _BIT_ACCESS(IOCWF,0)
// IOCWF<IOCWF1>
extern volatile __bit                   IOCWF1              __at(0x21F9);	// @ (0x43F * 8 + 1)
#define                                 IOCWF1_bit          _BIT_ACCESS(IOCWF,1)
// IOCWF<IOCWF2>
extern volatile __bit                   IOCWF2              __at(0x21FA);	// @ (0x43F * 8 + 2)
#define                                 IOCWF2_bit          _BIT_ACCESS(IOCWF,2)
// IOCWF<IOCWF3>
extern volatile __bit                   IOCWF3              __at(0x21FB);	// @ (0x43F * 8 + 3)
#define                                 IOCWF3_bit          _BIT_ACCESS(IOCWF,3)
// IOCWF<IOCWF4>
extern volatile __bit                   IOCWF4              __at(0x21FC);	// @ (0x43F * 8 + 4)
#define                                 IOCWF4_bit          _BIT_ACCESS(IOCWF,4)
// IOCWF<IOCWF5>
extern volatile __bit                   IOCWF5              __at(0x21FD);	// @ (0x43F * 8 + 5)
#define                                 IOCWF5_bit          _BIT_ACCESS(IOCWF,5)
// IOCWF<IOCWF6>
extern volatile __bit                   IOCWF6              __at(0x21FE);	// @ (0x43F * 8 + 6)
#define                                 IOCWF6_bit          _BIT_ACCESS(IOCWF,6)
// IOCWF<IOCWF7>
extern volatile __bit                   IOCWF7              __at(0x21FF);	// @ (0x43F * 8 + 7)
#define                                 IOCWF7_bit          _BIT_ACCESS(IOCWF,7)
// IOCWN<IOCWN0>
extern volatile __bit                   IOCWN0              __at(0x21F0);	// @ (0x43E * 8 + 0)
#define                                 IOCWN0_bit          _BIT_ACCESS(IOCWN,0)
// IOCWN<IOCWN1>
extern volatile __bit                   IOCWN1              __at(0x21F1);	// @ (0x43E * 8 + 1)
#define                                 IOCWN1_bit          _BIT_ACCESS(IOCWN,1)
// IOCWN<IOCWN2>
extern volatile __bit                   IOCWN2              __at(0x21F2);	// @ (0x43E * 8 + 2)
#define                                 IOCWN2_bit          _BIT_ACCESS(IOCWN,2)
// IOCWN<IOCWN3>
extern volatile __bit                   IOCWN3              __at(0x21F3);	// @ (0x43E * 8 + 3)
#define                                 IOCWN3_bit          _BIT_ACCESS(IOCWN,3)
// IOCWN<IOCWN4>
extern volatile __bit                   IOCWN4              __at(0x21F4);	// @ (0x43E * 8 + 4)
#define                                 IOCWN4_bit          _BIT_ACCESS(IOCWN,4)
// IOCWN<IOCWN5>
extern volatile __bit                   IOCWN5              __at(0x21F5);	// @ (0x43E * 8 + 5)
#define                                 IOCWN5_bit          _BIT_ACCESS(IOCWN,5)
// IOCWN<IOCWN6>
extern volatile __bit                   IOCWN6              __at(0x21F6);	// @ (0x43E * 8 + 6)
#define                                 IOCWN6_bit          _BIT_ACCESS(IOCWN,6)
// IOCWN<IOCWN7>
extern volatile __bit                   IOCWN7              __at(0x21F7);	// @ (0x43E * 8 + 7)
#define                                 IOCWN7_bit          _BIT_ACCESS(IOCWN,7)
// IOCWP<IOCWP0>
extern volatile __bit                   IOCWP0              __at(0x21E8);	// @ (0x43D * 8 + 0)
#define                                 IOCWP0_bit          _BIT_ACCESS(IOCWP,0)
// IOCWP<IOCWP1>
extern volatile __bit                   IOCWP1              __at(0x21E9);	// @ (0x43D * 8 + 1)
#define                                 IOCWP1_bit          _BIT_ACCESS(IOCWP,1)
// IOCWP<IOCWP2>
extern volatile __bit                   IOCWP2              __at(0x21EA);	// @ (0x43D * 8 + 2)
#define                                 IOCWP2_bit          _BIT_ACCESS(IOCWP,2)
// IOCWP<IOCWP3>
extern volatile __bit                   IOCWP3              __at(0x21EB);	// @ (0x43D * 8 + 3)
#define                                 IOCWP3_bit          _BIT_ACCESS(IOCWP,3)
// IOCWP<IOCWP4>
extern volatile __bit                   IOCWP4              __at(0x21EC);	// @ (0x43D * 8 + 4)
#define                                 IOCWP4_bit          _BIT_ACCESS(IOCWP,4)
// IOCWP<IOCWP5>
extern volatile __bit                   IOCWP5              __at(0x21ED);	// @ (0x43D * 8 + 5)
#define                                 IOCWP5_bit          _BIT_ACCESS(IOCWP,5)
// IOCWP<IOCWP6>
extern volatile __bit                   IOCWP6              __at(0x21EE);	// @ (0x43D * 8 + 6)
#define                                 IOCWP6_bit          _BIT_ACCESS(IOCWP,6)
// IOCWP<IOCWP7>
extern volatile __bit                   IOCWP7              __at(0x21EF);	// @ (0x43D * 8 + 7)
#define                                 IOCWP7_bit          _BIT_ACCESS(IOCWP,7)
// CWG1ISM<ISM0>
extern volatile __bit                   ISM0                __at(0x1DE8);	// @ (0x3BD * 8 + 0)
#define                                 ISM0_bit            _BIT_ACCESS(CWG1ISM,0)
// CWG1ISM<ISM1>
extern volatile __bit                   ISM1                __at(0x1DE9);	// @ (0x3BD * 8 + 1)
#define                                 ISM1_bit            _BIT_ACCESS(CWG1ISM,1)
// CWG1ISM<ISM2>
extern volatile __bit                   ISM2                __at(0x1DEA);	// @ (0x3BD * 8 + 2)
#define                                 ISM2_bit            _BIT_ACCESS(CWG1ISM,2)
// CWG1ISM<ISM3>
extern volatile __bit                   ISM3                __at(0x1DEB);	// @ (0x3BD * 8 + 3)
#define                                 ISM3_bit            _BIT_ACCESS(CWG1ISM,3)
// CWG1ISM<ISM4>
extern volatile __bit                   ISM4                __at(0x1DEC);	// @ (0x3BD * 8 + 4)
#define                                 ISM4_bit            _BIT_ACCESS(CWG1ISM,4)
// ISRPR<ISRPR0>
extern volatile __bit                   ISRPR0              __at(0x5F8);	// @ (0xBF * 8 + 0)
#define                                 ISRPR0_bit          _BIT_ACCESS(ISRPR,0)
// ISRPR<ISRPR1>
