garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f26q24.h
#define                                 ODCB3_bit           _BIT_ACCESS(ODCONB,3)
// ODCONB<ODCB4>
extern volatile __bit                   ODCB4               __at(0x2054);	// @ (0x40A * 8 + 4)
#define                                 ODCB4_bit           _BIT_ACCESS(ODCONB,4)
// ODCONB<ODCB5>
extern volatile __bit                   ODCB5               __at(0x2055);	// @ (0x40A * 8 + 5)
#define                                 ODCB5_bit           _BIT_ACCESS(ODCONB,5)
// ODCONB<ODCB6>
extern volatile __bit                   ODCB6               __at(0x2056);	// @ (0x40A * 8 + 6)
#define                                 ODCB6_bit           _BIT_ACCESS(ODCONB,6)
// ODCONB<ODCB7>
extern volatile __bit                   ODCB7               __at(0x2057);	// @ (0x40A * 8 + 7)
#define                                 ODCB7_bit           _BIT_ACCESS(ODCONB,7)
// ODCONC<ODCC0>
extern volatile __bit                   ODCC0               __at(0x2090);	// @ (0x412 * 8 + 0)
#define                                 ODCC0_bit           _BIT_ACCESS(ODCONC,0)
// ODCONC<ODCC1>
extern volatile __bit                   ODCC1               __at(0x2091);	// @ (0x412 * 8 + 1)
#define                                 ODCC1_bit           _BIT_ACCESS(ODCONC,1)
// ODCONC<ODCC2>
extern volatile __bit                   ODCC2               __at(0x2092);	// @ (0x412 * 8 + 2)
#define                                 ODCC2_bit           _BIT_ACCESS(ODCONC,2)
// ODCONC<ODCC3>
extern volatile __bit                   ODCC3               __at(0x2093);	// @ (0x412 * 8 + 3)
#define                                 ODCC3_bit           _BIT_ACCESS(ODCONC,3)
// ODCONC<ODCC4>
extern volatile __bit                   ODCC4               __at(0x2094);	// @ (0x412 * 8 + 4)
#define                                 ODCC4_bit           _BIT_ACCESS(ODCONC,4)
// ODCONC<ODCC5>
extern volatile __bit                   ODCC5               __at(0x2095);	// @ (0x412 * 8 + 5)
#define                                 ODCC5_bit           _BIT_ACCESS(ODCONC,5)
// ODCONC<ODCC6>
extern volatile __bit                   ODCC6               __at(0x2096);	// @ (0x412 * 8 + 6)
#define                                 ODCC6_bit           _BIT_ACCESS(ODCONC,6)
// DAC1CON<OE0>
extern volatile __bit                   OE0                 __at(0x3FC);	// @ (0x7F * 8 + 4)
#define                                 OE0_bit             _BIT_ACCESS(DAC1CON,4)
// DAC1CON<OE1>
extern volatile __bit                   OE1                 __at(0x3FD);	// @ (0x7F * 8 + 5)
#define                                 OE1_bit             _BIT_ACCESS(DAC1CON,5)
// OSCCON3<ORDY>
extern volatile __bit                   ORDY                __at(0x57C);	// @ (0xAF * 8 + 4)
#define                                 ORDY_bit            _BIT_ACCESS(OSCCON3,4)
// ACTCON<ORS>
extern volatile __bit                   ORS                 __at(0x561);	// @ (0xAC * 8 + 1)
#define                                 ORS_bit             _BIT_ACCESS(ACTCON,1)
// PIE0<OSFIE>
extern volatile __bit                   OSFIE               __at(0x2552);	// @ (0x4AA * 8 + 2)
#define                                 OSFIE_bit           _BIT_ACCESS(PIE0,2)
// PIR0<OSFIF>
extern volatile __bit                   OSFIF               __at(0x25B2);	// @ (0x4B6 * 8 + 2)
#define                                 OSFIF_bit           _BIT_ACCESS(PIR0,2)
// IPR0<OSFIP>
extern volatile __bit                   OSFIP               __at(0x24F2);	// @ (0x49E * 8 + 2)
#define                                 OSFIP_bit           _BIT_ACCESS(IPR0,2)
// CRCOUTL<OUT0>
extern volatile __bit                   OUT0                __at(0x1A90);	// @ (0x352 * 8 + 0)
#define                                 OUT0_bit            _BIT_ACCESS(CRCOUTL,0)
// CRCOUTL<OUT1>
extern volatile __bit                   OUT1                __at(0x1A91);	// @ (0x352 * 8 + 1)
#define                                 OUT1_bit            _BIT_ACCESS(CRCOUTL,1)
// CRCOUTH<OUT10>
extern volatile __bit                   OUT10               __at(0x1A9A);	// @ (0x353 * 8 + 2)
#define                                 OUT10_bit           _BIT_ACCESS(CRCOUTH,2)
// CRCOUTH<OUT11>
extern volatile __bit                   OUT11               __at(0x1A9B);	// @ (0x353 * 8 + 3)
#define                                 OUT11_bit           _BIT_ACCESS(CRCOUTH,3)
// CRCOUTH<OUT12>
extern volatile __bit                   OUT12               __at(0x1A9C);	// @ (0x353 * 8 + 4)
#define                                 OUT12_bit           _BIT_ACCESS(CRCOUTH,4)
// CRCOUTH<OUT13>
extern volatile __bit                   OUT13               __at(0x1A9D);	// @ (0x353 * 8 + 5)
#define                                 OUT13_bit           _BIT_ACCESS(CRCOUTH,5)
// CRCOUTH<OUT14>
extern volatile __bit                   OUT14               __at(0x1A9E);	// @ (0x353 * 8 + 6)
#define                                 OUT14_bit           _BIT_ACCESS(CRCOUTH,6)
// CRCOUTH<OUT15>
extern volatile __bit                   OUT15               __at(0x1A9F);	// @ (0x353 * 8 + 7)
#define                                 OUT15_bit           _BIT_ACCESS(CRCOUTH,7)
// CRCOUTU<OUT16>
extern volatile __bit                   OUT16               __at(0x1AA0);	// @ (0x354 * 8 + 0)
#define                                 OUT16_bit           _BIT_ACCESS(CRCOUTU,0)
// CRCOUTU<OUT17>
extern volatile __bit                   OUT17               __at(0x1AA1);	// @ (0x354 * 8 + 1)
#define                                 OUT17_bit           _BIT_ACCESS(CRCOUTU,1)
// CRCOUTU<OUT18>
extern volatile __bit                   OUT18               __at(0x1AA2);	// @ (0x354 * 8 + 2)
#define                                 OUT18_bit           _BIT_ACCESS(CRCOUTU,2)
// CRCOUTU<OUT19>
extern volatile __bit                   OUT19               __at(0x1AA3);	// @ (0x354 * 8 + 3)
#define                                 OUT19_bit           _BIT_ACCESS(CRCOUTU,3)
// CRCOUTL<OUT2>
extern volatile __bit                   OUT2                __at(0x1A92);	// @ (0x352 * 8 + 2)
#define                                 OUT2_bit            _BIT_ACCESS(CRCOUTL,2)
// CRCOUTU<OUT20>
extern volatile __bit                   OUT20               __at(0x1AA4);	// @ (0x354 * 8 + 4)
#define                                 OUT20_bit           _BIT_ACCESS(CRCOUTU,4)
// CRCOUTU<OUT21>
extern volatile __bit                   OUT21               __at(0x1AA5);	// @ (0x354 * 8 + 5)
#define                                 OUT21_bit           _BIT_ACCESS(CRCOUTU,5)
// CRCOUTU<OUT22>
extern volatile __bit                   OUT22               __at(0x1AA6);	// @ (0x354 * 8 + 6)
#define                                 OUT22_bit           _BIT_ACCESS(CRCOUTU,6)
// CRCOUTU<OUT23>
extern volatile __bit                   OUT23               __at(0x1AA7);	// @ (0x354 * 8 + 7)
#define                                 OUT23_bit           _BIT_ACCESS(CRCOUTU,7)
// CRCOUTT<OUT24>
extern volatile __bit                   OUT24               __at(0x1AA8);	// @ (0x355 * 8 + 0)
#define                                 OUT24_bit           _BIT_ACCESS(CRCOUTT,0)
// CRCOUTT<OUT25>
extern volatile __bit                   OUT25               __at(0x1AA9);	// @ (0x355 * 8 + 1)
#define                                 OUT25_bit           _BIT_ACCESS(CRCOUTT,1)
// CRCOUTT<OUT26>
extern volatile __bit                   OUT26               __at(0x1AAA);	// @ (0x355 * 8 + 2)
#define                                 OUT26_bit           _BIT_ACCESS(CRCOUTT,2)
// CRCOUTT<OUT27>
extern volatile __bit                   OUT27               __at(0x1AAB);	// @ (0x355 * 8 + 3)
#define                                 OUT27_bit           _BIT_ACCESS(CRCOUTT,3)
// CRCOUTT<OUT28>
extern volatile __bit                   OUT28               __at(0x1AAC);	// @ (0x355 * 8 + 4)
#define                                 OUT28_bit           _BIT_ACCESS(CRCOUTT,4)
// CRCOUTT<OUT29>
extern volatile __bit                   OUT29               __at(0x1AAD);	// @ (0x355 * 8 + 5)
#define                                 OUT29_bit           _BIT_ACCESS(CRCOUTT,5)
// CRCOUTL<OUT3>
extern volatile __bit                   OUT3                __at(0x1A93);	// @ (0x352 * 8 + 3)
#define                                 OUT3_bit            _BIT_ACCESS(CRCOUTL,3)
// CRCOUTT<OUT30>
extern volatile __bit                   OUT30               __at(0x1AAE);	// @ (0x355 * 8 + 6)
#define                                 OUT30_bit           _BIT_ACCESS(CRCOUTT,6)
// CRCOUTT<OUT31>
extern volatile __bit                   OUT31               __at(0x1AAF);	// @ (0x355 * 8 + 7)
#define                                 OUT31_bit           _BIT_ACCESS(CRCOUTT,7)
// CRCOUTL<OUT4>
extern volatile __bit                   OUT4                __at(0x1A94);	// @ (0x352 * 8 + 4)
#define                                 OUT4_bit            _BIT_ACCESS(CRCOUTL,4)
// CRCOUTL<OUT5>
extern volatile __bit                   OUT5                __at(0x1A95);	// @ (0x352 * 8 + 5)
#define                                 OUT5_bit            _BIT_ACCESS(CRCOUTL,5)
// CRCOUTL<OUT6>
extern volatile __bit                   OUT6                __at(0x1A96);	// @ (0x352 * 8 + 6)
#define                                 OUT6_bit            _BIT_ACCESS(CRCOUTL,6)
// CRCOUTL<OUT7>
extern volatile __bit                   OUT7                __at(0x1A97);	// @ (0x352 * 8 + 7)
#define                                 OUT7_bit            _BIT_ACCESS(CRCOUTL,7)
// CRCOUTH<OUT8>
extern volatile __bit                   OUT8                __at(0x1A98);	// @ (0x353 * 8 + 0)
#define                                 OUT8_bit            _BIT_ACCESS(CRCOUTH,0)
// CRCOUTH<OUT9>
extern volatile __bit                   OUT9                __at(0x1A99);	// @ (0x353 * 8 + 1)
#define                                 OUT9_bit            _BIT_ACCESS(CRCOUTH,1)
// CWG1STR<OVRA>
extern volatile __bit                   OVRA                __at(0x1E24);	// @ (0x3C4 * 8 + 4)
#define                                 OVRA_bit            _BIT_ACCESS(CWG1STR,4)
// CWG1STR<OVRB>
extern volatile __bit                   OVRB                __at(0x1E25);	// @ (0x3C4 * 8 + 5)
#define                                 OVRB_bit            _BIT_ACCESS(CWG1STR,5)
// CWG1STR<OVRC>
extern volatile __bit                   OVRC                __at(0x1E26);	// @ (0x3C4 * 8 + 6)
#define                                 OVRC_bit            _BIT_ACCESS(CWG1STR,6)
// CWG1STR<OVRD>
extern volatile __bit                   OVRD                __at(0x1E27);	// @ (0x3C4 * 8 + 7)
#define                                 OVRD_bit            _BIT_ACCESS(CWG1STR,7)
// U1P1H<P1H>
extern volatile __bit                   P1H                 __at(0x15D8);	// @ (0x2BB * 8 + 0)
#define                                 P1H_bit             _BIT_ACCESS(U1P1H,0)
// U1P2H<P2H>
extern volatile __bit                   P2H                 __at(0x15E8);	// @ (0x2BD * 8 + 0)
#define                                 P2H_bit             _BIT_ACCESS(U1P2H,0)
// U1P3H<P3H>
extern volatile __bit                   P3H                 __at(0x15F8);	// @ (0x2BF * 8 + 0)
#define                                 P3H_bit             _BIT_ACCESS(U1P3H,0)
// I2C1PIE<PC1IE>
extern volatile __bit                   PC1IE               __at(0x14D2);	// @ (0x29A * 8 + 2)
#define                                 PC1IE_bit           _BIT_ACCESS(I2C1PIE,2)
// I2C1PIR<PC1IF>
extern volatile __bit                   PC1IF               __at(0x14CA);	// @ (0x299 * 8 + 2)
#define                                 PC1IF_bit           _BIT_ACCESS(I2C1PIR,2)
// I2C2PIE<PC2IE>
extern volatile __bit                   PC2IE               __at(0x158A);	// @ (0x2B1 * 8 + 2)
#define                                 PC2IE_bit           _BIT_ACCESS(I2C2PIE,2)
// I2C2PIR<PC2IF>
extern volatile __bit                   PC2IF               __at(0x1582);	// @ (0x2B0 * 8 + 2)
#define                                 PC2IF_bit           _BIT_ACCESS(I2C2PIR,2)
// ADCON1<PCSC>
extern volatile __bit                   PCSC                __at(0x1FA1);	// @ (0x3F4 * 8 + 1)
#define                                 PCSC_bit            _BIT_ACCESS(ADCON1,1)
// NCO1CON<PFM>
extern volatile __bit                   PFM                 __at(0x2230);	// @ (0x446 * 8 + 0)
#define                                 PFM_bit             _BIT_ACCESS(NCO1CON,0)
// CRCCON1<PLEN0>
extern volatile __bit                   PLEN0               __at(0x1AB8);	// @ (0x357 * 8 + 0)
#define                                 PLEN0_bit           _BIT_ACCESS(CRCCON1,0)
// CRCCON1<PLEN1>
extern volatile __bit                   PLEN1               __at(0x1AB9);	// @ (0x357 * 8 + 1)
#define                                 PLEN1_bit           _BIT_ACCESS(CRCCON1,1)
// CRCCON1<PLEN2>
extern volatile __bit                   PLEN2               __at(0x1ABA);	// @ (0x357 * 8 + 2)
#define                                 PLEN2_bit           _BIT_ACCESS(CRCCON1,2)
// CRCCON1<PLEN3>
extern volatile __bit                   PLEN3               __at(0x1ABB);	// @ (0x357 * 8 + 3)
#define                                 PLEN3_bit           _BIT_ACCESS(CRCCON1,3)
// CRCCON1<PLEN4>
extern volatile __bit                   PLEN4               __at(0x1ABC);	// @ (0x357 * 8 + 4)
#define                                 PLEN4_bit           _BIT_ACCESS(CRCCON1,4)
// OSCEN<PLLEN>
extern volatile __bit                   PLLEN               __at(0x598);	// @ (0xB3 * 8 + 0)
#define                                 PLLEN_bit           _BIT_ACCESS(OSCEN,0)
// OSCSTAT<PLLR>
extern volatile __bit                   PLLR                __at(0x590);	// @ (0xB2 * 8 + 0)
#define                                 PLLR_bit            _BIT_ACCESS(OSCSTAT,0)
// VREGCON<PMSYS0>
extern volatile __bit                   PMSYS0              __at(0x244);	// @ (0x48 * 8 + 4)
#define                                 PMSYS0_bit          _BIT_ACCESS(VREGCON,4)
// VREGCON<PMSYS1>
extern volatile __bit                   PMSYS1              __at(0x245);	// @ (0x48 * 8 + 5)
#define                                 PMSYS1_bit          _BIT_ACCESS(VREGCON,5)
// CWG1CON1<POLA>
extern volatile __bit                   POLA                __at(0x1E08);	// @ (0x3C1 * 8 + 0)
#define                                 POLA_bit            _BIT_ACCESS(CWG1CON1,0)
// CWG1CON1<POLB>
extern volatile __bit                   POLB                __at(0x1E09);	// @ (0x3C1 * 8 + 1)
#define                                 POLB_bit            _BIT_ACCESS(CWG1CON1,1)
// CWG1CON1<POLC>
extern volatile __bit                   POLC                __at(0x1E0A);	// @ (0x3C1 * 8 + 2)
#define                                 POLC_bit            _BIT_ACCESS(CWG1CON1,2)
// CWG1CON1<POLD>
extern volatile __bit                   POLD                __at(0x1E0B);	// @ (0x3C1 * 8 + 3)
#define                                 POLD_bit            _BIT_ACCESS(CWG1CON1,3)
// PCON0<POR>
extern volatile __bit                   POR                 __at(0x2781);	// @ (0x4F0 * 8 + 1)
#define                                 POR_bit             _BIT_ACCESS(PCON0,1)
// PORTWCLKPPS<PORTWCLKPPS0>
extern volatile __bit                   PORTWCLKPPS0        __at(0x13F8);	// @ (0x27F * 8 + 0)
#define                                 PORTWCLKPPS0_bit    _BIT_ACCESS(PORTWCLKPPS,0)
// PORTWCLKPPS<PORTWCLKPPS1>
extern volatile __bit                   PORTWCLKPPS1        __at(0x13F9);	// @ (0x27F * 8 + 1)
#define                                 PORTWCLKPPS1_bit    _BIT_ACCESS(PORTWCLKPPS,1)
// PORTWCLKPPS<PORTWCLKPPS2>
extern volatile __bit                   PORTWCLKPPS2        __at(0x13FA);	// @ (0x27F * 8 + 2)
#define                                 PORTWCLKPPS2_bit    _BIT_ACCESS(PORTWCLKPPS,2)
// PORTWCLKPPS<PORTWCLKPPS3>
extern volatile __bit                   PORTWCLKPPS3        __at(0x13FB);	// @ (0x27F * 8 + 3)
#define                                 PORTWCLKPPS3_bit    _BIT_ACCESS(PORTWCLKPPS,3)
// PORTWCLKPPS<PORTWCLKPPS4>
extern volatile __bit                   PORTWCLKPPS4        __at(0x13FC);	// @ (0x27F * 8 + 4)
#define                                 PORTWCLKPPS4_bit    _BIT_ACCESS(PORTWCLKPPS,4)
// PORTWCLKPPS<PORTWCLKPPS5>
extern volatile __bit                   PORTWCLKPPS5        __at(0x13FD);	// @ (0x27F * 8 + 5)
#define                                 PORTWCLKPPS5_bit    _BIT_ACCESS(PORTWCLKPPS,5)
// PORTWIN0PPS<PORTWIN0PPS0>
extern volatile __bit                   PORTWIN0PPS0        __at(0x13E8);	// @ (0x27D * 8 + 0)
#define                                 PORTWIN0PPS0_bit    _BIT_ACCESS(PORTWIN0PPS,0)
// PORTWIN0PPS<PORTWIN0PPS1>
extern volatile __bit                   PORTWIN0PPS1        __at(0x13E9);	// @ (0x27D * 8 + 1)
#define                                 PORTWIN0PPS1_bit    _BIT_ACCESS(PORTWIN0PPS,1)
// PORTWIN0PPS<PORTWIN0PPS2>
extern volatile __bit                   PORTWIN0PPS2        __at(0x13EA);	// @ (0x27D * 8 + 2)
#define                                 PORTWIN0PPS2_bit    _BIT_ACCESS(PORTWIN0PPS,2)
// PORTWIN0PPS<PORTWIN0PPS3>
extern volatile __bit                   PORTWIN0PPS3        __at(0x13EB);	// @ (0x27D * 8 + 3)
#define                                 PORTWIN0PPS3_bit    _BIT_ACCESS(PORTWIN0PPS,3)
// PORTWIN0PPS<PORTWIN0PPS4>
extern volatile __bit                   PORTWIN0PPS4        __at(0x13EC);	// @ (0x27D * 8 + 4)
#define                                 PORTWIN0PPS4_bit    _BIT_ACCESS(PORTWIN0PPS,4)
// PORTWIN0PPS<PORTWIN0PPS5>
extern volatile __bit                   PORTWIN0PPS5        __at(0x13ED);	// @ (0x27D * 8 + 5)
#define                                 PORTWIN0PPS5_bit    _BIT_ACCESS(PORTWIN0PPS,5)
// PORTWIN1PPS<PORTWIN1PPS0>
extern volatile __bit                   PORTWIN1PPS0        __at(0x13F0);	// @ (0x27E * 8 + 0)
#define                                 PORTWIN1PPS0_bit    _BIT_ACCESS(PORTWIN1PPS,0)
// PORTWIN1PPS<PORTWIN1PPS1>
extern volatile __bit                   PORTWIN1PPS1        __at(0x13F1);	// @ (0x27E * 8 + 1)
#define                                 PORTWIN1PPS1_bit    _BIT_ACCESS(PORTWIN1PPS,1)
// PORTWIN1PPS<PORTWIN1PPS2>
extern volatile __bit                   PORTWIN1PPS2        __at(0x13F2);	// @ (0x27E * 8 + 2)
#define                                 PORTWIN1PPS2_bit    _BIT_ACCESS(PORTWIN1PPS,2)
// PORTWIN1PPS<PORTWIN1PPS3>
extern volatile __bit                   PORTWIN1PPS3        __at(0x13F3);	// @ (0x27E * 8 + 3)
#define                                 PORTWIN1PPS3_bit    _BIT_ACCESS(PORTWIN1PPS,3)
// PORTWIN1PPS<PORTWIN1PPS4>
extern volatile __bit                   PORTWIN1PPS4        __at(0x13F4);	// @ (0x27E * 8 + 4)
#define                                 PORTWIN1PPS4_bit    _BIT_ACCESS(PORTWIN1PPS,4)
// PORTWIN1PPS<PORTWIN1PPS5>
extern volatile __bit                   PORTWIN1PPS5        __at(0x13F5);	// @ (0x27E * 8 + 5)
#define                                 PORTWIN1PPS5_bit    _BIT_ACCESS(PORTWIN1PPS,5)
// PMD6<PORTWMD>
extern volatile __bit                   PORTWMD             __at(0x340);	// @ (0x68 * 8 + 0)
#define                                 PORTWMD_bit         _BIT_ACCESS(PMD6,0)
// ADCON1<PPOL>
extern volatile __bit                   PPOL                __at(0x1FA7);	// @ (0x3F4 * 8 + 7)
#define                                 PPOL_bit            _BIT_ACCESS(ADCON1,7)
// PPSLOCK<PPSLOCKED>
extern volatile __bit                   PPSLOCKED           __at(0x1000);	// @ (0x200 * 8 + 0)
#define                                 PPSLOCKED_bit       _BIT_ACCESS(PPSLOCK,0)
// ADPREL<PRE0>
extern volatile __bit                   PRE0                __at(0x1F88);	// @ (0x3F1 * 8 + 0)
#define                                 PRE0_bit            _BIT_ACCESS(ADPREL,0)
// ADPREL<PRE1>
extern volatile __bit                   PRE1                __at(0x1F89);	// @ (0x3F1 * 8 + 1)
#define                                 PRE1_bit            _BIT_ACCESS(ADPREL,1)
// ADPREH<PRE10>
extern volatile __bit                   PRE10               __at(0x1F92);	// @ (0x3F2 * 8 + 2)
#define                                 PRE10_bit           _BIT_ACCESS(ADPREH,2)
// ADPREH<PRE11>
extern volatile __bit                   PRE11               __at(0x1F93);	// @ (0x3F2 * 8 + 3)
#define                                 PRE11_bit           _BIT_ACCESS(ADPREH,3)
// ADPREH<PRE12>
extern volatile __bit                   PRE12               __at(0x1F94);	// @ (0x3F2 * 8 + 4)
#define                                 PRE12_bit           _BIT_ACCESS(ADPREH,4)
// ADPREL<PRE2>
extern volatile __bit                   PRE2                __at(0x1F8A);	// @ (0x3F1 * 8 + 2)
#define                                 PRE2_bit            _BIT_ACCESS(ADPREL,2)
// ADPREL<PRE3>
extern volatile __bit                   PRE3                __at(0x1F8B);	// @ (0x3F1 * 8 + 3)
#define                                 PRE3_bit            _BIT_ACCESS(ADPREL,3)
// ADPREL<PRE4>
extern volatile __bit                   PRE4                __at(0x1F8C);	// @ (0x3F1 * 8 + 4)
#define                                 PRE4_bit            _BIT_ACCESS(ADPREL,4)
// ADPREL<PRE5>
extern volatile __bit                   PRE5                __at(0x1F8D);	// @ (0x3F1 * 8 + 5)
#define                                 PRE5_bit            _BIT_ACCESS(ADPREL,5)
// ADPREL<PRE6>
extern volatile __bit                   PRE6                __at(0x1F8E);	// @ (0x3F1 * 8 + 6)
#define                                 PRE6_bit            _BIT_ACCESS(ADPREL,6)
// ADPREL<PRE7>
extern volatile __bit                   PRE7                __at(0x1F8F);	// @ (0x3F1 * 8 + 7)
#define                                 PRE7_bit            _BIT_ACCESS(ADPREL,7)
// ADPREH<PRE8>
extern volatile __bit                   PRE8                __at(0x1F90);	// @ (0x3F2 * 8 + 0)
#define                                 PRE8_bit            _BIT_ACCESS(ADPREH,0)
// ADPREH<PRE9>
extern volatile __bit                   PRE9                __at(0x1F91);	// @ (0x3F2 * 8 + 1)
#define                                 PRE9_bit            _BIT_ACCESS(ADPREH,1)
// ADREF<PREF0>
extern volatile __bit                   PREF0               __at(0x1FC0);	// @ (0x3F8 * 8 + 0)
#define                                 PREF0_bit           _BIT_ACCESS(ADREF,0)
// ADREF<PREF1>
extern volatile __bit                   PREF1               __at(0x1FC1);	// @ (0x3F8 * 8 + 1)
#define                                 PREF1_bit           _BIT_ACCESS(ADREF,1)
// ADPREVL<PREV0>
extern volatile __bit                   PREV0               __at(0x1F40);	// @ (0x3E8 * 8 + 0)
#define                                 PREV0_bit           _BIT_ACCESS(ADPREVL,0)
// ADPREVL<PREV1>
extern volatile __bit                   PREV1               __at(0x1F41);	// @ (0x3E8 * 8 + 1)
#define                                 PREV1_bit           _BIT_ACCESS(ADPREVL,1)
// ADPREVH<PREV10>
extern volatile __bit                   PREV10              __at(0x1F4A);	// @ (0x3E9 * 8 + 2)
#define                                 PREV10_bit          _BIT_ACCESS(ADPREVH,2)
// ADPREVH<PREV11>
extern volatile __bit                   PREV11              __at(0x1F4B);	// @ (0x3E9 * 8 + 3)
#define                                 PREV11_bit          _BIT_ACCESS(ADPREVH,3)
// ADPREVH<PREV12>
extern volatile __bit                   PREV12              __at(0x1F4C);	// @ (0x3E9 * 8 + 4)
#define                                 PREV12_bit          _BIT_ACCESS(ADPREVH,4)
// ADPREVH<PREV13>
extern volatile __bit                   PREV13              __at(0x1F4D);	// @ (0x3E9 * 8 + 5)
#define                                 PREV13_bit          _BIT_ACCESS(ADPREVH,5)
// ADPREVH<PREV14>
extern volatile __bit                   PREV14              __at(0x1F4E);	// @ (0x3E9 * 8 + 6)
#define                                 PREV14_bit          _BIT_ACCESS(ADPREVH,6)
// ADPREVH<PREV15>
extern volatile __bit                   PREV15              __at(0x1F4F);	// @ (0x3E9 * 8 + 7)
#define                                 PREV15_bit          _BIT_ACCESS(ADPREVH,7)
// ADPREVL<PREV2>
