garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f26q24.h
extern volatile __bit                   PREV2               __at(0x1F42);	// @ (0x3E8 * 8 + 2)
#define                                 PREV2_bit           _BIT_ACCESS(ADPREVL,2)
// ADPREVL<PREV3>
extern volatile __bit                   PREV3               __at(0x1F43);	// @ (0x3E8 * 8 + 3)
#define                                 PREV3_bit           _BIT_ACCESS(ADPREVL,3)
// ADPREVL<PREV4>
extern volatile __bit                   PREV4               __at(0x1F44);	// @ (0x3E8 * 8 + 4)
#define                                 PREV4_bit           _BIT_ACCESS(ADPREVL,4)
// ADPREVL<PREV5>
extern volatile __bit                   PREV5               __at(0x1F45);	// @ (0x3E8 * 8 + 5)
#define                                 PREV5_bit           _BIT_ACCESS(ADPREVL,5)
// ADPREVL<PREV6>
extern volatile __bit                   PREV6               __at(0x1F46);	// @ (0x3E8 * 8 + 6)
#define                                 PREV6_bit           _BIT_ACCESS(ADPREVL,6)
// ADPREVL<PREV7>
extern volatile __bit                   PREV7               __at(0x1F47);	// @ (0x3E8 * 8 + 7)
#define                                 PREV7_bit           _BIT_ACCESS(ADPREVL,7)
// ADPREVH<PREV8>
extern volatile __bit                   PREV8               __at(0x1F48);	// @ (0x3E9 * 8 + 0)
#define                                 PREV8_bit           _BIT_ACCESS(ADPREVH,0)
// ADPREVH<PREV9>
extern volatile __bit                   PREV9               __at(0x1F49);	// @ (0x3E9 * 8 + 1)
#define                                 PREV9_bit           _BIT_ACCESS(ADPREVH,1)
// PRLOCK<PRLOCKED>
extern volatile __bit                   PRLOCKED            __at(0x5A0);	// @ (0xB4 * 8 + 0)
#define                                 PRLOCKED_bit        _BIT_ACCESS(PRLOCK,0)
// WDTPSL<PSCNT0>
extern volatile __bit                   PSCNT0              __at(0x3D0);	// @ (0x7A * 8 + 0)
#define                                 PSCNT0_bit          _BIT_ACCESS(WDTPSL,0)
// WDTPSL<PSCNT1>
extern volatile __bit                   PSCNT1              __at(0x3D1);	// @ (0x7A * 8 + 1)
#define                                 PSCNT1_bit          _BIT_ACCESS(WDTPSL,1)
// WDTPSH<PSCNT10>
extern volatile __bit                   PSCNT10             __at(0x3DA);	// @ (0x7B * 8 + 2)
#define                                 PSCNT10_bit         _BIT_ACCESS(WDTPSH,2)
// WDTPSH<PSCNT11>
extern volatile __bit                   PSCNT11             __at(0x3DB);	// @ (0x7B * 8 + 3)
#define                                 PSCNT11_bit         _BIT_ACCESS(WDTPSH,3)
// WDTPSH<PSCNT12>
extern volatile __bit                   PSCNT12             __at(0x3DC);	// @ (0x7B * 8 + 4)
#define                                 PSCNT12_bit         _BIT_ACCESS(WDTPSH,4)
// WDTPSH<PSCNT13>
extern volatile __bit                   PSCNT13             __at(0x3DD);	// @ (0x7B * 8 + 5)
#define                                 PSCNT13_bit         _BIT_ACCESS(WDTPSH,5)
// WDTPSH<PSCNT14>
extern volatile __bit                   PSCNT14             __at(0x3DE);	// @ (0x7B * 8 + 6)
#define                                 PSCNT14_bit         _BIT_ACCESS(WDTPSH,6)
// WDTPSH<PSCNT15>
extern volatile __bit                   PSCNT15             __at(0x3DF);	// @ (0x7B * 8 + 7)
#define                                 PSCNT15_bit         _BIT_ACCESS(WDTPSH,7)
// WDTTMR<PSCNT16>
extern volatile __bit                   PSCNT16             __at(0x3E0);	// @ (0x7C * 8 + 0)
#define                                 PSCNT16_bit         _BIT_ACCESS(WDTTMR,0)
// WDTTMR<PSCNT17>
extern volatile __bit                   PSCNT17             __at(0x3E1);	// @ (0x7C * 8 + 1)
#define                                 PSCNT17_bit         _BIT_ACCESS(WDTTMR,1)
// WDTPSL<PSCNT2>
extern volatile __bit                   PSCNT2              __at(0x3D2);	// @ (0x7A * 8 + 2)
#define                                 PSCNT2_bit          _BIT_ACCESS(WDTPSL,2)
// WDTPSL<PSCNT3>
extern volatile __bit                   PSCNT3              __at(0x3D3);	// @ (0x7A * 8 + 3)
#define                                 PSCNT3_bit          _BIT_ACCESS(WDTPSL,3)
// WDTPSL<PSCNT4>
extern volatile __bit                   PSCNT4              __at(0x3D4);	// @ (0x7A * 8 + 4)
#define                                 PSCNT4_bit          _BIT_ACCESS(WDTPSL,4)
// WDTPSL<PSCNT5>
extern volatile __bit                   PSCNT5              __at(0x3D5);	// @ (0x7A * 8 + 5)
#define                                 PSCNT5_bit          _BIT_ACCESS(WDTPSL,5)
// WDTPSL<PSCNT6>
extern volatile __bit                   PSCNT6              __at(0x3D6);	// @ (0x7A * 8 + 6)
#define                                 PSCNT6_bit          _BIT_ACCESS(WDTPSL,6)
// WDTPSL<PSCNT7>
extern volatile __bit                   PSCNT7              __at(0x3D7);	// @ (0x7A * 8 + 7)
#define                                 PSCNT7_bit          _BIT_ACCESS(WDTPSL,7)
// WDTPSH<PSCNT8>
extern volatile __bit                   PSCNT8              __at(0x3D8);	// @ (0x7B * 8 + 0)
#define                                 PSCNT8_bit          _BIT_ACCESS(WDTPSH,0)
// WDTPSH<PSCNT9>
extern volatile __bit                   PSCNT9              __at(0x3D9);	// @ (0x7B * 8 + 1)
#define                                 PSCNT9_bit          _BIT_ACCESS(WDTPSH,1)
// ADCON2<PSIS>
extern volatile __bit                   PSIS                __at(0x1FAF);	// @ (0x3F5 * 8 + 7)
#define                                 PSIS_bit            _BIT_ACCESS(ADCON2,7)
// DAC1CON<PSS0>
extern volatile __bit                   PSS0                __at(0x3FA);	// @ (0x7F * 8 + 2)
#define                                 PSS0_bit            _BIT_ACCESS(DAC1CON,2)
// DAC1CON<PSS1>
extern volatile __bit                   PSS1                __at(0x3FB);	// @ (0x7F * 8 + 3)
#define                                 PSS1_bit            _BIT_ACCESS(DAC1CON,3)
// PORTWDF<PWDF0>
extern volatile __bit                   PWDF0               __at(0x858);	// @ (0x10B * 8 + 0)
#define                                 PWDF0_bit           _BIT_ACCESS(PORTWDF,0)
// PORTWDF<PWDF1>
extern volatile __bit                   PWDF1               __at(0x859);	// @ (0x10B * 8 + 1)
#define                                 PWDF1_bit           _BIT_ACCESS(PORTWDF,1)
// PORTWDF<PWDF2>
extern volatile __bit                   PWDF2               __at(0x85A);	// @ (0x10B * 8 + 2)
#define                                 PWDF2_bit           _BIT_ACCESS(PORTWDF,2)
// PORTWDF<PWDF3>
extern volatile __bit                   PWDF3               __at(0x85B);	// @ (0x10B * 8 + 3)
#define                                 PWDF3_bit           _BIT_ACCESS(PORTWDF,3)
// PORTWDF<PWDF4>
extern volatile __bit                   PWDF4               __at(0x85C);	// @ (0x10B * 8 + 4)
#define                                 PWDF4_bit           _BIT_ACCESS(PORTWDF,4)
// PORTWDF<PWDF5>
extern volatile __bit                   PWDF5               __at(0x85D);	// @ (0x10B * 8 + 5)
#define                                 PWDF5_bit           _BIT_ACCESS(PORTWDF,5)
// PORTWDF<PWDF6>
extern volatile __bit                   PWDF6               __at(0x85E);	// @ (0x10B * 8 + 6)
#define                                 PWDF6_bit           _BIT_ACCESS(PORTWDF,6)
// PORTWDF<PWDF7>
extern volatile __bit                   PWDF7               __at(0x85F);	// @ (0x10B * 8 + 7)
#define                                 PWDF7_bit           _BIT_ACCESS(PORTWDF,7)
// PWM1ERSPPS<PWM1ERSPPS0>
extern volatile __bit                   PWM1ERSPPS0         __at(0x1288);	// @ (0x251 * 8 + 0)
#define                                 PWM1ERSPPS0_bit     _BIT_ACCESS(PWM1ERSPPS,0)
// PWM1ERSPPS<PWM1ERSPPS1>
extern volatile __bit                   PWM1ERSPPS1         __at(0x1289);	// @ (0x251 * 8 + 1)
#define                                 PWM1ERSPPS1_bit     _BIT_ACCESS(PWM1ERSPPS,1)
// PWM1ERSPPS<PWM1ERSPPS2>
extern volatile __bit                   PWM1ERSPPS2         __at(0x128A);	// @ (0x251 * 8 + 2)
#define                                 PWM1ERSPPS2_bit     _BIT_ACCESS(PWM1ERSPPS,2)
// PWM1ERSPPS<PWM1ERSPPS3>
extern volatile __bit                   PWM1ERSPPS3         __at(0x128B);	// @ (0x251 * 8 + 3)
#define                                 PWM1ERSPPS3_bit     _BIT_ACCESS(PWM1ERSPPS,3)
// PWM1ERSPPS<PWM1ERSPPS4>
extern volatile __bit                   PWM1ERSPPS4         __at(0x128C);	// @ (0x251 * 8 + 4)
#define                                 PWM1ERSPPS4_bit     _BIT_ACCESS(PWM1ERSPPS,4)
// PWM1ERSPPS<PWM1ERSPPS5>
extern volatile __bit                   PWM1ERSPPS5         __at(0x128D);	// @ (0x251 * 8 + 5)
#define                                 PWM1ERSPPS5_bit     _BIT_ACCESS(PWM1ERSPPS,5)
// PIE4<PWM1IE>
extern volatile __bit                   PWM1IE              __at(0x2577);	// @ (0x4AE * 8 + 7)
#define                                 PWM1IE_bit          _BIT_ACCESS(PIE4,7)
// PIR4<PWM1IF>
extern volatile __bit                   PWM1IF              __at(0x25D7);	// @ (0x4BA * 8 + 7)
#define                                 PWM1IF_bit          _BIT_ACCESS(PIR4,7)
// IPR4<PWM1IP>
extern volatile __bit                   PWM1IP              __at(0x2517);	// @ (0x4A2 * 8 + 7)
#define                                 PWM1IP_bit          _BIT_ACCESS(IPR4,7)
// PMD3<PWM1MD>
extern volatile __bit                   PWM1MD              __at(0x328);	// @ (0x65 * 8 + 0)
#define                                 PWM1MD_bit          _BIT_ACCESS(PMD3,0)
// PIE4<PWM1PIE>
extern volatile __bit                   PWM1PIE             __at(0x2576);	// @ (0x4AE * 8 + 6)
#define                                 PWM1PIE_bit         _BIT_ACCESS(PIE4,6)
// PIR4<PWM1PIF>
extern volatile __bit                   PWM1PIF             __at(0x25D6);	// @ (0x4BA * 8 + 6)
#define                                 PWM1PIF_bit         _BIT_ACCESS(PIR4,6)
// IPR4<PWM1PIP>
extern volatile __bit                   PWM1PIP             __at(0x2516);	// @ (0x4A2 * 8 + 6)
#define                                 PWM1PIP_bit         _BIT_ACCESS(IPR4,6)
// PWM2ERSPPS<PWM2ERSPPS0>
extern volatile __bit                   PWM2ERSPPS0         __at(0x1290);	// @ (0x252 * 8 + 0)
#define                                 PWM2ERSPPS0_bit     _BIT_ACCESS(PWM2ERSPPS,0)
// PWM2ERSPPS<PWM2ERSPPS1>
extern volatile __bit                   PWM2ERSPPS1         __at(0x1291);	// @ (0x252 * 8 + 1)
#define                                 PWM2ERSPPS1_bit     _BIT_ACCESS(PWM2ERSPPS,1)
// PWM2ERSPPS<PWM2ERSPPS2>
extern volatile __bit                   PWM2ERSPPS2         __at(0x1292);	// @ (0x252 * 8 + 2)
#define                                 PWM2ERSPPS2_bit     _BIT_ACCESS(PWM2ERSPPS,2)
// PWM2ERSPPS<PWM2ERSPPS3>
extern volatile __bit                   PWM2ERSPPS3         __at(0x1293);	// @ (0x252 * 8 + 3)
#define                                 PWM2ERSPPS3_bit     _BIT_ACCESS(PWM2ERSPPS,3)
// PWM2ERSPPS<PWM2ERSPPS4>
extern volatile __bit                   PWM2ERSPPS4         __at(0x1294);	// @ (0x252 * 8 + 4)
#define                                 PWM2ERSPPS4_bit     _BIT_ACCESS(PWM2ERSPPS,4)
// PWM2ERSPPS<PWM2ERSPPS5>
extern volatile __bit                   PWM2ERSPPS5         __at(0x1295);	// @ (0x252 * 8 + 5)
#define                                 PWM2ERSPPS5_bit     _BIT_ACCESS(PWM2ERSPPS,5)
// PIE5<PWM2IE>
extern volatile __bit                   PWM2IE              __at(0x257F);	// @ (0x4AF * 8 + 7)
#define                                 PWM2IE_bit          _BIT_ACCESS(PIE5,7)
// PIR5<PWM2IF>
extern volatile __bit                   PWM2IF              __at(0x25DF);	// @ (0x4BB * 8 + 7)
#define                                 PWM2IF_bit          _BIT_ACCESS(PIR5,7)
// IPR5<PWM2IP>
extern volatile __bit                   PWM2IP              __at(0x251F);	// @ (0x4A3 * 8 + 7)
#define                                 PWM2IP_bit          _BIT_ACCESS(IPR5,7)
// PMD3<PWM2MD>
extern volatile __bit                   PWM2MD              __at(0x329);	// @ (0x65 * 8 + 1)
#define                                 PWM2MD_bit          _BIT_ACCESS(PMD3,1)
// PIE5<PWM2PIE>
extern volatile __bit                   PWM2PIE             __at(0x257E);	// @ (0x4AF * 8 + 6)
#define                                 PWM2PIE_bit         _BIT_ACCESS(PIE5,6)
// PIR5<PWM2PIF>
extern volatile __bit                   PWM2PIF             __at(0x25DE);	// @ (0x4BB * 8 + 6)
#define                                 PWM2PIF_bit         _BIT_ACCESS(PIR5,6)
// IPR5<PWM2PIP>
extern volatile __bit                   PWM2PIP             __at(0x251E);	// @ (0x4A3 * 8 + 6)
#define                                 PWM2PIP_bit         _BIT_ACCESS(IPR5,6)
// PWM3ERSPPS<PWM3ERSPPS0>
extern volatile __bit                   PWM3ERSPPS0         __at(0x1298);	// @ (0x253 * 8 + 0)
#define                                 PWM3ERSPPS0_bit     _BIT_ACCESS(PWM3ERSPPS,0)
// PWM3ERSPPS<PWM3ERSPPS1>
extern volatile __bit                   PWM3ERSPPS1         __at(0x1299);	// @ (0x253 * 8 + 1)
#define                                 PWM3ERSPPS1_bit     _BIT_ACCESS(PWM3ERSPPS,1)
// PWM3ERSPPS<PWM3ERSPPS2>
extern volatile __bit                   PWM3ERSPPS2         __at(0x129A);	// @ (0x253 * 8 + 2)
#define                                 PWM3ERSPPS2_bit     _BIT_ACCESS(PWM3ERSPPS,2)
// PWM3ERSPPS<PWM3ERSPPS3>
extern volatile __bit                   PWM3ERSPPS3         __at(0x129B);	// @ (0x253 * 8 + 3)
#define                                 PWM3ERSPPS3_bit     _BIT_ACCESS(PWM3ERSPPS,3)
// PWM3ERSPPS<PWM3ERSPPS4>
extern volatile __bit                   PWM3ERSPPS4         __at(0x129C);	// @ (0x253 * 8 + 4)
#define                                 PWM3ERSPPS4_bit     _BIT_ACCESS(PWM3ERSPPS,4)
// PWM3ERSPPS<PWM3ERSPPS5>
extern volatile __bit                   PWM3ERSPPS5         __at(0x129D);	// @ (0x253 * 8 + 5)
#define                                 PWM3ERSPPS5_bit     _BIT_ACCESS(PWM3ERSPPS,5)
// PIE7<PWM3IE>
extern volatile __bit                   PWM3IE              __at(0x258F);	// @ (0x4B1 * 8 + 7)
#define                                 PWM3IE_bit          _BIT_ACCESS(PIE7,7)
// PIR7<PWM3IF>
extern volatile __bit                   PWM3IF              __at(0x25EF);	// @ (0x4BD * 8 + 7)
#define                                 PWM3IF_bit          _BIT_ACCESS(PIR7,7)
// IPR7<PWM3IP>
extern volatile __bit                   PWM3IP              __at(0x252F);	// @ (0x4A5 * 8 + 7)
#define                                 PWM3IP_bit          _BIT_ACCESS(IPR7,7)
// PMD3<PWM3MD>
extern volatile __bit                   PWM3MD              __at(0x32A);	// @ (0x65 * 8 + 2)
#define                                 PWM3MD_bit          _BIT_ACCESS(PMD3,2)
// PIE7<PWM3PIE>
extern volatile __bit                   PWM3PIE             __at(0x258E);	// @ (0x4B1 * 8 + 6)
#define                                 PWM3PIE_bit         _BIT_ACCESS(PIE7,6)
// PIR7<PWM3PIF>
extern volatile __bit                   PWM3PIF             __at(0x25EE);	// @ (0x4BD * 8 + 6)
#define                                 PWM3PIF_bit         _BIT_ACCESS(PIR7,6)
// IPR7<PWM3PIP>
extern volatile __bit                   PWM3PIP             __at(0x252E);	// @ (0x4A5 * 8 + 6)
#define                                 PWM3PIP_bit         _BIT_ACCESS(IPR7,6)
// PWMIN0PPS<PWMIN0PPS0>
extern volatile __bit                   PWMIN0PPS0          __at(0x12B8);	// @ (0x257 * 8 + 0)
#define                                 PWMIN0PPS0_bit      _BIT_ACCESS(PWMIN0PPS,0)
// PWMIN0PPS<PWMIN0PPS1>
extern volatile __bit                   PWMIN0PPS1          __at(0x12B9);	// @ (0x257 * 8 + 1)
#define                                 PWMIN0PPS1_bit      _BIT_ACCESS(PWMIN0PPS,1)
// PWMIN0PPS<PWMIN0PPS2>
extern volatile __bit                   PWMIN0PPS2          __at(0x12BA);	// @ (0x257 * 8 + 2)
#define                                 PWMIN0PPS2_bit      _BIT_ACCESS(PWMIN0PPS,2)
// PWMIN0PPS<PWMIN0PPS3>
extern volatile __bit                   PWMIN0PPS3          __at(0x12BB);	// @ (0x257 * 8 + 3)
#define                                 PWMIN0PPS3_bit      _BIT_ACCESS(PWMIN0PPS,3)
// PWMIN0PPS<PWMIN0PPS4>
extern volatile __bit                   PWMIN0PPS4          __at(0x12BC);	// @ (0x257 * 8 + 4)
#define                                 PWMIN0PPS4_bit      _BIT_ACCESS(PWMIN0PPS,4)
// PWMIN0PPS<PWMIN0PPS5>
extern volatile __bit                   PWMIN0PPS5          __at(0x12BD);	// @ (0x257 * 8 + 5)
#define                                 PWMIN0PPS5_bit      _BIT_ACCESS(PWMIN0PPS,5)
// PWMIN1PPS<PWMIN1PPS0>
extern volatile __bit                   PWMIN1PPS0          __at(0x12C0);	// @ (0x258 * 8 + 0)
#define                                 PWMIN1PPS0_bit      _BIT_ACCESS(PWMIN1PPS,0)
// PWMIN1PPS<PWMIN1PPS1>
extern volatile __bit                   PWMIN1PPS1          __at(0x12C1);	// @ (0x258 * 8 + 1)
#define                                 PWMIN1PPS1_bit      _BIT_ACCESS(PWMIN1PPS,1)
// PWMIN1PPS<PWMIN1PPS2>
extern volatile __bit                   PWMIN1PPS2          __at(0x12C2);	// @ (0x258 * 8 + 2)
#define                                 PWMIN1PPS2_bit      _BIT_ACCESS(PWMIN1PPS,2)
// PWMIN1PPS<PWMIN1PPS3>
extern volatile __bit                   PWMIN1PPS3          __at(0x12C3);	// @ (0x258 * 8 + 3)
#define                                 PWMIN1PPS3_bit      _BIT_ACCESS(PWMIN1PPS,3)
// PWMIN1PPS<PWMIN1PPS4>
extern volatile __bit                   PWMIN1PPS4          __at(0x12C4);	// @ (0x258 * 8 + 4)
#define                                 PWMIN1PPS4_bit      _BIT_ACCESS(PWMIN1PPS,4)
// PWMIN1PPS<PWMIN1PPS5>
extern volatile __bit                   PWMIN1PPS5          __at(0x12C5);	// @ (0x258 * 8 + 5)
#define                                 PWMIN1PPS5_bit      _BIT_ACCESS(PWMIN1PPS,5)
// NCO1CLK<PWS0>
extern volatile __bit                   PWS0                __at(0x223D);	// @ (0x447 * 8 + 5)
#define                                 PWS0_bit            _BIT_ACCESS(NCO1CLK,5)
// NCO1CLK<PWS1>
extern volatile __bit                   PWS1                __at(0x223E);	// @ (0x447 * 8 + 6)
#define                                 PWS1_bit            _BIT_ACCESS(NCO1CLK,6)
// NCO1CLK<PWS2>
extern volatile __bit                   PWS2                __at(0x223F);	// @ (0x447 * 8 + 7)
#define                                 PWS2_bit            _BIT_ACCESS(NCO1CLK,7)
// PORTA<RA0>
extern volatile __bit                   RA0                 __at(0xA80);	// @ (0x150 * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(PORTA,0)
// RA0PPS<RA0PPS0>
extern volatile __bit                   RA0PPS0             __at(0x1008);	// @ (0x201 * 8 + 0)
#define                                 RA0PPS0_bit         _BIT_ACCESS(RA0PPS,0)
// RA0PPS<RA0PPS1>
extern volatile __bit                   RA0PPS1             __at(0x1009);	// @ (0x201 * 8 + 1)
#define                                 RA0PPS1_bit         _BIT_ACCESS(RA0PPS,1)
// RA0PPS<RA0PPS2>
extern volatile __bit                   RA0PPS2             __at(0x100A);	// @ (0x201 * 8 + 2)
#define                                 RA0PPS2_bit         _BIT_ACCESS(RA0PPS,2)
// RA0PPS<RA0PPS3>
extern volatile __bit                   RA0PPS3             __at(0x100B);	// @ (0x201 * 8 + 3)
#define                                 RA0PPS3_bit         _BIT_ACCESS(RA0PPS,3)
// RA0PPS<RA0PPS4>
extern volatile __bit                   RA0PPS4             __at(0x100C);	// @ (0x201 * 8 + 4)
#define                                 RA0PPS4_bit         _BIT_ACCESS(RA0PPS,4)
// RA0PPS<RA0PPS5>
extern volatile __bit                   RA0PPS5             __at(0x100D);	// @ (0x201 * 8 + 5)
#define                                 RA0PPS5_bit         _BIT_ACCESS(RA0PPS,5)
// PORTA<RA1>
extern volatile __bit                   RA1                 __at(0xA81);	// @ (0x150 * 8 + 1)
#define                                 RA1_bit             _BIT_ACCESS(PORTA,1)
// RA1PPS<RA1PPS0>
extern volatile __bit                   RA1PPS0             __at(0x1010);	// @ (0x202 * 8 + 0)
#define                                 RA1PPS0_bit         _BIT_ACCESS(RA1PPS,0)
// RA1PPS<RA1PPS1>
extern volatile __bit                   RA1PPS1             __at(0x1011);	// @ (0x202 * 8 + 1)
#define                                 RA1PPS1_bit         _BIT_ACCESS(RA1PPS,1)
// RA1PPS<RA1PPS2>
extern volatile __bit                   RA1PPS2             __at(0x1012);	// @ (0x202 * 8 + 2)
#define                                 RA1PPS2_bit         _BIT_ACCESS(RA1PPS,2)
// RA1PPS<RA1PPS3>
extern volatile __bit                   RA1PPS3             __at(0x1013);	// @ (0x202 * 8 + 3)
#define                                 RA1PPS3_bit         _BIT_ACCESS(RA1PPS,3)
// RA1PPS<RA1PPS4>
extern volatile __bit                   RA1PPS4             __at(0x1014);	// @ (0x202 * 8 + 4)
#define                                 RA1PPS4_bit         _BIT_ACCESS(RA1PPS,4)
// RA1PPS<RA1PPS5>
extern volatile __bit                   RA1PPS5             __at(0x1015);	// @ (0x202 * 8 + 5)
#define                                 RA1PPS5_bit         _BIT_ACCESS(RA1PPS,5)
// PORTA<RA2>
extern volatile __bit                   RA2                 __at(0xA82);	// @ (0x150 * 8 + 2)
#define                                 RA2_bit             _BIT_ACCESS(PORTA,2)
// RA2PPS<RA2PPS0>
extern volatile __bit                   RA2PPS0             __at(0x1018);	// @ (0x203 * 8 + 0)
#define                                 RA2PPS0_bit         _BIT_ACCESS(RA2PPS,0)
// RA2PPS<RA2PPS1>
extern volatile __bit                   RA2PPS1             __at(0x1019);	// @ (0x203 * 8 + 1)
#define                                 RA2PPS1_bit         _BIT_ACCESS(RA2PPS,1)
// RA2PPS<RA2PPS2>
extern volatile __bit                   RA2PPS2             __at(0x101A);	// @ (0x203 * 8 + 2)
#define                                 RA2PPS2_bit         _BIT_ACCESS(RA2PPS,2)
// RA2PPS<RA2PPS3>
extern volatile __bit                   RA2PPS3             __at(0x101B);	// @ (0x203 * 8 + 3)
#define                                 RA2PPS3_bit         _BIT_ACCESS(RA2PPS,3)
// RA2PPS<RA2PPS4>
extern volatile __bit                   RA2PPS4             __at(0x101C);	// @ (0x203 * 8 + 4)
#define                                 RA2PPS4_bit         _BIT_ACCESS(RA2PPS,4)
// RA2PPS<RA2PPS5>
extern volatile __bit                   RA2PPS5             __at(0x101D);	// @ (0x203 * 8 + 5)
#define                                 RA2PPS5_bit         _BIT_ACCESS(RA2PPS,5)
// PORTA<RA3>
extern volatile __bit                   RA3                 __at(0xA83);	// @ (0x150 * 8 + 3)
#define                                 RA3_bit             _BIT_ACCESS(PORTA,3)
// RA3PPS<RA3PPS0>
extern volatile __bit                   RA3PPS0             __at(0x1020);	// @ (0x204 * 8 + 0)
#define                                 RA3PPS0_bit         _BIT_ACCESS(RA3PPS,0)
// RA3PPS<RA3PPS1>
extern volatile __bit                   RA3PPS1             __at(0x1021);	// @ (0x204 * 8 + 1)
#define                                 RA3PPS1_bit         _BIT_ACCESS(RA3PPS,1)
// RA3PPS<RA3PPS2>
extern volatile __bit                   RA3PPS2             __at(0x1022);	// @ (0x204 * 8 + 2)
#define                                 RA3PPS2_bit         _BIT_ACCESS(RA3PPS,2)
// RA3PPS<RA3PPS3>
extern volatile __bit                   RA3PPS3             __at(0x1023);	// @ (0x204 * 8 + 3)
#define                                 RA3PPS3_bit         _BIT_ACCESS(RA3PPS,3)
// RA3PPS<RA3PPS4>
extern volatile __bit                   RA3PPS4             __at(0x1024);	// @ (0x204 * 8 + 4)
#define                                 RA3PPS4_bit         _BIT_ACCESS(RA3PPS,4)
// RA3PPS<RA3PPS5>
extern volatile __bit                   RA3PPS5             __at(0x1025);	// @ (0x204 * 8 + 5)
#define                                 RA3PPS5_bit         _BIT_ACCESS(RA3PPS,5)
// PORTA<RA4>
extern volatile __bit                   RA4                 __at(0xA84);	// @ (0x150 * 8 + 4)
#define                                 RA4_bit             _BIT_ACCESS(PORTA,4)
// RA4PPS<RA4PPS0>
extern volatile __bit                   RA4PPS0             __at(0x1028);	// @ (0x205 * 8 + 0)
