garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f26q24.h
// TMR3L<TMR3L5>
extern volatile __bit                   TMR3L5              __at(0x191D);	// @ (0x323 * 8 + 5)
#define                                 TMR3L5_bit          _BIT_ACCESS(TMR3L,5)
// TMR3L<TMR3L6>
extern volatile __bit                   TMR3L6              __at(0x191E);	// @ (0x323 * 8 + 6)
#define                                 TMR3L6_bit          _BIT_ACCESS(TMR3L,6)
// TMR3L<TMR3L7>
extern volatile __bit                   TMR3L7              __at(0x191F);	// @ (0x323 * 8 + 7)
#define                                 TMR3L7_bit          _BIT_ACCESS(TMR3L,7)
// PMD1<TMR3MD>
extern volatile __bit                   TMR3MD              __at(0x31B);	// @ (0x63 * 8 + 3)
#define                                 TMR3MD_bit          _BIT_ACCESS(PMD1,3)
// T3CON<TMR3ON>
extern volatile __bit                   TMR3ON              __at(0x1928);	// @ (0x325 * 8 + 0)
#define                                 TMR3ON_bit          _BIT_ACCESS(T3CON,0)
// PIE10<TMR4IE>
extern volatile __bit                   TMR4IE              __at(0x25A3);	// @ (0x4B4 * 8 + 3)
#define                                 TMR4IE_bit          _BIT_ACCESS(PIE10,3)
// PIR10<TMR4IF>
extern volatile __bit                   TMR4IF              __at(0x2603);	// @ (0x4C0 * 8 + 3)
#define                                 TMR4IF_bit          _BIT_ACCESS(PIR10,3)
// IPR10<TMR4IP>
extern volatile __bit                   TMR4IP              __at(0x2543);	// @ (0x4A8 * 8 + 3)
#define                                 TMR4IP_bit          _BIT_ACCESS(IPR10,3)
// PMD1<TMR4MD>
extern volatile __bit                   TMR4MD              __at(0x31C);	// @ (0x63 * 8 + 4)
#define                                 TMR4MD_bit          _BIT_ACCESS(PMD1,4)
// T4CON<TMR4ON>
extern volatile __bit                   TMR4ON              __at(0x1967);	// @ (0x32C * 8 + 7)
#define                                 TMR4ON_bit          _BIT_ACCESS(T4CON,7)
// PIE5<TMR6IE>
extern volatile __bit                   TMR6IE              __at(0x257B);	// @ (0x4AF * 8 + 3)
#define                                 TMR6IE_bit          _BIT_ACCESS(PIE5,3)
// PIR5<TMR6IF>
extern volatile __bit                   TMR6IF              __at(0x25DB);	// @ (0x4BB * 8 + 3)
#define                                 TMR6IF_bit          _BIT_ACCESS(PIR5,3)
// IPR5<TMR6IP>
extern volatile __bit                   TMR6IP              __at(0x251B);	// @ (0x4A3 * 8 + 3)
#define                                 TMR6IP_bit          _BIT_ACCESS(IPR5,3)
// PMD1<TMR6MD>
extern volatile __bit                   TMR6MD              __at(0x31D);	// @ (0x63 * 8 + 5)
#define                                 TMR6MD_bit          _BIT_ACCESS(PMD1,5)
// T6CON<TMR6ON>
extern volatile __bit                   TMR6ON              __at(0x199F);	// @ (0x333 * 8 + 7)
#define                                 TMR6ON_bit          _BIT_ACCESS(T6CON,7)
// TU16ACON1<TMRAOSEN>
extern volatile __bit                   TMRAOSEN            __at(0x1CF6);	// @ (0x39E * 8 + 6)
#define                                 TMRAOSEN_bit        _BIT_ACCESS(TU16ACON1,6)
// TU16BCON1<TMRBOSEN>
extern volatile __bit                   TMRBOSEN            __at(0x1D66);	// @ (0x3AC * 8 + 6)
#define                                 TMRBOSEN_bit        _BIT_ACCESS(TU16BCON1,6)
// SCANCON0<TRIGEN>
extern volatile __bit                   TRIGEN              __at(0x1B06);	// @ (0x360 * 8 + 6)
#define                                 TRIGEN_bit          _BIT_ACCESS(SCANCON0,6)
// TRISA<TRISA0>
extern volatile __bit                   TRISA0              __at(0xA40);	// @ (0x148 * 8 + 0)
#define                                 TRISA0_bit          _BIT_ACCESS(TRISA,0)
// TRISA<TRISA1>
extern volatile __bit                   TRISA1              __at(0xA41);	// @ (0x148 * 8 + 1)
#define                                 TRISA1_bit          _BIT_ACCESS(TRISA,1)
// TRISA<TRISA2>
extern volatile __bit                   TRISA2              __at(0xA42);	// @ (0x148 * 8 + 2)
#define                                 TRISA2_bit          _BIT_ACCESS(TRISA,2)
// TRISA<TRISA3>
extern volatile __bit                   TRISA3              __at(0xA43);	// @ (0x148 * 8 + 3)
#define                                 TRISA3_bit          _BIT_ACCESS(TRISA,3)
// TRISA<TRISA4>
extern volatile __bit                   TRISA4              __at(0xA44);	// @ (0x148 * 8 + 4)
#define                                 TRISA4_bit          _BIT_ACCESS(TRISA,4)
// TRISA<TRISA5>
extern volatile __bit                   TRISA5              __at(0xA45);	// @ (0x148 * 8 + 5)
#define                                 TRISA5_bit          _BIT_ACCESS(TRISA,5)
// TRISA<TRISA6>
extern volatile __bit                   TRISA6              __at(0xA46);	// @ (0x148 * 8 + 6)
#define                                 TRISA6_bit          _BIT_ACCESS(TRISA,6)
// TRISA<TRISA7>
extern volatile __bit                   TRISA7              __at(0xA47);	// @ (0x148 * 8 + 7)
#define                                 TRISA7_bit          _BIT_ACCESS(TRISA,7)
// TRISB<TRISB0>
extern volatile __bit                   TRISB0              __at(0xA48);	// @ (0x149 * 8 + 0)
#define                                 TRISB0_bit          _BIT_ACCESS(TRISB,0)
// TRISB<TRISB1>
extern volatile __bit                   TRISB1              __at(0xA49);	// @ (0x149 * 8 + 1)
#define                                 TRISB1_bit          _BIT_ACCESS(TRISB,1)
// TRISB<TRISB2>
extern volatile __bit                   TRISB2              __at(0xA4A);	// @ (0x149 * 8 + 2)
#define                                 TRISB2_bit          _BIT_ACCESS(TRISB,2)
// TRISB<TRISB3>
extern volatile __bit                   TRISB3              __at(0xA4B);	// @ (0x149 * 8 + 3)
#define                                 TRISB3_bit          _BIT_ACCESS(TRISB,3)
// TRISB<TRISB4>
extern volatile __bit                   TRISB4              __at(0xA4C);	// @ (0x149 * 8 + 4)
#define                                 TRISB4_bit          _BIT_ACCESS(TRISB,4)
// TRISB<TRISB5>
extern volatile __bit                   TRISB5              __at(0xA4D);	// @ (0x149 * 8 + 5)
#define                                 TRISB5_bit          _BIT_ACCESS(TRISB,5)
// TRISB<TRISB6>
extern volatile __bit                   TRISB6              __at(0xA4E);	// @ (0x149 * 8 + 6)
#define                                 TRISB6_bit          _BIT_ACCESS(TRISB,6)
// TRISB<TRISB7>
extern volatile __bit                   TRISB7              __at(0xA4F);	// @ (0x149 * 8 + 7)
#define                                 TRISB7_bit          _BIT_ACCESS(TRISB,7)
// TRISC<TRISC0>
extern volatile __bit                   TRISC0              __at(0xA50);	// @ (0x14A * 8 + 0)
#define                                 TRISC0_bit          _BIT_ACCESS(TRISC,0)
// TRISC<TRISC1>
extern volatile __bit                   TRISC1              __at(0xA51);	// @ (0x14A * 8 + 1)
#define                                 TRISC1_bit          _BIT_ACCESS(TRISC,1)
// TRISC<TRISC2>
extern volatile __bit                   TRISC2              __at(0xA52);	// @ (0x14A * 8 + 2)
#define                                 TRISC2_bit          _BIT_ACCESS(TRISC,2)
// TRISC<TRISC3>
extern volatile __bit                   TRISC3              __at(0xA53);	// @ (0x14A * 8 + 3)
#define                                 TRISC3_bit          _BIT_ACCESS(TRISC,3)
// TRISC<TRISC4>
extern volatile __bit                   TRISC4              __at(0xA54);	// @ (0x14A * 8 + 4)
#define                                 TRISC4_bit          _BIT_ACCESS(TRISC,4)
// TRISC<TRISC5>
extern volatile __bit                   TRISC5              __at(0xA55);	// @ (0x14A * 8 + 5)
#define                                 TRISC5_bit          _BIT_ACCESS(TRISC,5)
// TRISC<TRISC6>
extern volatile __bit                   TRISC6              __at(0xA56);	// @ (0x14A * 8 + 6)
#define                                 TRISC6_bit          _BIT_ACCESS(TRISC,6)
// TRISC<TRISC7>
extern volatile __bit                   TRISC7              __at(0xA57);	// @ (0x14A * 8 + 7)
#define                                 TRISC7_bit          _BIT_ACCESS(TRISC,7)
// SCANTRIG<TSEL0>
extern volatile __bit                   TSEL0               __at(0x1B08);	// @ (0x361 * 8 + 0)
#define                                 TSEL0_bit           _BIT_ACCESS(SCANTRIG,0)
// SCANTRIG<TSEL1>
extern volatile __bit                   TSEL1               __at(0x1B09);	// @ (0x361 * 8 + 1)
#define                                 TSEL1_bit           _BIT_ACCESS(SCANTRIG,1)
// SCANTRIG<TSEL2>
extern volatile __bit                   TSEL2               __at(0x1B0A);	// @ (0x361 * 8 + 2)
#define                                 TSEL2_bit           _BIT_ACCESS(SCANTRIG,2)
// SCANTRIG<TSEL3>
extern volatile __bit                   TSEL3               __at(0x1B0B);	// @ (0x361 * 8 + 3)
#define                                 TSEL3_bit           _BIT_ACCESS(SCANTRIG,3)
// SCANTRIG<TSEL4>
extern volatile __bit                   TSEL4               __at(0x1B0C);	// @ (0x361 * 8 + 4)
#define                                 TSEL4_bit           _BIT_ACCESS(SCANTRIG,4)
// FVRCON<TSEN>
extern volatile __bit                   TSEN                __at(0x1EBD);	// @ (0x3D7 * 8 + 5)
#define                                 TSEN_bit            _BIT_ACCESS(FVRCON,5)
// FVRCON<TSRNG>
extern volatile __bit                   TSRNG               __at(0x1EBC);	// @ (0x3D7 * 8 + 4)
#define                                 TSRNG_bit           _BIT_ACCESS(FVRCON,4)
// TU16ACON1<TU16ACAPT>
extern volatile __bit                   TU16ACAPT           __at(0x1CF3);	// @ (0x39E * 8 + 3)
#define                                 TU16ACAPT_bit       _BIT_ACCESS(TU16ACON1,3)
// TU16ACON0<TU16ACIE>
extern volatile __bit                   TU16ACIE            __at(0x1CE8);	// @ (0x39D * 8 + 0)
#define                                 TU16ACIE_bit        _BIT_ACCESS(TU16ACON0,0)
// TU16ACON1<TU16ACIF>
extern volatile __bit                   TU16ACIF            __at(0x1CF0);	// @ (0x39E * 8 + 0)
#define                                 TU16ACIF_bit        _BIT_ACCESS(TU16ACON1,0)
// TU16ACLK<TU16ACLK0>
extern volatile __bit                   TU16ACLK0           __at(0x1D48);	// @ (0x3A9 * 8 + 0)
#define                                 TU16ACLK0_bit       _BIT_ACCESS(TU16ACLK,0)
// TU16ACLK<TU16ACLK1>
extern volatile __bit                   TU16ACLK1           __at(0x1D49);	// @ (0x3A9 * 8 + 1)
#define                                 TU16ACLK1_bit       _BIT_ACCESS(TU16ACLK,1)
// TU16ACLK<TU16ACLK2>
extern volatile __bit                   TU16ACLK2           __at(0x1D4A);	// @ (0x3A9 * 8 + 2)
#define                                 TU16ACLK2_bit       _BIT_ACCESS(TU16ACLK,2)
// TU16ACLK<TU16ACLK3>
extern volatile __bit                   TU16ACLK3           __at(0x1D4B);	// @ (0x3A9 * 8 + 3)
#define                                 TU16ACLK3_bit       _BIT_ACCESS(TU16ACLK,3)
// TU16ACLK<TU16ACLK4>
extern volatile __bit                   TU16ACLK4           __at(0x1D4C);	// @ (0x3A9 * 8 + 4)
#define                                 TU16ACLK4_bit       _BIT_ACCESS(TU16ACLK,4)
// TU16ACON1<TU16ACLR>
extern volatile __bit                   TU16ACLR            __at(0x1CF5);	// @ (0x39E * 8 + 5)
#define                                 TU16ACLR_bit        _BIT_ACCESS(TU16ACON1,5)
// TU16ACON0<TU16ACPOL>
extern volatile __bit                   TU16ACPOL           __at(0x1CEE);	// @ (0x39D * 8 + 6)
#define                                 TU16ACPOL_bit       _BIT_ACCESS(TU16ACON0,6)
// TU16ACRL<TU16ACR0>
extern volatile __bit                   TU16ACR0            __at(0x1D08);	// @ (0x3A1 * 8 + 0)
#define                                 TU16ACR0_bit        _BIT_ACCESS(TU16ACRL,0)
// TU16ACRL<TU16ACR1>
extern volatile __bit                   TU16ACR1            __at(0x1D09);	// @ (0x3A1 * 8 + 1)
#define                                 TU16ACR1_bit        _BIT_ACCESS(TU16ACRL,1)
// TU16ACRH<TU16ACR10>
extern volatile __bit                   TU16ACR10           __at(0x1D12);	// @ (0x3A2 * 8 + 2)
#define                                 TU16ACR10_bit       _BIT_ACCESS(TU16ACRH,2)
// TU16ACRH<TU16ACR11>
extern volatile __bit                   TU16ACR11           __at(0x1D13);	// @ (0x3A2 * 8 + 3)
#define                                 TU16ACR11_bit       _BIT_ACCESS(TU16ACRH,3)
// TU16ACRH<TU16ACR12>
extern volatile __bit                   TU16ACR12           __at(0x1D14);	// @ (0x3A2 * 8 + 4)
#define                                 TU16ACR12_bit       _BIT_ACCESS(TU16ACRH,4)
// TU16ACRH<TU16ACR13>
extern volatile __bit                   TU16ACR13           __at(0x1D15);	// @ (0x3A2 * 8 + 5)
#define                                 TU16ACR13_bit       _BIT_ACCESS(TU16ACRH,5)
// TU16ACRH<TU16ACR14>
extern volatile __bit                   TU16ACR14           __at(0x1D16);	// @ (0x3A2 * 8 + 6)
#define                                 TU16ACR14_bit       _BIT_ACCESS(TU16ACRH,6)
// TU16ACRH<TU16ACR15>
extern volatile __bit                   TU16ACR15           __at(0x1D17);	// @ (0x3A2 * 8 + 7)
#define                                 TU16ACR15_bit       _BIT_ACCESS(TU16ACRH,7)
// TU16ACRL<TU16ACR2>
extern volatile __bit                   TU16ACR2            __at(0x1D0A);	// @ (0x3A1 * 8 + 2)
#define                                 TU16ACR2_bit        _BIT_ACCESS(TU16ACRL,2)
// TU16ACRT<TU16ACR24>
extern volatile __bit                   TU16ACR24           __at(0x1D20);	// @ (0x3A4 * 8 + 0)
#define                                 TU16ACR24_bit       _BIT_ACCESS(TU16ACRT,0)
// TU16ACRT<TU16ACR25>
extern volatile __bit                   TU16ACR25           __at(0x1D21);	// @ (0x3A4 * 8 + 1)
#define                                 TU16ACR25_bit       _BIT_ACCESS(TU16ACRT,1)
// TU16ACRT<TU16ACR26>
extern volatile __bit                   TU16ACR26           __at(0x1D22);	// @ (0x3A4 * 8 + 2)
#define                                 TU16ACR26_bit       _BIT_ACCESS(TU16ACRT,2)
// TU16ACRT<TU16ACR27>
extern volatile __bit                   TU16ACR27           __at(0x1D23);	// @ (0x3A4 * 8 + 3)
#define                                 TU16ACR27_bit       _BIT_ACCESS(TU16ACRT,3)
// TU16ACRT<TU16ACR28>
extern volatile __bit                   TU16ACR28           __at(0x1D24);	// @ (0x3A4 * 8 + 4)
#define                                 TU16ACR28_bit       _BIT_ACCESS(TU16ACRT,4)
// TU16ACRT<TU16ACR29>
extern volatile __bit                   TU16ACR29           __at(0x1D25);	// @ (0x3A4 * 8 + 5)
#define                                 TU16ACR29_bit       _BIT_ACCESS(TU16ACRT,5)
// TU16ACRL<TU16ACR3>
extern volatile __bit                   TU16ACR3            __at(0x1D0B);	// @ (0x3A1 * 8 + 3)
#define                                 TU16ACR3_bit        _BIT_ACCESS(TU16ACRL,3)
// TU16ACRT<TU16ACR30>
extern volatile __bit                   TU16ACR30           __at(0x1D26);	// @ (0x3A4 * 8 + 6)
#define                                 TU16ACR30_bit       _BIT_ACCESS(TU16ACRT,6)
// TU16ACRT<TU16ACR31>
extern volatile __bit                   TU16ACR31           __at(0x1D27);	// @ (0x3A4 * 8 + 7)
#define                                 TU16ACR31_bit       _BIT_ACCESS(TU16ACRT,7)
// TU16ACRL<TU16ACR4>
extern volatile __bit                   TU16ACR4            __at(0x1D0C);	// @ (0x3A1 * 8 + 4)
#define                                 TU16ACR4_bit        _BIT_ACCESS(TU16ACRL,4)
// TU16ACRL<TU16ACR5>
extern volatile __bit                   TU16ACR5            __at(0x1D0D);	// @ (0x3A1 * 8 + 5)
#define                                 TU16ACR5_bit        _BIT_ACCESS(TU16ACRL,5)
// TU16ACRL<TU16ACR6>
extern volatile __bit                   TU16ACR6            __at(0x1D0E);	// @ (0x3A1 * 8 + 6)
#define                                 TU16ACR6_bit        _BIT_ACCESS(TU16ACRL,6)
// TU16ACRL<TU16ACR7>
extern volatile __bit                   TU16ACR7            __at(0x1D0F);	// @ (0x3A1 * 8 + 7)
#define                                 TU16ACR7_bit        _BIT_ACCESS(TU16ACRL,7)
// TU16ACRH<TU16ACR8>
extern volatile __bit                   TU16ACR8            __at(0x1D10);	// @ (0x3A2 * 8 + 0)
#define                                 TU16ACR8_bit        _BIT_ACCESS(TU16ACRH,0)
// TU16ACRH<TU16ACR9>
extern volatile __bit                   TU16ACR9            __at(0x1D11);	// @ (0x3A2 * 8 + 1)
#define                                 TU16ACR9_bit        _BIT_ACCESS(TU16ACRH,1)
// TU16ACRH<TU16ACRH0>
extern volatile __bit                   TU16ACRH0           __at(0x1D10);	// @ (0x3A2 * 8 + 0)
#define                                 TU16ACRH0_bit       _BIT_ACCESS(TU16ACRH,0)
// TU16ACRH<TU16ACRH1>
extern volatile __bit                   TU16ACRH1           __at(0x1D11);	// @ (0x3A2 * 8 + 1)
#define                                 TU16ACRH1_bit       _BIT_ACCESS(TU16ACRH,1)
// TU16ACRH<TU16ACRH2>
extern volatile __bit                   TU16ACRH2           __at(0x1D12);	// @ (0x3A2 * 8 + 2)
#define                                 TU16ACRH2_bit       _BIT_ACCESS(TU16ACRH,2)
// TU16ACRH<TU16ACRH3>
extern volatile __bit                   TU16ACRH3           __at(0x1D13);	// @ (0x3A2 * 8 + 3)
#define                                 TU16ACRH3_bit       _BIT_ACCESS(TU16ACRH,3)
// TU16ACRH<TU16ACRH4>
extern volatile __bit                   TU16ACRH4           __at(0x1D14);	// @ (0x3A2 * 8 + 4)
#define                                 TU16ACRH4_bit       _BIT_ACCESS(TU16ACRH,4)
// TU16ACRH<TU16ACRH5>
extern volatile __bit                   TU16ACRH5           __at(0x1D15);	// @ (0x3A2 * 8 + 5)
#define                                 TU16ACRH5_bit       _BIT_ACCESS(TU16ACRH,5)
// TU16ACRH<TU16ACRH6>
extern volatile __bit                   TU16ACRH6           __at(0x1D16);	// @ (0x3A2 * 8 + 6)
#define                                 TU16ACRH6_bit       _BIT_ACCESS(TU16ACRH,6)
// TU16ACRH<TU16ACRH7>
extern volatile __bit                   TU16ACRH7           __at(0x1D17);	// @ (0x3A2 * 8 + 7)
#define                                 TU16ACRH7_bit       _BIT_ACCESS(TU16ACRH,7)
// TU16ACRL<TU16ACRL0>
extern volatile __bit                   TU16ACRL0           __at(0x1D08);	// @ (0x3A1 * 8 + 0)
#define                                 TU16ACRL0_bit       _BIT_ACCESS(TU16ACRL,0)
// TU16ACRL<TU16ACRL1>
extern volatile __bit                   TU16ACRL1           __at(0x1D09);	// @ (0x3A1 * 8 + 1)
#define                                 TU16ACRL1_bit       _BIT_ACCESS(TU16ACRL,1)
// TU16ACRL<TU16ACRL2>
extern volatile __bit                   TU16ACRL2           __at(0x1D0A);	// @ (0x3A1 * 8 + 2)
#define                                 TU16ACRL2_bit       _BIT_ACCESS(TU16ACRL,2)
// TU16ACRL<TU16ACRL3>
extern volatile __bit                   TU16ACRL3           __at(0x1D0B);	// @ (0x3A1 * 8 + 3)
#define                                 TU16ACRL3_bit       _BIT_ACCESS(TU16ACRL,3)
// TU16ACRL<TU16ACRL4>
extern volatile __bit                   TU16ACRL4           __at(0x1D0C);	// @ (0x3A1 * 8 + 4)
#define                                 TU16ACRL4_bit       _BIT_ACCESS(TU16ACRL,4)
// TU16ACRL<TU16ACRL5>
extern volatile __bit                   TU16ACRL5           __at(0x1D0D);	// @ (0x3A1 * 8 + 5)
#define                                 TU16ACRL5_bit       _BIT_ACCESS(TU16ACRL,5)
// TU16ACRL<TU16ACRL6>
extern volatile __bit                   TU16ACRL6           __at(0x1D0E);	// @ (0x3A1 * 8 + 6)
#define                                 TU16ACRL6_bit       _BIT_ACCESS(TU16ACRL,6)
// TU16ACRL<TU16ACRL7>
extern volatile __bit                   TU16ACRL7           __at(0x1D0F);	// @ (0x3A1 * 8 + 7)
#define                                 TU16ACRL7_bit       _BIT_ACCESS(TU16ACRL,7)
// TU16ACRT<TU16ACRT0>
extern volatile __bit                   TU16ACRT0           __at(0x1D20);	// @ (0x3A4 * 8 + 0)
#define                                 TU16ACRT0_bit       _BIT_ACCESS(TU16ACRT,0)
// TU16ACRT<TU16ACRT1>
extern volatile __bit                   TU16ACRT1           __at(0x1D21);	// @ (0x3A4 * 8 + 1)
#define                                 TU16ACRT1_bit       _BIT_ACCESS(TU16ACRT,1)
// TU16ACRT<TU16ACRT2>
extern volatile __bit                   TU16ACRT2           __at(0x1D22);	// @ (0x3A4 * 8 + 2)
#define                                 TU16ACRT2_bit       _BIT_ACCESS(TU16ACRT,2)
// TU16ACRT<TU16ACRT3>
extern volatile __bit                   TU16ACRT3           __at(0x1D23);	// @ (0x3A4 * 8 + 3)
#define                                 TU16ACRT3_bit       _BIT_ACCESS(TU16ACRT,3)
// TU16ACRT<TU16ACRT4>
extern volatile __bit                   TU16ACRT4           __at(0x1D24);	// @ (0x3A4 * 8 + 4)
#define                                 TU16ACRT4_bit       _BIT_ACCESS(TU16ACRT,4)
// TU16ACRT<TU16ACRT5>
extern volatile __bit                   TU16ACRT5           __at(0x1D25);	// @ (0x3A4 * 8 + 5)
#define                                 TU16ACRT5_bit       _BIT_ACCESS(TU16ACRT,5)
// TU16ACRT<TU16ACRT6>
extern volatile __bit                   TU16ACRT6           __at(0x1D26);	// @ (0x3A4 * 8 + 6)
#define                                 TU16ACRT6_bit       _BIT_ACCESS(TU16ACRT,6)
// TU16ACRT<TU16ACRT7>
extern volatile __bit                   TU16ACRT7           __at(0x1D27);	// @ (0x3A4 * 8 + 7)
#define                                 TU16ACRT7_bit       _BIT_ACCESS(TU16ACRT,7)
// TU16AHLT<TU16ACSYNC>
extern volatile __bit                   TU16ACSYNC          __at(0x1CFE);	// @ (0x39F * 8 + 6)
#define                                 TU16ACSYNC_bit      _BIT_ACCESS(TU16AHLT,6)
// TU16AHLT<TU16AEPOL>
extern volatile __bit                   TU16AEPOL           __at(0x1CFF);	// @ (0x39F * 8 + 7)
#define                                 TU16AEPOL_bit       _BIT_ACCESS(TU16AHLT,7)
// TU16AERS<TU16AERS0>
extern volatile __bit                   TU16AERS0           __at(0x1D50);	// @ (0x3AA * 8 + 0)
#define                                 TU16AERS0_bit       _BIT_ACCESS(TU16AERS,0)
// TU16AERS<TU16AERS1>
extern volatile __bit                   TU16AERS1           __at(0x1D51);	// @ (0x3AA * 8 + 1)
#define                                 TU16AERS1_bit       _BIT_ACCESS(TU16AERS,1)
// TU16AERS<TU16AERS2>
extern volatile __bit                   TU16AERS2           __at(0x1D52);	// @ (0x3AA * 8 + 2)
#define                                 TU16AERS2_bit       _BIT_ACCESS(TU16AERS,2)
// TU16AERS<TU16AERS3>
extern volatile __bit                   TU16AERS3           __at(0x1D53);	// @ (0x3AA * 8 + 3)
#define                                 TU16AERS3_bit       _BIT_ACCESS(TU16AERS,3)
// TU16AERS<TU16AERS4>
extern volatile __bit                   TU16AERS4           __at(0x1D54);	// @ (0x3AA * 8 + 4)
#define                                 TU16AERS4_bit       _BIT_ACCESS(TU16AERS,4)
// TU16AERS<TU16AERS5>
extern volatile __bit                   TU16AERS5           __at(0x1D55);	// @ (0x3AA * 8 + 5)
#define                                 TU16AERS5_bit       _BIT_ACCESS(TU16AERS,5)
// PIE5<TU16AIE>
extern volatile __bit                   TU16AIE             __at(0x257A);	// @ (0x4AF * 8 + 2)
#define                                 TU16AIE_bit         _BIT_ACCESS(PIE5,2)
// PIR5<TU16AIF>
extern volatile __bit                   TU16AIF             __at(0x25DA);	// @ (0x4BB * 8 + 2)
#define                                 TU16AIF_bit         _BIT_ACCESS(PIR5,2)
// IPR5<TU16AIP>
extern volatile __bit                   TU16AIP             __at(0x251A);	// @ (0x4A3 * 8 + 2)
#define                                 TU16AIP_bit         _BIT_ACCESS(IPR5,2)
// TU16ACON1<TU16ALIMIT>
extern volatile __bit                   TU16ALIMIT          __at(0x1CF4);	// @ (0x39E * 8 + 4)
#define                                 TU16ALIMIT_bit      _BIT_ACCESS(TU16ACON1,4)
// PMD5<TU16AMD>
extern volatile __bit                   TU16AMD             __at(0x339);	// @ (0x67 * 8 + 1)
#define                                 TU16AMD_bit         _BIT_ACCESS(PMD5,1)
// TU16ACON0<TU16AOM>
extern volatile __bit                   TU16AOM             __at(0x1CED);	// @ (0x39D * 8 + 5)
#define                                 TU16AOM_bit         _BIT_ACCESS(TU16ACON0,5)
// TU16ACON0<TU16AON>
