garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f26q24.h
extern volatile __bit                   TU16AON             __at(0x1CEF);	// @ (0x39D * 8 + 7)
#define                                 TU16AON_bit         _BIT_ACCESS(TU16ACON0,7)
// TU16ACON0<TU16AOPOL>
extern volatile __bit                   TU16AOPOL           __at(0x1CEC);	// @ (0x39D * 8 + 4)
#define                                 TU16AOPOL_bit       _BIT_ACCESS(TU16ACON0,4)
// TU16APRL<TU16APR0>
extern volatile __bit                   TU16APR0            __at(0x1D28);	// @ (0x3A5 * 8 + 0)
#define                                 TU16APR0_bit        _BIT_ACCESS(TU16APRL,0)
// TU16APRL<TU16APR1>
extern volatile __bit                   TU16APR1            __at(0x1D29);	// @ (0x3A5 * 8 + 1)
#define                                 TU16APR1_bit        _BIT_ACCESS(TU16APRL,1)
// TU16APRH<TU16APR10>
extern volatile __bit                   TU16APR10           __at(0x1D32);	// @ (0x3A6 * 8 + 2)
#define                                 TU16APR10_bit       _BIT_ACCESS(TU16APRH,2)
// TU16APRH<TU16APR11>
extern volatile __bit                   TU16APR11           __at(0x1D33);	// @ (0x3A6 * 8 + 3)
#define                                 TU16APR11_bit       _BIT_ACCESS(TU16APRH,3)
// TU16APRH<TU16APR12>
extern volatile __bit                   TU16APR12           __at(0x1D34);	// @ (0x3A6 * 8 + 4)
#define                                 TU16APR12_bit       _BIT_ACCESS(TU16APRH,4)
// TU16APRH<TU16APR13>
extern volatile __bit                   TU16APR13           __at(0x1D35);	// @ (0x3A6 * 8 + 5)
#define                                 TU16APR13_bit       _BIT_ACCESS(TU16APRH,5)
// TU16APRH<TU16APR14>
extern volatile __bit                   TU16APR14           __at(0x1D36);	// @ (0x3A6 * 8 + 6)
#define                                 TU16APR14_bit       _BIT_ACCESS(TU16APRH,6)
// TU16APRH<TU16APR15>
extern volatile __bit                   TU16APR15           __at(0x1D37);	// @ (0x3A6 * 8 + 7)
#define                                 TU16APR15_bit       _BIT_ACCESS(TU16APRH,7)
// TU16APRL<TU16APR2>
extern volatile __bit                   TU16APR2            __at(0x1D2A);	// @ (0x3A5 * 8 + 2)
#define                                 TU16APR2_bit        _BIT_ACCESS(TU16APRL,2)
// TU16APRT<TU16APR24>
extern volatile __bit                   TU16APR24           __at(0x1D40);	// @ (0x3A8 * 8 + 0)
#define                                 TU16APR24_bit       _BIT_ACCESS(TU16APRT,0)
// TU16APRT<TU16APR25>
extern volatile __bit                   TU16APR25           __at(0x1D41);	// @ (0x3A8 * 8 + 1)
#define                                 TU16APR25_bit       _BIT_ACCESS(TU16APRT,1)
// TU16APRT<TU16APR26>
extern volatile __bit                   TU16APR26           __at(0x1D42);	// @ (0x3A8 * 8 + 2)
#define                                 TU16APR26_bit       _BIT_ACCESS(TU16APRT,2)
// TU16APRT<TU16APR27>
extern volatile __bit                   TU16APR27           __at(0x1D43);	// @ (0x3A8 * 8 + 3)
#define                                 TU16APR27_bit       _BIT_ACCESS(TU16APRT,3)
// TU16APRT<TU16APR28>
extern volatile __bit                   TU16APR28           __at(0x1D44);	// @ (0x3A8 * 8 + 4)
#define                                 TU16APR28_bit       _BIT_ACCESS(TU16APRT,4)
// TU16APRT<TU16APR29>
extern volatile __bit                   TU16APR29           __at(0x1D45);	// @ (0x3A8 * 8 + 5)
#define                                 TU16APR29_bit       _BIT_ACCESS(TU16APRT,5)
// TU16APRL<TU16APR3>
extern volatile __bit                   TU16APR3            __at(0x1D2B);	// @ (0x3A5 * 8 + 3)
#define                                 TU16APR3_bit        _BIT_ACCESS(TU16APRL,3)
// TU16APRT<TU16APR30>
extern volatile __bit                   TU16APR30           __at(0x1D46);	// @ (0x3A8 * 8 + 6)
#define                                 TU16APR30_bit       _BIT_ACCESS(TU16APRT,6)
// TU16APRT<TU16APR31>
extern volatile __bit                   TU16APR31           __at(0x1D47);	// @ (0x3A8 * 8 + 7)
#define                                 TU16APR31_bit       _BIT_ACCESS(TU16APRT,7)
// TU16APRL<TU16APR4>
extern volatile __bit                   TU16APR4            __at(0x1D2C);	// @ (0x3A5 * 8 + 4)
#define                                 TU16APR4_bit        _BIT_ACCESS(TU16APRL,4)
// TU16APRL<TU16APR5>
extern volatile __bit                   TU16APR5            __at(0x1D2D);	// @ (0x3A5 * 8 + 5)
#define                                 TU16APR5_bit        _BIT_ACCESS(TU16APRL,5)
// TU16APRL<TU16APR6>
extern volatile __bit                   TU16APR6            __at(0x1D2E);	// @ (0x3A5 * 8 + 6)
#define                                 TU16APR6_bit        _BIT_ACCESS(TU16APRL,6)
// TU16APRL<TU16APR7>
extern volatile __bit                   TU16APR7            __at(0x1D2F);	// @ (0x3A5 * 8 + 7)
#define                                 TU16APR7_bit        _BIT_ACCESS(TU16APRL,7)
// TU16APRH<TU16APR8>
extern volatile __bit                   TU16APR8            __at(0x1D30);	// @ (0x3A6 * 8 + 0)
#define                                 TU16APR8_bit        _BIT_ACCESS(TU16APRH,0)
// TU16APRH<TU16APR9>
extern volatile __bit                   TU16APR9            __at(0x1D31);	// @ (0x3A6 * 8 + 1)
#define                                 TU16APR9_bit        _BIT_ACCESS(TU16APRH,1)
// TU16APRH<TU16APRH0>
extern volatile __bit                   TU16APRH0           __at(0x1D30);	// @ (0x3A6 * 8 + 0)
#define                                 TU16APRH0_bit       _BIT_ACCESS(TU16APRH,0)
// TU16APRH<TU16APRH1>
extern volatile __bit                   TU16APRH1           __at(0x1D31);	// @ (0x3A6 * 8 + 1)
#define                                 TU16APRH1_bit       _BIT_ACCESS(TU16APRH,1)
// TU16APRH<TU16APRH2>
extern volatile __bit                   TU16APRH2           __at(0x1D32);	// @ (0x3A6 * 8 + 2)
#define                                 TU16APRH2_bit       _BIT_ACCESS(TU16APRH,2)
// TU16APRH<TU16APRH3>
extern volatile __bit                   TU16APRH3           __at(0x1D33);	// @ (0x3A6 * 8 + 3)
#define                                 TU16APRH3_bit       _BIT_ACCESS(TU16APRH,3)
// TU16APRH<TU16APRH4>
extern volatile __bit                   TU16APRH4           __at(0x1D34);	// @ (0x3A6 * 8 + 4)
#define                                 TU16APRH4_bit       _BIT_ACCESS(TU16APRH,4)
// TU16APRH<TU16APRH5>
extern volatile __bit                   TU16APRH5           __at(0x1D35);	// @ (0x3A6 * 8 + 5)
#define                                 TU16APRH5_bit       _BIT_ACCESS(TU16APRH,5)
// TU16APRH<TU16APRH6>
extern volatile __bit                   TU16APRH6           __at(0x1D36);	// @ (0x3A6 * 8 + 6)
#define                                 TU16APRH6_bit       _BIT_ACCESS(TU16APRH,6)
// TU16APRH<TU16APRH7>
extern volatile __bit                   TU16APRH7           __at(0x1D37);	// @ (0x3A6 * 8 + 7)
#define                                 TU16APRH7_bit       _BIT_ACCESS(TU16APRH,7)
// TU16ACON0<TU16APRIE>
extern volatile __bit                   TU16APRIE           __at(0x1CEA);	// @ (0x39D * 8 + 2)
#define                                 TU16APRIE_bit       _BIT_ACCESS(TU16ACON0,2)
// TU16ACON1<TU16APRIF>
extern volatile __bit                   TU16APRIF           __at(0x1CF2);	// @ (0x39E * 8 + 2)
#define                                 TU16APRIF_bit       _BIT_ACCESS(TU16ACON1,2)
// TU16APRL<TU16APRL0>
extern volatile __bit                   TU16APRL0           __at(0x1D28);	// @ (0x3A5 * 8 + 0)
#define                                 TU16APRL0_bit       _BIT_ACCESS(TU16APRL,0)
// TU16APRL<TU16APRL1>
extern volatile __bit                   TU16APRL1           __at(0x1D29);	// @ (0x3A5 * 8 + 1)
#define                                 TU16APRL1_bit       _BIT_ACCESS(TU16APRL,1)
// TU16APRL<TU16APRL2>
extern volatile __bit                   TU16APRL2           __at(0x1D2A);	// @ (0x3A5 * 8 + 2)
#define                                 TU16APRL2_bit       _BIT_ACCESS(TU16APRL,2)
// TU16APRL<TU16APRL3>
extern volatile __bit                   TU16APRL3           __at(0x1D2B);	// @ (0x3A5 * 8 + 3)
#define                                 TU16APRL3_bit       _BIT_ACCESS(TU16APRL,3)
// TU16APRL<TU16APRL4>
extern volatile __bit                   TU16APRL4           __at(0x1D2C);	// @ (0x3A5 * 8 + 4)
#define                                 TU16APRL4_bit       _BIT_ACCESS(TU16APRL,4)
// TU16APRL<TU16APRL5>
extern volatile __bit                   TU16APRL5           __at(0x1D2D);	// @ (0x3A5 * 8 + 5)
#define                                 TU16APRL5_bit       _BIT_ACCESS(TU16APRL,5)
// TU16APRL<TU16APRL6>
extern volatile __bit                   TU16APRL6           __at(0x1D2E);	// @ (0x3A5 * 8 + 6)
#define                                 TU16APRL6_bit       _BIT_ACCESS(TU16APRL,6)
// TU16APRL<TU16APRL7>
extern volatile __bit                   TU16APRL7           __at(0x1D2F);	// @ (0x3A5 * 8 + 7)
#define                                 TU16APRL7_bit       _BIT_ACCESS(TU16APRL,7)
// TU16APRT<TU16APRT0>
extern volatile __bit                   TU16APRT0           __at(0x1D40);	// @ (0x3A8 * 8 + 0)
#define                                 TU16APRT0_bit       _BIT_ACCESS(TU16APRT,0)
// TU16APRT<TU16APRT1>
extern volatile __bit                   TU16APRT1           __at(0x1D41);	// @ (0x3A8 * 8 + 1)
#define                                 TU16APRT1_bit       _BIT_ACCESS(TU16APRT,1)
// TU16APRT<TU16APRT2>
extern volatile __bit                   TU16APRT2           __at(0x1D42);	// @ (0x3A8 * 8 + 2)
#define                                 TU16APRT2_bit       _BIT_ACCESS(TU16APRT,2)
// TU16APRT<TU16APRT3>
extern volatile __bit                   TU16APRT3           __at(0x1D43);	// @ (0x3A8 * 8 + 3)
#define                                 TU16APRT3_bit       _BIT_ACCESS(TU16APRT,3)
// TU16APRT<TU16APRT4>
extern volatile __bit                   TU16APRT4           __at(0x1D44);	// @ (0x3A8 * 8 + 4)
#define                                 TU16APRT4_bit       _BIT_ACCESS(TU16APRT,4)
// TU16APRT<TU16APRT5>
extern volatile __bit                   TU16APRT5           __at(0x1D45);	// @ (0x3A8 * 8 + 5)
#define                                 TU16APRT5_bit       _BIT_ACCESS(TU16APRT,5)
// TU16APRT<TU16APRT6>
extern volatile __bit                   TU16APRT6           __at(0x1D46);	// @ (0x3A8 * 8 + 6)
#define                                 TU16APRT6_bit       _BIT_ACCESS(TU16APRT,6)
// TU16APRT<TU16APRT7>
extern volatile __bit                   TU16APRT7           __at(0x1D47);	// @ (0x3A8 * 8 + 7)
#define                                 TU16APRT7_bit       _BIT_ACCESS(TU16APRT,7)
// TU16APS<TU16APS0>
extern volatile __bit                   TU16APS0            __at(0x1D00);	// @ (0x3A0 * 8 + 0)
#define                                 TU16APS0_bit        _BIT_ACCESS(TU16APS,0)
// TU16APS<TU16APS1>
extern volatile __bit                   TU16APS1            __at(0x1D01);	// @ (0x3A0 * 8 + 1)
#define                                 TU16APS1_bit        _BIT_ACCESS(TU16APS,1)
// TU16APS<TU16APS2>
extern volatile __bit                   TU16APS2            __at(0x1D02);	// @ (0x3A0 * 8 + 2)
#define                                 TU16APS2_bit        _BIT_ACCESS(TU16APS,2)
// TU16APS<TU16APS3>
extern volatile __bit                   TU16APS3            __at(0x1D03);	// @ (0x3A0 * 8 + 3)
#define                                 TU16APS3_bit        _BIT_ACCESS(TU16APS,3)
// TU16APS<TU16APS4>
extern volatile __bit                   TU16APS4            __at(0x1D04);	// @ (0x3A0 * 8 + 4)
#define                                 TU16APS4_bit        _BIT_ACCESS(TU16APS,4)
// TU16APS<TU16APS5>
extern volatile __bit                   TU16APS5            __at(0x1D05);	// @ (0x3A0 * 8 + 5)
#define                                 TU16APS5_bit        _BIT_ACCESS(TU16APS,5)
// TU16APS<TU16APS6>
extern volatile __bit                   TU16APS6            __at(0x1D06);	// @ (0x3A0 * 8 + 6)
#define                                 TU16APS6_bit        _BIT_ACCESS(TU16APS,6)
// TU16APS<TU16APS7>
extern volatile __bit                   TU16APS7            __at(0x1D07);	// @ (0x3A0 * 8 + 7)
#define                                 TU16APS7_bit        _BIT_ACCESS(TU16APS,7)
// TU16ACON0<TU16ARDSEL>
extern volatile __bit                   TU16ARDSEL          __at(0x1CEB);	// @ (0x39D * 8 + 3)
#define                                 TU16ARDSEL_bit      _BIT_ACCESS(TU16ACON0,3)
// TU16AHLT<TU16ARESET0>
extern volatile __bit                   TU16ARESET0         __at(0x1CFA);	// @ (0x39F * 8 + 2)
#define                                 TU16ARESET0_bit     _BIT_ACCESS(TU16AHLT,2)
// TU16AHLT<TU16ARESET1>
extern volatile __bit                   TU16ARESET1         __at(0x1CFB);	// @ (0x39F * 8 + 3)
#define                                 TU16ARESET1_bit     _BIT_ACCESS(TU16AHLT,3)
// TU16ACON1<TU16ARUN>
extern volatile __bit                   TU16ARUN            __at(0x1CF7);	// @ (0x39E * 8 + 7)
#define                                 TU16ARUN_bit        _BIT_ACCESS(TU16ACON1,7)
// TU16AHLT<TU16ASTART0>
extern volatile __bit                   TU16ASTART0         __at(0x1CFC);	// @ (0x39F * 8 + 4)
#define                                 TU16ASTART0_bit     _BIT_ACCESS(TU16AHLT,4)
// TU16AHLT<TU16ASTART1>
extern volatile __bit                   TU16ASTART1         __at(0x1CFD);	// @ (0x39F * 8 + 5)
#define                                 TU16ASTART1_bit     _BIT_ACCESS(TU16AHLT,5)
// TU16AHLT<TU16ASTOP0>
extern volatile __bit                   TU16ASTOP0          __at(0x1CF8);	// @ (0x39F * 8 + 0)
#define                                 TU16ASTOP0_bit      _BIT_ACCESS(TU16AHLT,0)
// TU16AHLT<TU16ASTOP1>
extern volatile __bit                   TU16ASTOP1          __at(0x1CF9);	// @ (0x39F * 8 + 1)
#define                                 TU16ASTOP1_bit      _BIT_ACCESS(TU16AHLT,1)
// TU16ATMRL<TU16ATMR0>
extern volatile __bit                   TU16ATMR0           __at(0x1D08);	// @ (0x3A1 * 8 + 0)
#define                                 TU16ATMR0_bit       _BIT_ACCESS(TU16ATMRL,0)
// TU16ATMRL<TU16ATMR1>
extern volatile __bit                   TU16ATMR1           __at(0x1D09);	// @ (0x3A1 * 8 + 1)
#define                                 TU16ATMR1_bit       _BIT_ACCESS(TU16ATMRL,1)
// TU16ATMRH<TU16ATMR10>
extern volatile __bit                   TU16ATMR10          __at(0x1D12);	// @ (0x3A2 * 8 + 2)
#define                                 TU16ATMR10_bit      _BIT_ACCESS(TU16ATMRH,2)
// TU16ATMRH<TU16ATMR11>
extern volatile __bit                   TU16ATMR11          __at(0x1D13);	// @ (0x3A2 * 8 + 3)
#define                                 TU16ATMR11_bit      _BIT_ACCESS(TU16ATMRH,3)
// TU16ATMRH<TU16ATMR12>
extern volatile __bit                   TU16ATMR12          __at(0x1D14);	// @ (0x3A2 * 8 + 4)
#define                                 TU16ATMR12_bit      _BIT_ACCESS(TU16ATMRH,4)
// TU16ATMRH<TU16ATMR13>
extern volatile __bit                   TU16ATMR13          __at(0x1D15);	// @ (0x3A2 * 8 + 5)
#define                                 TU16ATMR13_bit      _BIT_ACCESS(TU16ATMRH,5)
// TU16ATMRH<TU16ATMR14>
extern volatile __bit                   TU16ATMR14          __at(0x1D16);	// @ (0x3A2 * 8 + 6)
#define                                 TU16ATMR14_bit      _BIT_ACCESS(TU16ATMRH,6)
// TU16ATMRH<TU16ATMR15>
extern volatile __bit                   TU16ATMR15          __at(0x1D17);	// @ (0x3A2 * 8 + 7)
#define                                 TU16ATMR15_bit      _BIT_ACCESS(TU16ATMRH,7)
// TU16ATMRL<TU16ATMR2>
extern volatile __bit                   TU16ATMR2           __at(0x1D0A);	// @ (0x3A1 * 8 + 2)
#define                                 TU16ATMR2_bit       _BIT_ACCESS(TU16ATMRL,2)
// TU16ATMRT<TU16ATMR24>
extern volatile __bit                   TU16ATMR24          __at(0x1D20);	// @ (0x3A4 * 8 + 0)
#define                                 TU16ATMR24_bit      _BIT_ACCESS(TU16ATMRT,0)
// TU16ATMRT<TU16ATMR25>
extern volatile __bit                   TU16ATMR25          __at(0x1D21);	// @ (0x3A4 * 8 + 1)
#define                                 TU16ATMR25_bit      _BIT_ACCESS(TU16ATMRT,1)
// TU16ATMRT<TU16ATMR26>
extern volatile __bit                   TU16ATMR26          __at(0x1D22);	// @ (0x3A4 * 8 + 2)
#define                                 TU16ATMR26_bit      _BIT_ACCESS(TU16ATMRT,2)
// TU16ATMRT<TU16ATMR27>
extern volatile __bit                   TU16ATMR27          __at(0x1D23);	// @ (0x3A4 * 8 + 3)
#define                                 TU16ATMR27_bit      _BIT_ACCESS(TU16ATMRT,3)
// TU16ATMRT<TU16ATMR28>
extern volatile __bit                   TU16ATMR28          __at(0x1D24);	// @ (0x3A4 * 8 + 4)
#define                                 TU16ATMR28_bit      _BIT_ACCESS(TU16ATMRT,4)
// TU16ATMRT<TU16ATMR29>
extern volatile __bit                   TU16ATMR29          __at(0x1D25);	// @ (0x3A4 * 8 + 5)
#define                                 TU16ATMR29_bit      _BIT_ACCESS(TU16ATMRT,5)
// TU16ATMRL<TU16ATMR3>
extern volatile __bit                   TU16ATMR3           __at(0x1D0B);	// @ (0x3A1 * 8 + 3)
#define                                 TU16ATMR3_bit       _BIT_ACCESS(TU16ATMRL,3)
// TU16ATMRT<TU16ATMR30>
extern volatile __bit                   TU16ATMR30          __at(0x1D26);	// @ (0x3A4 * 8 + 6)
#define                                 TU16ATMR30_bit      _BIT_ACCESS(TU16ATMRT,6)
// TU16ATMRT<TU16ATMR31>
extern volatile __bit                   TU16ATMR31          __at(0x1D27);	// @ (0x3A4 * 8 + 7)
#define                                 TU16ATMR31_bit      _BIT_ACCESS(TU16ATMRT,7)
// TU16ATMRL<TU16ATMR4>
extern volatile __bit                   TU16ATMR4           __at(0x1D0C);	// @ (0x3A1 * 8 + 4)
#define                                 TU16ATMR4_bit       _BIT_ACCESS(TU16ATMRL,4)
// TU16ATMRL<TU16ATMR5>
extern volatile __bit                   TU16ATMR5           __at(0x1D0D);	// @ (0x3A1 * 8 + 5)
#define                                 TU16ATMR5_bit       _BIT_ACCESS(TU16ATMRL,5)
// TU16ATMRL<TU16ATMR6>
extern volatile __bit                   TU16ATMR6           __at(0x1D0E);	// @ (0x3A1 * 8 + 6)
#define                                 TU16ATMR6_bit       _BIT_ACCESS(TU16ATMRL,6)
// TU16ATMRL<TU16ATMR7>
extern volatile __bit                   TU16ATMR7           __at(0x1D0F);	// @ (0x3A1 * 8 + 7)
#define                                 TU16ATMR7_bit       _BIT_ACCESS(TU16ATMRL,7)
// TU16ATMRH<TU16ATMR8>
extern volatile __bit                   TU16ATMR8           __at(0x1D10);	// @ (0x3A2 * 8 + 0)
#define                                 TU16ATMR8_bit       _BIT_ACCESS(TU16ATMRH,0)
// TU16ATMRH<TU16ATMR9>
extern volatile __bit                   TU16ATMR9           __at(0x1D11);	// @ (0x3A2 * 8 + 1)
#define                                 TU16ATMR9_bit       _BIT_ACCESS(TU16ATMRH,1)
// TU16ATMRH<TU16ATMRH0>
extern volatile __bit                   TU16ATMRH0          __at(0x1D10);	// @ (0x3A2 * 8 + 0)
#define                                 TU16ATMRH0_bit      _BIT_ACCESS(TU16ATMRH,0)
// TU16ATMRH<TU16ATMRH1>
extern volatile __bit                   TU16ATMRH1          __at(0x1D11);	// @ (0x3A2 * 8 + 1)
#define                                 TU16ATMRH1_bit      _BIT_ACCESS(TU16ATMRH,1)
// TU16ATMRH<TU16ATMRH2>
extern volatile __bit                   TU16ATMRH2          __at(0x1D12);	// @ (0x3A2 * 8 + 2)
#define                                 TU16ATMRH2_bit      _BIT_ACCESS(TU16ATMRH,2)
// TU16ATMRH<TU16ATMRH3>
extern volatile __bit                   TU16ATMRH3          __at(0x1D13);	// @ (0x3A2 * 8 + 3)
#define                                 TU16ATMRH3_bit      _BIT_ACCESS(TU16ATMRH,3)
// TU16ATMRH<TU16ATMRH4>
extern volatile __bit                   TU16ATMRH4          __at(0x1D14);	// @ (0x3A2 * 8 + 4)
#define                                 TU16ATMRH4_bit      _BIT_ACCESS(TU16ATMRH,4)
// TU16ATMRH<TU16ATMRH5>
extern volatile __bit                   TU16ATMRH5          __at(0x1D15);	// @ (0x3A2 * 8 + 5)
#define                                 TU16ATMRH5_bit      _BIT_ACCESS(TU16ATMRH,5)
// TU16ATMRH<TU16ATMRH6>
extern volatile __bit                   TU16ATMRH6          __at(0x1D16);	// @ (0x3A2 * 8 + 6)
#define                                 TU16ATMRH6_bit      _BIT_ACCESS(TU16ATMRH,6)
// TU16ATMRH<TU16ATMRH7>
extern volatile __bit                   TU16ATMRH7          __at(0x1D17);	// @ (0x3A2 * 8 + 7)
#define                                 TU16ATMRH7_bit      _BIT_ACCESS(TU16ATMRH,7)
// TU16ATMRL<TU16ATMRL0>
extern volatile __bit                   TU16ATMRL0          __at(0x1D08);	// @ (0x3A1 * 8 + 0)
#define                                 TU16ATMRL0_bit      _BIT_ACCESS(TU16ATMRL,0)
// TU16ATMRL<TU16ATMRL1>
extern volatile __bit                   TU16ATMRL1          __at(0x1D09);	// @ (0x3A1 * 8 + 1)
#define                                 TU16ATMRL1_bit      _BIT_ACCESS(TU16ATMRL,1)
// TU16ATMRL<TU16ATMRL2>
extern volatile __bit                   TU16ATMRL2          __at(0x1D0A);	// @ (0x3A1 * 8 + 2)
#define                                 TU16ATMRL2_bit      _BIT_ACCESS(TU16ATMRL,2)
// TU16ATMRL<TU16ATMRL3>
extern volatile __bit                   TU16ATMRL3          __at(0x1D0B);	// @ (0x3A1 * 8 + 3)
#define                                 TU16ATMRL3_bit      _BIT_ACCESS(TU16ATMRL,3)
// TU16ATMRL<TU16ATMRL4>
extern volatile __bit                   TU16ATMRL4          __at(0x1D0C);	// @ (0x3A1 * 8 + 4)
#define                                 TU16ATMRL4_bit      _BIT_ACCESS(TU16ATMRL,4)
// TU16ATMRL<TU16ATMRL5>
extern volatile __bit                   TU16ATMRL5          __at(0x1D0D);	// @ (0x3A1 * 8 + 5)
#define                                 TU16ATMRL5_bit      _BIT_ACCESS(TU16ATMRL,5)
// TU16ATMRL<TU16ATMRL6>
extern volatile __bit                   TU16ATMRL6          __at(0x1D0E);	// @ (0x3A1 * 8 + 6)
#define                                 TU16ATMRL6_bit      _BIT_ACCESS(TU16ATMRL,6)
// TU16ATMRL<TU16ATMRL7>
extern volatile __bit                   TU16ATMRL7          __at(0x1D0F);	// @ (0x3A1 * 8 + 7)
#define                                 TU16ATMRL7_bit      _BIT_ACCESS(TU16ATMRL,7)
// TU16ATMRT<TU16ATMRT0>
extern volatile __bit                   TU16ATMRT0          __at(0x1D20);	// @ (0x3A4 * 8 + 0)
#define                                 TU16ATMRT0_bit      _BIT_ACCESS(TU16ATMRT,0)
// TU16ATMRT<TU16ATMRT1>
extern volatile __bit                   TU16ATMRT1          __at(0x1D21);	// @ (0x3A4 * 8 + 1)
#define                                 TU16ATMRT1_bit      _BIT_ACCESS(TU16ATMRT,1)
// TU16ATMRT<TU16ATMRT2>
extern volatile __bit                   TU16ATMRT2          __at(0x1D22);	// @ (0x3A4 * 8 + 2)
#define                                 TU16ATMRT2_bit      _BIT_ACCESS(TU16ATMRT,2)
// TU16ATMRT<TU16ATMRT3>
extern volatile __bit                   TU16ATMRT3          __at(0x1D23);	// @ (0x3A4 * 8 + 3)
#define                                 TU16ATMRT3_bit      _BIT_ACCESS(TU16ATMRT,3)
// TU16ATMRT<TU16ATMRT4>
extern volatile __bit                   TU16ATMRT4          __at(0x1D24);	// @ (0x3A4 * 8 + 4)
#define                                 TU16ATMRT4_bit      _BIT_ACCESS(TU16ATMRT,4)
// TU16ATMRT<TU16ATMRT5>
extern volatile __bit                   TU16ATMRT5          __at(0x1D25);	// @ (0x3A4 * 8 + 5)
#define                                 TU16ATMRT5_bit      _BIT_ACCESS(TU16ATMRT,5)
// TU16ATMRT<TU16ATMRT6>
extern volatile __bit                   TU16ATMRT6          __at(0x1D26);	// @ (0x3A4 * 8 + 6)
#define                                 TU16ATMRT6_bit      _BIT_ACCESS(TU16ATMRT,6)
// TU16ATMRT<TU16ATMRT7>
extern volatile __bit                   TU16ATMRT7          __at(0x1D27);	// @ (0x3A4 * 8 + 7)
#define                                 TU16ATMRT7_bit      _BIT_ACCESS(TU16ATMRT,7)
// TU16ACON0<TU16AZIE>
extern volatile __bit                   TU16AZIE            __at(0x1CE9);	// @ (0x39D * 8 + 1)
#define                                 TU16AZIE_bit        _BIT_ACCESS(TU16ACON0,1)
// TU16ACON1<TU16AZIF>
extern volatile __bit                   TU16AZIF            __at(0x1CF1);	// @ (0x39E * 8 + 1)
#define                                 TU16AZIF_bit        _BIT_ACCESS(TU16ACON1,1)
// TU16BCON1<TU16BCAPT>
