garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f26q24.h
extern volatile __bit                   TU16BCAPT           __at(0x1D63);	// @ (0x3AC * 8 + 3)
#define                                 TU16BCAPT_bit       _BIT_ACCESS(TU16BCON1,3)
// TU16BCON0<TU16BCIE>
extern volatile __bit                   TU16BCIE            __at(0x1D58);	// @ (0x3AB * 8 + 0)
#define                                 TU16BCIE_bit        _BIT_ACCESS(TU16BCON0,0)
// TU16BCON1<TU16BCIF>
extern volatile __bit                   TU16BCIF            __at(0x1D60);	// @ (0x3AC * 8 + 0)
#define                                 TU16BCIF_bit        _BIT_ACCESS(TU16BCON1,0)
// TU16BCLK<TU16BCLK0>
extern volatile __bit                   TU16BCLK0           __at(0x1DB8);	// @ (0x3B7 * 8 + 0)
#define                                 TU16BCLK0_bit       _BIT_ACCESS(TU16BCLK,0)
// TU16BCLK<TU16BCLK1>
extern volatile __bit                   TU16BCLK1           __at(0x1DB9);	// @ (0x3B7 * 8 + 1)
#define                                 TU16BCLK1_bit       _BIT_ACCESS(TU16BCLK,1)
// TU16BCLK<TU16BCLK2>
extern volatile __bit                   TU16BCLK2           __at(0x1DBA);	// @ (0x3B7 * 8 + 2)
#define                                 TU16BCLK2_bit       _BIT_ACCESS(TU16BCLK,2)
// TU16BCLK<TU16BCLK3>
extern volatile __bit                   TU16BCLK3           __at(0x1DBB);	// @ (0x3B7 * 8 + 3)
#define                                 TU16BCLK3_bit       _BIT_ACCESS(TU16BCLK,3)
// TU16BCLK<TU16BCLK4>
extern volatile __bit                   TU16BCLK4           __at(0x1DBC);	// @ (0x3B7 * 8 + 4)
#define                                 TU16BCLK4_bit       _BIT_ACCESS(TU16BCLK,4)
// TU16BCON1<TU16BCLR>
extern volatile __bit                   TU16BCLR            __at(0x1D65);	// @ (0x3AC * 8 + 5)
#define                                 TU16BCLR_bit        _BIT_ACCESS(TU16BCON1,5)
// TU16BCON0<TU16BCPOL>
extern volatile __bit                   TU16BCPOL           __at(0x1D5E);	// @ (0x3AB * 8 + 6)
#define                                 TU16BCPOL_bit       _BIT_ACCESS(TU16BCON0,6)
// TU16BCRL<TU16BCR0>
extern volatile __bit                   TU16BCR0            __at(0x1D78);	// @ (0x3AF * 8 + 0)
#define                                 TU16BCR0_bit        _BIT_ACCESS(TU16BCRL,0)
// TU16BCRL<TU16BCR1>
extern volatile __bit                   TU16BCR1            __at(0x1D79);	// @ (0x3AF * 8 + 1)
#define                                 TU16BCR1_bit        _BIT_ACCESS(TU16BCRL,1)
// TU16BCRH<TU16BCR10>
extern volatile __bit                   TU16BCR10           __at(0x1D82);	// @ (0x3B0 * 8 + 2)
#define                                 TU16BCR10_bit       _BIT_ACCESS(TU16BCRH,2)
// TU16BCRH<TU16BCR11>
extern volatile __bit                   TU16BCR11           __at(0x1D83);	// @ (0x3B0 * 8 + 3)
#define                                 TU16BCR11_bit       _BIT_ACCESS(TU16BCRH,3)
// TU16BCRH<TU16BCR12>
extern volatile __bit                   TU16BCR12           __at(0x1D84);	// @ (0x3B0 * 8 + 4)
#define                                 TU16BCR12_bit       _BIT_ACCESS(TU16BCRH,4)
// TU16BCRH<TU16BCR13>
extern volatile __bit                   TU16BCR13           __at(0x1D85);	// @ (0x3B0 * 8 + 5)
#define                                 TU16BCR13_bit       _BIT_ACCESS(TU16BCRH,5)
// TU16BCRH<TU16BCR14>
extern volatile __bit                   TU16BCR14           __at(0x1D86);	// @ (0x3B0 * 8 + 6)
#define                                 TU16BCR14_bit       _BIT_ACCESS(TU16BCRH,6)
// TU16BCRH<TU16BCR15>
extern volatile __bit                   TU16BCR15           __at(0x1D87);	// @ (0x3B0 * 8 + 7)
#define                                 TU16BCR15_bit       _BIT_ACCESS(TU16BCRH,7)
// TU16BCRL<TU16BCR2>
extern volatile __bit                   TU16BCR2            __at(0x1D7A);	// @ (0x3AF * 8 + 2)
#define                                 TU16BCR2_bit        _BIT_ACCESS(TU16BCRL,2)
// TU16BCRT<TU16BCR24>
extern volatile __bit                   TU16BCR24           __at(0x1D90);	// @ (0x3B2 * 8 + 0)
#define                                 TU16BCR24_bit       _BIT_ACCESS(TU16BCRT,0)
// TU16BCRT<TU16BCR25>
extern volatile __bit                   TU16BCR25           __at(0x1D91);	// @ (0x3B2 * 8 + 1)
#define                                 TU16BCR25_bit       _BIT_ACCESS(TU16BCRT,1)
// TU16BCRT<TU16BCR26>
extern volatile __bit                   TU16BCR26           __at(0x1D92);	// @ (0x3B2 * 8 + 2)
#define                                 TU16BCR26_bit       _BIT_ACCESS(TU16BCRT,2)
// TU16BCRT<TU16BCR27>
extern volatile __bit                   TU16BCR27           __at(0x1D93);	// @ (0x3B2 * 8 + 3)
#define                                 TU16BCR27_bit       _BIT_ACCESS(TU16BCRT,3)
// TU16BCRT<TU16BCR28>
extern volatile __bit                   TU16BCR28           __at(0x1D94);	// @ (0x3B2 * 8 + 4)
#define                                 TU16BCR28_bit       _BIT_ACCESS(TU16BCRT,4)
// TU16BCRT<TU16BCR29>
extern volatile __bit                   TU16BCR29           __at(0x1D95);	// @ (0x3B2 * 8 + 5)
#define                                 TU16BCR29_bit       _BIT_ACCESS(TU16BCRT,5)
// TU16BCRL<TU16BCR3>
extern volatile __bit                   TU16BCR3            __at(0x1D7B);	// @ (0x3AF * 8 + 3)
#define                                 TU16BCR3_bit        _BIT_ACCESS(TU16BCRL,3)
// TU16BCRT<TU16BCR30>
extern volatile __bit                   TU16BCR30           __at(0x1D96);	// @ (0x3B2 * 8 + 6)
#define                                 TU16BCR30_bit       _BIT_ACCESS(TU16BCRT,6)
// TU16BCRT<TU16BCR31>
extern volatile __bit                   TU16BCR31           __at(0x1D97);	// @ (0x3B2 * 8 + 7)
#define                                 TU16BCR31_bit       _BIT_ACCESS(TU16BCRT,7)
// TU16BCRL<TU16BCR4>
extern volatile __bit                   TU16BCR4            __at(0x1D7C);	// @ (0x3AF * 8 + 4)
#define                                 TU16BCR4_bit        _BIT_ACCESS(TU16BCRL,4)
// TU16BCRL<TU16BCR5>
extern volatile __bit                   TU16BCR5            __at(0x1D7D);	// @ (0x3AF * 8 + 5)
#define                                 TU16BCR5_bit        _BIT_ACCESS(TU16BCRL,5)
// TU16BCRL<TU16BCR6>
extern volatile __bit                   TU16BCR6            __at(0x1D7E);	// @ (0x3AF * 8 + 6)
#define                                 TU16BCR6_bit        _BIT_ACCESS(TU16BCRL,6)
// TU16BCRL<TU16BCR7>
extern volatile __bit                   TU16BCR7            __at(0x1D7F);	// @ (0x3AF * 8 + 7)
#define                                 TU16BCR7_bit        _BIT_ACCESS(TU16BCRL,7)
// TU16BCRH<TU16BCR8>
extern volatile __bit                   TU16BCR8            __at(0x1D80);	// @ (0x3B0 * 8 + 0)
#define                                 TU16BCR8_bit        _BIT_ACCESS(TU16BCRH,0)
// TU16BCRH<TU16BCR9>
extern volatile __bit                   TU16BCR9            __at(0x1D81);	// @ (0x3B0 * 8 + 1)
#define                                 TU16BCR9_bit        _BIT_ACCESS(TU16BCRH,1)
// TU16BCRH<TU16BCRH0>
extern volatile __bit                   TU16BCRH0           __at(0x1D80);	// @ (0x3B0 * 8 + 0)
#define                                 TU16BCRH0_bit       _BIT_ACCESS(TU16BCRH,0)
// TU16BCRH<TU16BCRH1>
extern volatile __bit                   TU16BCRH1           __at(0x1D81);	// @ (0x3B0 * 8 + 1)
#define                                 TU16BCRH1_bit       _BIT_ACCESS(TU16BCRH,1)
// TU16BCRH<TU16BCRH2>
extern volatile __bit                   TU16BCRH2           __at(0x1D82);	// @ (0x3B0 * 8 + 2)
#define                                 TU16BCRH2_bit       _BIT_ACCESS(TU16BCRH,2)
// TU16BCRH<TU16BCRH3>
extern volatile __bit                   TU16BCRH3           __at(0x1D83);	// @ (0x3B0 * 8 + 3)
#define                                 TU16BCRH3_bit       _BIT_ACCESS(TU16BCRH,3)
// TU16BCRH<TU16BCRH4>
extern volatile __bit                   TU16BCRH4           __at(0x1D84);	// @ (0x3B0 * 8 + 4)
#define                                 TU16BCRH4_bit       _BIT_ACCESS(TU16BCRH,4)
// TU16BCRH<TU16BCRH5>
extern volatile __bit                   TU16BCRH5           __at(0x1D85);	// @ (0x3B0 * 8 + 5)
#define                                 TU16BCRH5_bit       _BIT_ACCESS(TU16BCRH,5)
// TU16BCRH<TU16BCRH6>
extern volatile __bit                   TU16BCRH6           __at(0x1D86);	// @ (0x3B0 * 8 + 6)
#define                                 TU16BCRH6_bit       _BIT_ACCESS(TU16BCRH,6)
// TU16BCRH<TU16BCRH7>
extern volatile __bit                   TU16BCRH7           __at(0x1D87);	// @ (0x3B0 * 8 + 7)
#define                                 TU16BCRH7_bit       _BIT_ACCESS(TU16BCRH,7)
// TU16BCRL<TU16BCRL0>
extern volatile __bit                   TU16BCRL0           __at(0x1D78);	// @ (0x3AF * 8 + 0)
#define                                 TU16BCRL0_bit       _BIT_ACCESS(TU16BCRL,0)
// TU16BCRL<TU16BCRL1>
extern volatile __bit                   TU16BCRL1           __at(0x1D79);	// @ (0x3AF * 8 + 1)
#define                                 TU16BCRL1_bit       _BIT_ACCESS(TU16BCRL,1)
// TU16BCRL<TU16BCRL2>
extern volatile __bit                   TU16BCRL2           __at(0x1D7A);	// @ (0x3AF * 8 + 2)
#define                                 TU16BCRL2_bit       _BIT_ACCESS(TU16BCRL,2)
// TU16BCRL<TU16BCRL3>
extern volatile __bit                   TU16BCRL3           __at(0x1D7B);	// @ (0x3AF * 8 + 3)
#define                                 TU16BCRL3_bit       _BIT_ACCESS(TU16BCRL,3)
// TU16BCRL<TU16BCRL4>
extern volatile __bit                   TU16BCRL4           __at(0x1D7C);	// @ (0x3AF * 8 + 4)
#define                                 TU16BCRL4_bit       _BIT_ACCESS(TU16BCRL,4)
// TU16BCRL<TU16BCRL5>
extern volatile __bit                   TU16BCRL5           __at(0x1D7D);	// @ (0x3AF * 8 + 5)
#define                                 TU16BCRL5_bit       _BIT_ACCESS(TU16BCRL,5)
// TU16BCRL<TU16BCRL6>
extern volatile __bit                   TU16BCRL6           __at(0x1D7E);	// @ (0x3AF * 8 + 6)
#define                                 TU16BCRL6_bit       _BIT_ACCESS(TU16BCRL,6)
// TU16BCRL<TU16BCRL7>
extern volatile __bit                   TU16BCRL7           __at(0x1D7F);	// @ (0x3AF * 8 + 7)
#define                                 TU16BCRL7_bit       _BIT_ACCESS(TU16BCRL,7)
// TU16BCRT<TU16BCRT0>
extern volatile __bit                   TU16BCRT0           __at(0x1D90);	// @ (0x3B2 * 8 + 0)
#define                                 TU16BCRT0_bit       _BIT_ACCESS(TU16BCRT,0)
// TU16BCRT<TU16BCRT1>
extern volatile __bit                   TU16BCRT1           __at(0x1D91);	// @ (0x3B2 * 8 + 1)
#define                                 TU16BCRT1_bit       _BIT_ACCESS(TU16BCRT,1)
// TU16BCRT<TU16BCRT2>
extern volatile __bit                   TU16BCRT2           __at(0x1D92);	// @ (0x3B2 * 8 + 2)
#define                                 TU16BCRT2_bit       _BIT_ACCESS(TU16BCRT,2)
// TU16BCRT<TU16BCRT3>
extern volatile __bit                   TU16BCRT3           __at(0x1D93);	// @ (0x3B2 * 8 + 3)
#define                                 TU16BCRT3_bit       _BIT_ACCESS(TU16BCRT,3)
// TU16BCRT<TU16BCRT4>
extern volatile __bit                   TU16BCRT4           __at(0x1D94);	// @ (0x3B2 * 8 + 4)
#define                                 TU16BCRT4_bit       _BIT_ACCESS(TU16BCRT,4)
// TU16BCRT<TU16BCRT5>
extern volatile __bit                   TU16BCRT5           __at(0x1D95);	// @ (0x3B2 * 8 + 5)
#define                                 TU16BCRT5_bit       _BIT_ACCESS(TU16BCRT,5)
// TU16BCRT<TU16BCRT6>
extern volatile __bit                   TU16BCRT6           __at(0x1D96);	// @ (0x3B2 * 8 + 6)
#define                                 TU16BCRT6_bit       _BIT_ACCESS(TU16BCRT,6)
// TU16BCRT<TU16BCRT7>
extern volatile __bit                   TU16BCRT7           __at(0x1D97);	// @ (0x3B2 * 8 + 7)
#define                                 TU16BCRT7_bit       _BIT_ACCESS(TU16BCRT,7)
// TU16BHLT<TU16BCSYNC>
extern volatile __bit                   TU16BCSYNC          __at(0x1D6E);	// @ (0x3AD * 8 + 6)
#define                                 TU16BCSYNC_bit      _BIT_ACCESS(TU16BHLT,6)
// TU16BHLT<TU16BEPOL>
extern volatile __bit                   TU16BEPOL           __at(0x1D6F);	// @ (0x3AD * 8 + 7)
#define                                 TU16BEPOL_bit       _BIT_ACCESS(TU16BHLT,7)
// TU16BERS<TU16BERS0>
extern volatile __bit                   TU16BERS0           __at(0x1DC0);	// @ (0x3B8 * 8 + 0)
#define                                 TU16BERS0_bit       _BIT_ACCESS(TU16BERS,0)
// TU16BERS<TU16BERS1>
extern volatile __bit                   TU16BERS1           __at(0x1DC1);	// @ (0x3B8 * 8 + 1)
#define                                 TU16BERS1_bit       _BIT_ACCESS(TU16BERS,1)
// TU16BERS<TU16BERS2>
extern volatile __bit                   TU16BERS2           __at(0x1DC2);	// @ (0x3B8 * 8 + 2)
#define                                 TU16BERS2_bit       _BIT_ACCESS(TU16BERS,2)
// TU16BERS<TU16BERS3>
extern volatile __bit                   TU16BERS3           __at(0x1DC3);	// @ (0x3B8 * 8 + 3)
#define                                 TU16BERS3_bit       _BIT_ACCESS(TU16BERS,3)
// TU16BERS<TU16BERS4>
extern volatile __bit                   TU16BERS4           __at(0x1DC4);	// @ (0x3B8 * 8 + 4)
#define                                 TU16BERS4_bit       _BIT_ACCESS(TU16BERS,4)
// TU16BERS<TU16BERS5>
extern volatile __bit                   TU16BERS5           __at(0x1DC5);	// @ (0x3B8 * 8 + 5)
#define                                 TU16BERS5_bit       _BIT_ACCESS(TU16BERS,5)
// PIE10<TU16BIE>
extern volatile __bit                   TU16BIE             __at(0x25A2);	// @ (0x4B4 * 8 + 2)
#define                                 TU16BIE_bit         _BIT_ACCESS(PIE10,2)
// PIR10<TU16BIF>
extern volatile __bit                   TU16BIF             __at(0x2602);	// @ (0x4C0 * 8 + 2)
#define                                 TU16BIF_bit         _BIT_ACCESS(PIR10,2)
// IPR10<TU16BIP>
extern volatile __bit                   TU16BIP             __at(0x2542);	// @ (0x4A8 * 8 + 2)
#define                                 TU16BIP_bit         _BIT_ACCESS(IPR10,2)
// TU16BCON1<TU16BLIMIT>
extern volatile __bit                   TU16BLIMIT          __at(0x1D64);	// @ (0x3AC * 8 + 4)
#define                                 TU16BLIMIT_bit      _BIT_ACCESS(TU16BCON1,4)
// PMD5<TU16BMD>
extern volatile __bit                   TU16BMD             __at(0x33A);	// @ (0x67 * 8 + 2)
#define                                 TU16BMD_bit         _BIT_ACCESS(PMD5,2)
// TU16BCON0<TU16BOM>
extern volatile __bit                   TU16BOM             __at(0x1D5D);	// @ (0x3AB * 8 + 5)
#define                                 TU16BOM_bit         _BIT_ACCESS(TU16BCON0,5)
// TU16BCON0<TU16BON>
extern volatile __bit                   TU16BON             __at(0x1D5F);	// @ (0x3AB * 8 + 7)
#define                                 TU16BON_bit         _BIT_ACCESS(TU16BCON0,7)
// TU16BCON0<TU16BOPOL>
extern volatile __bit                   TU16BOPOL           __at(0x1D5C);	// @ (0x3AB * 8 + 4)
#define                                 TU16BOPOL_bit       _BIT_ACCESS(TU16BCON0,4)
// TU16BPRL<TU16BPR0>
extern volatile __bit                   TU16BPR0            __at(0x1D98);	// @ (0x3B3 * 8 + 0)
#define                                 TU16BPR0_bit        _BIT_ACCESS(TU16BPRL,0)
// TU16BPRL<TU16BPR1>
extern volatile __bit                   TU16BPR1            __at(0x1D99);	// @ (0x3B3 * 8 + 1)
#define                                 TU16BPR1_bit        _BIT_ACCESS(TU16BPRL,1)
// TU16BPRH<TU16BPR10>
extern volatile __bit                   TU16BPR10           __at(0x1DA2);	// @ (0x3B4 * 8 + 2)
#define                                 TU16BPR10_bit       _BIT_ACCESS(TU16BPRH,2)
// TU16BPRH<TU16BPR11>
extern volatile __bit                   TU16BPR11           __at(0x1DA3);	// @ (0x3B4 * 8 + 3)
#define                                 TU16BPR11_bit       _BIT_ACCESS(TU16BPRH,3)
// TU16BPRH<TU16BPR12>
extern volatile __bit                   TU16BPR12           __at(0x1DA4);	// @ (0x3B4 * 8 + 4)
#define                                 TU16BPR12_bit       _BIT_ACCESS(TU16BPRH,4)
// TU16BPRH<TU16BPR13>
extern volatile __bit                   TU16BPR13           __at(0x1DA5);	// @ (0x3B4 * 8 + 5)
#define                                 TU16BPR13_bit       _BIT_ACCESS(TU16BPRH,5)
// TU16BPRH<TU16BPR14>
extern volatile __bit                   TU16BPR14           __at(0x1DA6);	// @ (0x3B4 * 8 + 6)
#define                                 TU16BPR14_bit       _BIT_ACCESS(TU16BPRH,6)
// TU16BPRH<TU16BPR15>
extern volatile __bit                   TU16BPR15           __at(0x1DA7);	// @ (0x3B4 * 8 + 7)
#define                                 TU16BPR15_bit       _BIT_ACCESS(TU16BPRH,7)
// TU16BPRL<TU16BPR2>
extern volatile __bit                   TU16BPR2            __at(0x1D9A);	// @ (0x3B3 * 8 + 2)
#define                                 TU16BPR2_bit        _BIT_ACCESS(TU16BPRL,2)
// TU16BPRT<TU16BPR24>
extern volatile __bit                   TU16BPR24           __at(0x1DB0);	// @ (0x3B6 * 8 + 0)
#define                                 TU16BPR24_bit       _BIT_ACCESS(TU16BPRT,0)
// TU16BPRT<TU16BPR25>
extern volatile __bit                   TU16BPR25           __at(0x1DB1);	// @ (0x3B6 * 8 + 1)
#define                                 TU16BPR25_bit       _BIT_ACCESS(TU16BPRT,1)
// TU16BPRT<TU16BPR26>
extern volatile __bit                   TU16BPR26           __at(0x1DB2);	// @ (0x3B6 * 8 + 2)
#define                                 TU16BPR26_bit       _BIT_ACCESS(TU16BPRT,2)
// TU16BPRT<TU16BPR27>
extern volatile __bit                   TU16BPR27           __at(0x1DB3);	// @ (0x3B6 * 8 + 3)
#define                                 TU16BPR27_bit       _BIT_ACCESS(TU16BPRT,3)
// TU16BPRT<TU16BPR28>
extern volatile __bit                   TU16BPR28           __at(0x1DB4);	// @ (0x3B6 * 8 + 4)
#define                                 TU16BPR28_bit       _BIT_ACCESS(TU16BPRT,4)
// TU16BPRT<TU16BPR29>
extern volatile __bit                   TU16BPR29           __at(0x1DB5);	// @ (0x3B6 * 8 + 5)
#define                                 TU16BPR29_bit       _BIT_ACCESS(TU16BPRT,5)
// TU16BPRL<TU16BPR3>
extern volatile __bit                   TU16BPR3            __at(0x1D9B);	// @ (0x3B3 * 8 + 3)
#define                                 TU16BPR3_bit        _BIT_ACCESS(TU16BPRL,3)
// TU16BPRT<TU16BPR30>
extern volatile __bit                   TU16BPR30           __at(0x1DB6);	// @ (0x3B6 * 8 + 6)
#define                                 TU16BPR30_bit       _BIT_ACCESS(TU16BPRT,6)
// TU16BPRT<TU16BPR31>
extern volatile __bit                   TU16BPR31           __at(0x1DB7);	// @ (0x3B6 * 8 + 7)
#define                                 TU16BPR31_bit       _BIT_ACCESS(TU16BPRT,7)
// TU16BPRL<TU16BPR4>
extern volatile __bit                   TU16BPR4            __at(0x1D9C);	// @ (0x3B3 * 8 + 4)
#define                                 TU16BPR4_bit        _BIT_ACCESS(TU16BPRL,4)
// TU16BPRL<TU16BPR5>
extern volatile __bit                   TU16BPR5            __at(0x1D9D);	// @ (0x3B3 * 8 + 5)
#define                                 TU16BPR5_bit        _BIT_ACCESS(TU16BPRL,5)
// TU16BPRL<TU16BPR6>
extern volatile __bit                   TU16BPR6            __at(0x1D9E);	// @ (0x3B3 * 8 + 6)
#define                                 TU16BPR6_bit        _BIT_ACCESS(TU16BPRL,6)
// TU16BPRL<TU16BPR7>
extern volatile __bit                   TU16BPR7            __at(0x1D9F);	// @ (0x3B3 * 8 + 7)
#define                                 TU16BPR7_bit        _BIT_ACCESS(TU16BPRL,7)
// TU16BPRH<TU16BPR8>
extern volatile __bit                   TU16BPR8            __at(0x1DA0);	// @ (0x3B4 * 8 + 0)
#define                                 TU16BPR8_bit        _BIT_ACCESS(TU16BPRH,0)
// TU16BPRH<TU16BPR9>
extern volatile __bit                   TU16BPR9            __at(0x1DA1);	// @ (0x3B4 * 8 + 1)
#define                                 TU16BPR9_bit        _BIT_ACCESS(TU16BPRH,1)
// TU16BPRH<TU16BPRH0>
extern volatile __bit                   TU16BPRH0           __at(0x1DA0);	// @ (0x3B4 * 8 + 0)
#define                                 TU16BPRH0_bit       _BIT_ACCESS(TU16BPRH,0)
// TU16BPRH<TU16BPRH1>
extern volatile __bit                   TU16BPRH1           __at(0x1DA1);	// @ (0x3B4 * 8 + 1)
#define                                 TU16BPRH1_bit       _BIT_ACCESS(TU16BPRH,1)
// TU16BPRH<TU16BPRH2>
extern volatile __bit                   TU16BPRH2           __at(0x1DA2);	// @ (0x3B4 * 8 + 2)
#define                                 TU16BPRH2_bit       _BIT_ACCESS(TU16BPRH,2)
// TU16BPRH<TU16BPRH3>
extern volatile __bit                   TU16BPRH3           __at(0x1DA3);	// @ (0x3B4 * 8 + 3)
#define                                 TU16BPRH3_bit       _BIT_ACCESS(TU16BPRH,3)
// TU16BPRH<TU16BPRH4>
extern volatile __bit                   TU16BPRH4           __at(0x1DA4);	// @ (0x3B4 * 8 + 4)
#define                                 TU16BPRH4_bit       _BIT_ACCESS(TU16BPRH,4)
// TU16BPRH<TU16BPRH5>
extern volatile __bit                   TU16BPRH5           __at(0x1DA5);	// @ (0x3B4 * 8 + 5)
#define                                 TU16BPRH5_bit       _BIT_ACCESS(TU16BPRH,5)
// TU16BPRH<TU16BPRH6>
extern volatile __bit                   TU16BPRH6           __at(0x1DA6);	// @ (0x3B4 * 8 + 6)
#define                                 TU16BPRH6_bit       _BIT_ACCESS(TU16BPRH,6)
// TU16BPRH<TU16BPRH7>
extern volatile __bit                   TU16BPRH7           __at(0x1DA7);	// @ (0x3B4 * 8 + 7)
#define                                 TU16BPRH7_bit       _BIT_ACCESS(TU16BPRH,7)
// TU16BCON0<TU16BPRIE>
extern volatile __bit                   TU16BPRIE           __at(0x1D5A);	// @ (0x3AB * 8 + 2)
#define                                 TU16BPRIE_bit       _BIT_ACCESS(TU16BCON0,2)
// TU16BCON1<TU16BPRIF>
extern volatile __bit                   TU16BPRIF           __at(0x1D62);	// @ (0x3AC * 8 + 2)
#define                                 TU16BPRIF_bit       _BIT_ACCESS(TU16BCON1,2)
// TU16BPRL<TU16BPRL0>
extern volatile __bit                   TU16BPRL0           __at(0x1D98);	// @ (0x3B3 * 8 + 0)
#define                                 TU16BPRL0_bit       _BIT_ACCESS(TU16BPRL,0)
// TU16BPRL<TU16BPRL1>
extern volatile __bit                   TU16BPRL1           __at(0x1D99);	// @ (0x3B3 * 8 + 1)
#define                                 TU16BPRL1_bit       _BIT_ACCESS(TU16BPRL,1)
// TU16BPRL<TU16BPRL2>
extern volatile __bit                   TU16BPRL2           __at(0x1D9A);	// @ (0x3B3 * 8 + 2)
#define                                 TU16BPRL2_bit       _BIT_ACCESS(TU16BPRL,2)
// TU16BPRL<TU16BPRL3>
extern volatile __bit                   TU16BPRL3           __at(0x1D9B);	// @ (0x3B3 * 8 + 3)
#define                                 TU16BPRL3_bit       _BIT_ACCESS(TU16BPRL,3)
// TU16BPRL<TU16BPRL4>
extern volatile __bit                   TU16BPRL4           __at(0x1D9C);	// @ (0x3B3 * 8 + 4)
#define                                 TU16BPRL4_bit       _BIT_ACCESS(TU16BPRL,4)
// TU16BPRL<TU16BPRL5>
extern volatile __bit                   TU16BPRL5           __at(0x1D9D);	// @ (0x3B3 * 8 + 5)
#define                                 TU16BPRL5_bit       _BIT_ACCESS(TU16BPRL,5)
// TU16BPRL<TU16BPRL6>
extern volatile __bit                   TU16BPRL6           __at(0x1D9E);	// @ (0x3B3 * 8 + 6)
#define                                 TU16BPRL6_bit       _BIT_ACCESS(TU16BPRL,6)
// TU16BPRL<TU16BPRL7>
extern volatile __bit                   TU16BPRL7           __at(0x1D9F);	// @ (0x3B3 * 8 + 7)
#define                                 TU16BPRL7_bit       _BIT_ACCESS(TU16BPRL,7)
// TU16BPRT<TU16BPRT0>
extern volatile __bit                   TU16BPRT0           __at(0x1DB0);	// @ (0x3B6 * 8 + 0)
#define                                 TU16BPRT0_bit       _BIT_ACCESS(TU16BPRT,0)
// TU16BPRT<TU16BPRT1>
extern volatile __bit                   TU16BPRT1           __at(0x1DB1);	// @ (0x3B6 * 8 + 1)
#define                                 TU16BPRT1_bit       _BIT_ACCESS(TU16BPRT,1)
// TU16BPRT<TU16BPRT2>
extern volatile __bit                   TU16BPRT2           __at(0x1DB2);	// @ (0x3B6 * 8 + 2)
#define                                 TU16BPRT2_bit       _BIT_ACCESS(TU16BPRT,2)
// TU16BPRT<TU16BPRT3>
