garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f26q24.h
extern volatile __bit                   nBOR                __at(0x2780);	// @ (0x4F0 * 8 + 0)
#define                                 nBOR_bit            _BIT_ACCESS(PCON0,0)
// NVMCON0<nDONE>
extern volatile __bit                   nDONE               __at(0x200);	// @ (0x40 * 8 + 0)
#define                                 nDONE_bit           _BIT_ACCESS(NVMCON0,0)
// VDDIO2CON<nHYS>
extern volatile __bit                   nHYS                __at(0x86C);	// @ (0x10D * 8 + 4)
#define                                 nHYS_bit            _BIT_ACCESS(VDDIO2CON,4)
// VDDIO2CON<nIOMON>
extern volatile __bit                   nIOMON              __at(0x86F);	// @ (0x10D * 8 + 7)
#define                                 nIOMON_bit          _BIT_ACCESS(VDDIO2CON,7)
// PCON1<nMEMV>
extern volatile __bit                   nMEMV               __at(0x2789);	// @ (0x4F1 * 8 + 1)
#define                                 nMEMV_bit           _BIT_ACCESS(PCON1,1)
// PCON0<nPOR>
extern volatile __bit                   nPOR                __at(0x2781);	// @ (0x4F0 * 8 + 1)
#define                                 nPOR_bit            _BIT_ACCESS(PCON0,1)
// PCON1<nRCM>
extern volatile __bit                   nRCM                __at(0x2788);	// @ (0x4F1 * 8 + 0)
#define                                 nRCM_bit            _BIT_ACCESS(PCON1,0)
// PCON0<nRI>
extern volatile __bit                   nRI                 __at(0x2782);	// @ (0x4F0 * 8 + 2)
#define                                 nRI_bit             _BIT_ACCESS(PCON0,2)
// PCON0<nRMCLR>
extern volatile __bit                   nRMCLR              __at(0x2783);	// @ (0x4F0 * 8 + 3)
#define                                 nRMCLR_bit          _BIT_ACCESS(PCON0,3)
// PCON1<nRVREG>
extern volatile __bit                   nRVREG              __at(0x278A);	// @ (0x4F1 * 8 + 2)
#define                                 nRVREG_bit          _BIT_ACCESS(PCON1,2)
// PCON0<nRWDT>
extern volatile __bit                   nRWDT               __at(0x2784);	// @ (0x4F0 * 8 + 4)
#define                                 nRWDT_bit           _BIT_ACCESS(PCON0,4)
// T1CON<nT1SYNC>
extern volatile __bit                   nT1SYNC             __at(0x18A2);	// @ (0x314 * 8 + 2)
#define                                 nT1SYNC_bit         _BIT_ACCESS(T1CON,2)
// T3CON<nT3SYNC>
extern volatile __bit                   nT3SYNC             __at(0x192A);	// @ (0x325 * 8 + 2)
#define                                 nT3SYNC_bit         _BIT_ACCESS(T3CON,2)
// PCON0<nWDTWV>
extern volatile __bit                   nWDTWV              __at(0x2785);	// @ (0x4F0 * 8 + 5)
#define                                 nWDTWV_bit          _BIT_ACCESS(PCON0,5)

#endif // _PIC18F26Q24_H_
